[
  {
    "name": "Canada Day",
    "start_date": "01-07-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Canada Day commemorates the anniversary of July 1, 1867, when the British North America Act, 1867 united three British colonies into the single Dominion of Canada.  This act established Canada as a self-governing nation within the British Empire, laying the groundwork for its future independence.",
      "significance": "Canada Day is a powerful symbol of national unity and pride, celebrating the country's diverse culture and history.  It's a time for reflection on Canada's achievements and challenges, fostering a sense of shared identity amongst Canadians.",
      "observance_details": "Traditionally, Canada Day involved official ceremonies, parades, and patriotic speeches.  Citizens would display the Canadian flag, sing the national anthem, and attend community events celebrating Canada's heritage.",
      "modern_celebration": "Modern celebrations are vibrant and diverse, featuring fireworks displays, concerts, festivals, and barbecues across the country. Many participate in community events, visit historical sites, and enjoy time with family and friends.  Indigenous communities often host events to highlight their perspectives and contributions to Canadian history.",
      "impact_and_legacy": "Canada Day continues to shape Canadian identity by fostering national unity and pride.  The event serves as a reminder of Canada's progress and inspires reflection on its future.  It promotes a sense of belonging and reinforces the values of multiculturalism and inclusivity."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:36:28 UTC",
    "end_date": "01-07-25",
    "last_updated": "2025-01-04 12:39:01 UTC",
    "source_urls": [
      "https://www.ontario.ca/page/ontarios-celebrations-and-commemorations",
      "https://www.canada.ca/en/canadian-heritage/services/important-commemorative-days.html",
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Remembrance Day",
    "start_date": "05-11-25",
    "additional_details": "We pay tribute to the men and women of all backgrounds who have served and continue to serve our country during times of war, conflict and peace.",
    "additional_information": {
      "historical_background": "Remembrance Day originates from Armistice Day, commemorating the end of World War I on November 11, 1918.  The British Commonwealth adopted it, later expanding to remember casualties of all wars.  It evolved into a day of reflection and remembrance for those who served and died in conflict.",
      "significance": "Remembrance Day holds deep cultural and social significance as a time for national mourning and reflection on the sacrifices made in war. It fosters unity and patriotism while serving as a reminder of the devastating consequences of conflict. The event encourages remembrance of those lost and a commitment to peace.",
      "observance_details": "Traditionally, Remembrance Day is observed with a two-minute silence at 11:00 am on November 11th, the moment the armistice was signed.  Poppy wreaths are laid at war memorials, and services are held to honor the fallen.  Parades and ceremonies are common, showcasing military participation.",
      "modern_celebration": "Modern celebrations maintain the two-minute silence and wreath-laying ceremonies but also incorporate educational programs and community events.  Many wear poppies to show remembrance, and social media widely participates in sharing messages of respect.  Schools and community groups often hold special events and services.",
      "impact_and_legacy": "Remembrance Day has had a profound impact, fostering a collective national memory of wartime sacrifice.  It reinforces the value of peace and reconciliation.  The enduring legacy is a commitment to remember the fallen and prevent future conflicts through promoting peace and understanding."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:36:32 UTC",
    "end_date": "11-11-25",
    "last_updated": "2025-01-04 12:36:28 UTC",
    "source_urls": [
      "https://www.ontario.ca/page/ontarios-celebrations-and-commemorations"
    ]
  },
  {
    "name": "Family Day",
    "start_date": "17-02-25",
    "additional_details": "",
    "additional_information": {
      "historical_background": "Family Day's origins are diverse, with many countries adopting variations independently.  Some trace it to earlier traditions emphasizing family unity, while others tie it to specific historical events promoting family values.  Its modern form emerged in various places during the late 20th century, gaining popularity gradually.",
      "significance": "Family Day underscores the importance of family bonds in society. It promotes stronger family relationships and recognizes the crucial role families play in raising future generations. The event aims to foster love, respect, and support within families and communities.",
      "observance_details": "Traditional observances vary widely depending on cultural context.  Common practices include family gatherings, meals, and shared activities.  Emphasis is often placed on spending quality time together and reaffirming family ties.",
      "modern_celebration": "Modern celebrations are diverse and adaptable. Families might participate in outings, games, picnics, or home-based activities such as cooking together or watching movies.  Many utilize social media to share family moments and connect with loved ones afar.",
      "impact_and_legacy": "Family Day contributes to stronger community bonds by emphasizing family values. It creates opportunities for intergenerational connection and strengthens familial relationships. The day's legacy lies in its ongoing promotion of family unity and well-being."
    },
    "alternate_names": [
      "Ontario Family Day",
      "Provincial Family Day"
    ],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:36:35 UTC",
    "end_date": "17-02-25",
    "last_updated": "2025-01-04 12:36:32 UTC",
    "source_urls": [
      "https://www.ontario.ca/page/ontarios-celebrations-and-commemorations"
    ]
  },
  {
    "name": "Sir John A. Macdonald Day",
    "start_date": "11-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Sir John A. Macdonald Day commemorates the birth of John A. Macdonald, Canada's first Prime Minister.  Established to honor his role in Confederation, the day's observance varies across Canada.",
      "significance": "The day holds significance as a tribute to a pivotal figure in Canadian history.  It's a time to reflect on the nation's founding and the complexities of its past.  However, the celebration is also increasingly debated due to Macdonald's policies toward Indigenous peoples.",
      "observance_details": "Traditionally, Sir John A. Macdonald Day involved formal ceremonies, speeches, and historical reenactments.  Parades and community gatherings were common.  Schools often included lessons on his life and contributions to Canada's formation.",
      "modern_celebration": "Modern celebrations are varied and often include debates about Macdonald's legacy.  Some communities host events focusing on his accomplishments while others prioritize discussions on his controversial policies.  Educational initiatives often focus on a more nuanced historical perspective.",
      "impact_and_legacy": "Macdonald's legacy is complex and continues to shape Canadian identity.  While his role in Confederation is undeniable, his policies toward Indigenous peoples remain a source of ongoing discussion and reconciliation efforts.  His impact on the development of Canada is both celebrated and critically examined."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:36:38 UTC",
    "end_date": "11-01-25",
    "last_updated": "2025-01-04 12:36:34 UTC",
    "source_urls": [
      "https://www.canada.ca/en/canadian-heritage/services/important-commemorative-days.html"
    ]
  },
  {
    "name": "St. Patrick's Day",
    "start_date": "17-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "St. Patrick's Day commemorates Saint Patrick, the foremost patron saint of Ireland.  While the exact dates of his life are unknown, tradition holds he brought Christianity to Ireland in the 5th century.  The earliest celebrations were likely religious observances, evolving over time.",
      "significance": "The holiday is deeply rooted in Irish culture and heritage, symbolizing national pride and identity. It's a time for celebrating Irish culture, history, and the strong bonds of the Irish diaspora worldwide.  It represents a connection to ancestral roots and a shared cultural experience.",
      "observance_details": "Traditional observances included religious services and feasts.  Parades, featuring Irish music and dance, developed later, alongside the wearing of green clothing and shamrocks.  Family gatherings and community celebrations have long been central to the day.",
      "modern_celebration": "Modern celebrations are characterized by large-scale parades in cities worldwide, featuring vibrant floats and marching bands.  Pubs and restaurants host special events, often involving traditional Irish music and food.  Wearing green remains a popular custom, alongside festive decorations and themed merchandise.",
      "impact_and_legacy": "St. Patrick's Day has had a significant global impact, fostering a sense of Irish identity and community across the world.  It has also helped increase awareness of Irish culture and history.  Its continued popularity reflects the enduring appeal of its traditions and the strong sense of community it fosters."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:36:39 UTC",
    "end_date": "17-03-25",
    "last_updated": "2025-01-04 12:37:11 UTC",
    "source_urls": [
      "https://www.ontario.ca/page/ontarios-celebrations-and-commemorations",
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "National Flag of Canada Day",
    "start_date": "15-02-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "National Flag of Canada Day, officially recognized since 1996, commemorates the adoption of the Canadian flag on February 15, 1965.  This followed years of debate and design proposals, culminating in the maple leaf design becoming the nation's official flag. The adoption signified a distinct Canadian identity separate from British influence.",
      "significance": "The day holds significant cultural and national unity meaning, symbolizing Canadian identity and pride. It serves as a reminder of the country's journey towards self-determination and its distinct national character.  The flag itself is a potent symbol of shared values and patriotism.",
      "observance_details": "Traditionally, the day involves flag-raising ceremonies across the country, often accompanied by speeches and patriotic music. Schools and other institutions often participate in educational programs promoting Canadian history and identity.  Many citizens display the flag on their homes and businesses.",
      "modern_celebration": "Modern celebrations are diverse, ranging from community events and parades to family gatherings featuring Canadian-themed food and activities.  Many individuals and organizations use social media to express their Canadian pride, sharing images and messages of patriotism.  Educational initiatives continue to focus on the flag's history and symbolism.",
      "impact_and_legacy": "The adoption of the flag and the subsequent celebration of National Flag of Canada Day have helped solidify a sense of national unity and identity. It has contributed to a stronger sense of Canadian pride and patriotism among citizens.  The day continues to reinforce the shared history and values that bind Canadians together."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:36:42 UTC",
    "end_date": "15-02-25",
    "last_updated": "2025-01-04 12:36:38 UTC",
    "source_urls": [
      "https://www.canada.ca/en/canadian-heritage/services/important-commemorative-days.html"
    ]
  },
  {
    "name": "Emancipation Day",
    "start_date": "01-08-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Emancipation Day commemorates the emancipation of enslaved African people.  Its specific date and significance vary by location, often tied to local legislation or specific acts abolishing slavery.  For example, in some Caribbean nations, it marks the formal end of slavery, while in the United States, it's often associated with the Emancipation Proclamation.",
      "significance": "Emancipation Day holds immense cultural and social significance as a symbol of freedom and the ongoing struggle for racial justice. It represents a pivotal moment in history, marking a transition away from the brutal system of chattel slavery and towards a more equitable future. It is a time for reflection on the past and renewed commitment to equality.",
      "observance_details": "Traditional observances vary regionally.  They may include religious services, parades, speeches commemorating abolitionists and freedom fighters, and community gatherings.  Historical reenactments and educational programs often form part of the commemorations.",
      "modern_celebration": "Modern celebrations often involve community festivals, educational programs focusing on the history of slavery and the ongoing fight for racial equality, and artistic performances highlighting Black culture and resilience.  Many communities utilize this day as an opportunity for reflection and advocacy.",
      "impact_and_legacy": "Emancipation Day has had a profound impact on shaping social movements for civil rights and equality. It serves as a reminder of the persistent need for justice and continues to inspire efforts towards dismantling systemic racism and inequality. The legacy of this day resonates in ongoing calls for social justice and equity."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:36:43 UTC",
    "end_date": "01-08-25",
    "last_updated": "2025-01-04 12:41:10 UTC",
    "source_urls": [
      "https://www.ontario.ca/page/ontarios-celebrations-and-commemorations",
      "https://www.canada.ca/en/canadian-heritage/services/important-commemorative-days.html",
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Commonwealth Day",
    "start_date": "14-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Commonwealth Day, formerly Empire Day, originated in 1958 following the establishment of the Commonwealth of Nations.  It evolved from Empire Day, a celebration of the British Empire, reflecting a shift towards a voluntary association of independent states.  The first Commonwealth Day was observed on May 24, 1977.",
      "significance": "Commonwealth Day promotes the values of democracy, peace, and human rights shared by its member states.  It fosters cooperation and understanding between diverse cultures and backgrounds. The day underscores the shared history and heritage while celebrating the unique identities of each nation.",
      "observance_details": "Traditionally, Commonwealth Day involved church services, parades, and community events.  Flags of member nations were displayed, and speeches often highlighted the Commonwealth's achievements and goals. Educational programs focused on the history and diversity of the Commonwealth.",
      "modern_celebration": "Modern celebrations often include interfaith services, educational initiatives, and community gatherings.  Many Commonwealth countries participate in events emphasizing youth involvement and global citizenship.  Online platforms and social media have increased awareness and participation.",
      "impact_and_legacy": "Commonwealth Day has fostered a sense of global community and interconnectedness.  It has contributed to international cooperation in areas such as trade, education, and healthcare.  Its enduring legacy is its promotion of peaceful relations and mutual respect among diverse nations."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:36:45 UTC",
    "end_date": "14-03-25",
    "last_updated": "2025-01-04 12:36:42 UTC",
    "source_urls": [
      "https://www.canada.ca/en/canadian-heritage/services/important-commemorative-days.html"
    ]
  },
  {
    "name": "Victoria Day",
    "start_date": "24-05-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Victoria Day is a Canadian federal holiday commemorating the birthday of Queen Victoria, who reigned from 1837 to 1901.  It was first observed in 1845 and became a statutory holiday in 1890. The date varies annually, falling on the Monday before May 25th.",
      "significance": "The holiday signifies a connection to Canada's British heritage and celebrates a significant monarch in Canadian history. It serves as a long weekend for many Canadians, providing an opportunity for relaxation and social gatherings.",
      "observance_details": "Traditionally, Victoria Day involved church services and formal celebrations.  Many communities hosted parades and public events, showcasing local talent and pride. Family gatherings were also common.",
      "modern_celebration": "Modern celebrations include barbecues, picnics, outdoor activities, and family gatherings. Many communities continue to host parades and fireworks displays.  It's generally a time for relaxation and enjoying the start of warmer weather.",
      "impact_and_legacy": "Victoria Day contributes to Canadian national identity, albeit with a changing perspective on its colonial ties.  As a long weekend, it boosts tourism and provides a significant economic benefit.  Its continued observance reflects a continued recognition of historical figures and Canadian traditions."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:36:49 UTC",
    "end_date": "24-05-25",
    "last_updated": "2025-01-04 12:36:45 UTC",
    "source_urls": [
      "https://www.canada.ca/en/canadian-heritage/services/important-commemorative-days.html"
    ]
  },
  {
    "name": "National Indigenous Peoples Day",
    "start_date": "21-06-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "National Indigenous Peoples Day in Canada originated from the decision in 1996 to replace Columbus Day with a day to celebrate Indigenous cultures.  It was officially proclaimed in 1996 by the then-Governor General Roméo LeBlanc and has since become a day of national recognition and celebration.",
      "significance": "The day is deeply significant for recognizing the heritage, diverse cultures, and contributions of First Nations, Inuit, and Métis peoples.  It serves as a powerful statement of reconciliation and a commitment to fostering understanding and respect.",
      "observance_details": "Traditionally, celebrations involved gatherings, storytelling, ceremonies, and the sharing of traditional foods and arts. Many communities held feasts and powwows, showcasing their unique cultural expressions and practices.",
      "modern_celebration": "Modern celebrations often include community events, festivals, powwows, educational workshops, and artistic performances.  Many cities and towns host parades and public gatherings to honour Indigenous culture and history.  Increased media coverage and educational initiatives provide broader public awareness.",
      "impact_and_legacy": "National Indigenous Peoples Day has fostered greater awareness and appreciation for Indigenous cultures. It contributes to a more inclusive society by promoting understanding and challenging stereotypes.  It serves as a platform for reconciliation efforts and encourages further dialogue and action on issues impacting Indigenous peoples."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:36:52 UTC",
    "end_date": "21-06-25",
    "last_updated": "2025-01-04 12:40:09 UTC",
    "source_urls": [
      "https://www.canada.ca/en/canadian-heritage/services/important-commemorative-days.html",
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Saint-Jean-Baptiste Day",
    "start_date": "24-06-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Saint-Jean-Baptiste Day, celebrated annually on June 24th, commemorates the birth of John the Baptist, a key figure in Christianity.  Its celebration in Quebec dates back to the early French colonization of New France, becoming intertwined with Québécois identity and nationalism.",
      "significance": "The holiday is deeply rooted in Québécois culture, representing a celebration of their unique heritage and French-Canadian identity. It serves as a powerful symbol of national pride and cultural preservation within Canada.",
      "observance_details": "Traditional observances include religious masses, parades featuring vibrant floats and folk music, and family gatherings with festive meals.  Celebrations often include traditional Québécois music and dance.",
      "modern_celebration": "Modern celebrations incorporate a mix of traditional and contemporary elements, featuring concerts, festivals, and community events across Quebec. Many cities host large-scale parades and outdoor concerts, making it a significant public holiday.",
      "impact_and_legacy": "Saint-Jean-Baptiste Day has played a crucial role in shaping Québécois identity and fostering a sense of community.  Its enduring legacy continues to promote cultural pride and solidarity amongst French-Canadians."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:36:55 UTC",
    "end_date": "24-06-25",
    "last_updated": "2025-01-04 12:42:22 UTC",
    "source_urls": [
      "https://www.canada.ca/en/canadian-heritage/services/important-commemorative-days.html",
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "National Day for Truth and Reconciliation",
    "start_date": "30-09-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "The National Day for Truth and Reconciliation in Canada is observed annually on September 30th.  It stems from the findings of the Truth and Reconciliation Commission of Canada, established to investigate the impacts of the residential school system on Indigenous peoples.  The day serves as a commemoration of the tragic legacy of these schools.",
      "significance": "This day holds profound cultural and social significance for Indigenous peoples and all Canadians. It's an opportunity for reflection on the historical injustices inflicted upon Indigenous communities through the residential school system. It aims to promote understanding, healing, and reconciliation.",
      "observance_details": "Traditional observances often include ceremonies, educational events, and moments of silence to honour the survivors and victims of residential schools.  Many individuals participate in acts of remembrance and reflection.  Communities may host events focused on Indigenous culture and history.",
      "modern_celebration": "Modern celebrations involve widespread participation in events honouring Indigenous culture and history.  Many organizations and individuals wear orange shirts, a symbol of remembrance and support for survivors. Educational initiatives and community gatherings promoting awareness and understanding are common.",
      "impact_and_legacy": "The day has raised awareness about the lasting effects of the residential school system on Indigenous communities.  It continues to push for reconciliation and justice.  However, challenges remain in addressing the complex legacy of this dark chapter in Canadian history."
    },
    "alternate_names": [
      "Orange Shirt Day"
    ],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:36:59 UTC",
    "end_date": "30-09-25",
    "last_updated": "2025-01-04 12:36:55 UTC",
    "source_urls": [
      "https://www.canada.ca/en/canadian-heritage/services/important-commemorative-days.html"
    ]
  },
  {
    "name": "Persons Day",
    "start_date": "18-10-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Persons Day, also known as National Persons Day, doesn't have a widely recognized or established historical origin tied to a specific date or event.  It appears to be a relatively recent and less formally recognized occasion, lacking a strong historical foundation compared to more established holidays.",
      "significance": "The significance of Persons Day, if celebrated, would likely focus on the importance of individual human beings and their inherent worth.  It could be seen as a day to appreciate the diversity of humanity and the unique contributions of each person. The meaning is largely dependent on individual or group interpretation.",
      "observance_details": "Traditional observance of Persons Day, if any exists, would likely involve acts of kindness, recognition of others' accomplishments, and promoting a sense of community and understanding.  There aren't established traditions or rituals widely associated with this day.",
      "modern_celebration": "Modern celebrations, if any, are likely informal and vary considerably.  Individuals might choose to express appreciation for people in their lives or participate in acts of service.  Online engagement may involve sharing positive messages or stories about people making a difference.",
      "impact_and_legacy": "Given its lack of established history, Persons Day hasn't had a significant societal impact or lasting legacy.  However, the concept it represents – recognizing the value of every person – could be a positive influence if adopted more widely. The promotion of human connection and kindness is its potential lasting benefit."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:37:03 UTC",
    "end_date": "18-10-25",
    "last_updated": "2025-01-04 12:36:59 UTC",
    "source_urls": [
      "https://www.canada.ca/en/canadian-heritage/services/important-commemorative-days.html"
    ]
  },
  {
    "name": "Indigenous Veterans Day",
    "start_date": "08-11-25",
    "additional_details": null,
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:37:03 UTC",
    "end_date": "08-11-25",
    "last_updated": "2025-01-04 12:37:03 UTC",
    "source_urls": [
      "https://www.canada.ca/en/canadian-heritage/services/important-commemorative-days.html"
    ]
  },
  {
    "name": "Remembrance Day",
    "start_date": "11-11-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Remembrance Day originated in the aftermath of World War I to commemorate the armistice signed on November 11, 1918, ending hostilities on the Western Front.  Initially known as Armistice Day, it evolved to encompass remembrance of all victims of war.",
      "significance": "It holds profound cultural significance as a time for national mourning and reflection on the sacrifices made in conflicts.  It serves as a reminder of the importance of peace and the devastating impact of war on individuals and nations.",
      "observance_details": "Traditionally observed with a two-minute silence at 11:00 am on November 11th, the eleventh hour of the eleventh day of the eleventh month.  Poppy-wearing is a prominent symbol of remembrance, along with ceremonies at war memorials and cenotaphs.",
      "modern_celebration": "Modern celebrations involve similar acts of remembrance, including parades, church services, and wreath-laying ceremonies.  Many countries hold events throughout the day, combining official commemorations with community gatherings and educational programs.",
      "impact_and_legacy": "Remembrance Day has fostered a culture of remembrance and respect for fallen soldiers.  It contributes to discussions around peace, conflict resolution, and the enduring human cost of war, shaping public consciousness across generations."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:37:07 UTC",
    "end_date": "11-11-25",
    "last_updated": "2025-01-04 12:37:03 UTC",
    "source_urls": [
      "https://www.canada.ca/en/canadian-heritage/services/important-commemorative-days.html"
    ]
  },
  {
    "name": "National Day of Remembrance and Action on Violence Against Women",
    "start_date": "06-12-25",
    "additional_details": null,
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:37:07 UTC",
    "end_date": "06-12-25",
    "last_updated": "2025-01-04 12:37:07 UTC",
    "source_urls": [
      "https://www.canada.ca/en/canadian-heritage/services/important-commemorative-days.html"
    ]
  },
  {
    "name": "Vikram New Year",
    "start_date": "22-04-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Vikram Samvat, the Vikram New Year, is a lunisolar Hindu calendar era that starts on Chaitra Shukla Pratipada, the first day of the bright fortnight of the month of Chaitra.  Its origin is debated, with some linking it to the legendary King Vikramaditya, while others suggest a different origin tied to ancient Indian astronomical calculations.  It's widely used across India and Nepal for religious and social purposes.",
      "significance": "Vikram Samvat holds immense cultural and religious significance for Hindus, marking the start of a new year and offering a time for renewal and reflection.  It's intertwined with numerous festivals and celebrations, reflecting the diverse regional traditions across India. Its use in dating historical and religious events contributes to cultural preservation.",
      "observance_details": "Traditionally, the new year is welcomed with prayers, family gatherings, and feasts.  People visit temples, perform pujas (religious rituals), and exchange gifts and greetings.  The day is considered auspicious for starting new ventures and undertaking significant activities.",
      "modern_celebration": "Modern celebrations often incorporate aspects of traditional practices alongside contemporary festivities.  Celebrations include social gatherings, family meals, cultural programs, and the exchange of electronic greetings.  The use of social media and digital platforms further expands the reach and participation in the celebrations.",
      "impact_and_legacy": "Vikram Samvat's continuous usage for centuries showcases its enduring influence on Indian culture and society.  It plays a vital role in maintaining a historical chronology for numerous events and traditions. Its continued relevance ensures the preservation of a crucial aspect of Indian heritage and identity."
    },
    "alternate_names": [],
    "category": "Hinduism",
    "created_at": "2025-01-04 12:37:07 UTC",
    "end_date": "22-04-25",
    "last_updated": "2025-01-04 12:37:03 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Shrove Tuesday",
    "start_date": "25-02-25",
    "additional_details": null,
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-04 12:37:07 UTC",
    "end_date": "25-02-25",
    "last_updated": "2025-01-04 12:37:07 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Āshūrā",
    "start_date": "05-07-25",
    "additional_details": null,
    "alternate_names": [
      "Ashura",
      "Yawm Ashura",
      "Day of Ashura"
    ],
    "category": "Islam",
    "created_at": "2025-01-04 12:37:08 UTC",
    "end_date": "06-07-25",
    "last_updated": "2025-01-04 12:42:22 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ],
    "additional_information": {
      "historical_background": "Āshūrā commemorates the martyrdom of Imam Hussein, the grandson of the Prophet Muhammad, and his companions at the Battle of Karbala in 680 CE.  It marks a pivotal event in Shia Islam, signifying a struggle for justice and against oppression. The event's roots lie in the early Islamic period following the death of Prophet Muhammad.",
      "significance": "Āshūrā is a day of mourning and remembrance for Shia Muslims, embodying themes of sacrifice, loyalty, and resistance to tyranny. It's a deeply emotional and spiritual event, fostering communal solidarity and reinforcing religious identity. The event also holds symbolic significance for Sunni Muslims, albeit with differing interpretations.",
      "observance_details": "Traditional observances include mourning processions, recitations of elegies (marsiyas), and self-flagellation (matam) as expressions of grief and devotion.  Many abstain from food and drink, engaging in prayer and reflection.  The day is characterized by solemn rituals and communal grieving.",
      "modern_celebration": "Modern celebrations involve large-scale processions, often featuring dramatic reenactments of the events of Karbala.  The use of media and technology has broadened the dissemination of mourning rituals, reaching global Shia communities.  Many contemporary observances focus on humanitarian and social justice initiatives inspired by Hussein's sacrifice.",
      "impact_and_legacy": "Āshūrā's enduring legacy lies in its sustained influence on Shia identity and social activism. It continues to inspire movements for social justice and resistance against oppression, serving as a potent symbol of unwavering faith.  The event's emphasis on compassion and sacrifice has profoundly impacted social values within Shia communities and beyond."
    }
  },
  {
    "name": "Palm Sunday",
    "start_date": "13-04-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Palm Sunday commemorates Jesus' triumphal entry into Jerusalem, described in the Gospels.  The event, occurring a week before Passover, marks the beginning of Holy Week in the Christian calendar. Its origins trace back to the early Church's liturgical celebrations.",
      "significance": "Palm Sunday signifies Jesus's claim to kingship and the beginning of his final week, leading to his crucifixion and resurrection.  It's a pivotal point in the Christian faith, highlighting the themes of hope, sacrifice, and ultimate victory over death. The waving of palm branches symbolizes victory and rejoicing.",
      "observance_details": "Traditionally, Palm Sunday involves processions carrying palm branches or olive branches, symbolizing victory and peace.  Many churches read passages from the Gospels narrating Jesus' entry into Jerusalem.  Blessings of the palms are a common practice.",
      "modern_celebration": "Modern celebrations often involve church services with readings from the Gospels and the blessing of palms.  Processions may be incorporated, though sometimes more subdued.  Many families bring palms home as a reminder of the event and its significance.",
      "impact_and_legacy": "Palm Sunday continues to shape Christian understanding of Jesus' ministry and sacrifice.  Its enduring legacy lies in its powerful symbolism and its role in preparing Christians for the events of Holy Week leading up to Easter.  It remains a significant day in the Christian liturgical calendar worldwide."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-04 12:37:11 UTC",
    "end_date": "13-04-25",
    "last_updated": "2025-01-04 12:37:08 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Navaratri",
    "start_date": "12-10-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Navaratri, meaning 'nine nights', is a Hindu festival celebrating the victory of good over evil.  Its origins are rooted in ancient scriptures, with varying legends associated with different manifestations of the Divine Feminine.  The festival is celebrated across India and the diaspora with regional variations.",
      "significance": "Navaratri signifies the triumph of Goddess Durga over the demon Mahishasura, representing the victory of virtue and dharma. It is a time of spiritual renewal, self-reflection, and devotion, emphasizing the power of feminine divinity.",
      "observance_details": "Traditionally, Navaratri involves nine days of fasting, prayer, and devotional worship dedicated to different forms of the Goddess Durga.  People perform pujas (rituals), chant mantras, and often observe strict vegetarian diets.  Specific rituals and practices vary across regions and communities.",
      "modern_celebration": "Modern celebrations incorporate vibrant cultural events, including dandiya dances (stick dances), garba (circle dances), and elaborate processions.  These festivities are often community-driven, involving large gatherings and showcasing traditional costumes and music.",
      "impact_and_legacy": "Navaratri fosters social harmony, reinforcing community bonds through shared participation in celebrations.  Its enduring legacy lies in the perpetuation of Hindu traditions, the reverence for the Divine Feminine, and its role as a vibrant cultural festival."
    },
    "alternate_names": [
      "Navratri",
      "Durga Puja",
      "Dussehra"
    ],
    "category": "Hinduism",
    "created_at": "2025-01-04 12:37:15 UTC",
    "end_date": "12-10-24",
    "last_updated": "2025-01-04 12:38:26 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Vaisakhi",
    "start_date": "13-04-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Vaisakhi marks the beginning of the solar new year for many Sikhs and Hindus.  For Sikhs, it commemorates the founding of the Khalsa Panth in 1699 by the tenth Sikh Guru, Gobind Singh.  It also holds significance for Hindus as a harvest festival.",
      "significance": "Vaisakhi is a time of renewal and celebration, signifying the triumph of good over evil.  It's a key event in the Sikh calendar, strengthening communal bonds and religious identity.  For Hindus, it celebrates the harvest and marks the start of a new cycle of prosperity.",
      "observance_details": "Traditional observances include attending special prayers at Gurdwaras (Sikh temples), where the Guru Granth Sahib is adorned.  Langar (community kitchen) provides free meals to all.  Kirtan (devotional singing) and Katha (religious discourses) are common.",
      "modern_celebration": "Modern celebrations involve vibrant parades, known as Nagar Kirtan, featuring floats, music, and dancing.  Families gather for feasts and special gatherings.  Many participate in community service and charity events.",
      "impact_and_legacy": "Vaisakhi fosters a strong sense of community and shared identity among Sikhs worldwide.  Its emphasis on equality, service, and spiritual growth continues to inspire social action and positive change.  The festival's vibrant celebrations maintain cultural heritage across generations."
    },
    "alternate_names": [
      "Baisakhi",
      "Vaisakhdi",
      "Khalsa Day"
    ],
    "category": "Sikhism",
    "created_at": "2025-01-04 12:37:19 UTC",
    "end_date": "13-04-25",
    "last_updated": "2025-01-04 12:37:15 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Yalda",
    "start_date": "21-12-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Yalda, also known as Shab-e Yalda or Shab-e Chelleh, is an ancient Iranian festival celebrating the winter solstice.  Its origins are linked to pre-Zoroastrian traditions, with roots in the celebration of the sun's rebirth and the triumph of light over darkness.  Over time, it became interwoven with Persian culture and mythology.",
      "significance": "Yalda is a significant cultural event symbolizing hope, renewal, and the victory of light over darkness. It's a time for families to gather, strengthening bonds and sharing stories.  The festival reinforces the importance of community and shared traditions across generations.",
      "observance_details": "Traditionally, families gather on the longest night of the year, staying up late to read poetry (often works by Hafez), tell stories, and eat fruits like pomegranates and watermelons, symbolizing the sun and fertility.  They may also enjoy various nuts and sweets.",
      "modern_celebration": "Modern celebrations retain many traditional aspects but often incorporate modern entertainment, such as music and games. Families may still read poetry, but they might also watch movies or share photos.  Social media plays a significant role in connecting family and friends across geographical distances.",
      "impact_and_legacy": "Yalda continues to be a cherished festival in Iran and among Iranian diaspora communities globally. It fosters a strong sense of cultural identity and provides a powerful connection to ancestral traditions.  The festival's emphasis on family and community strengthens social cohesion and promotes cultural preservation."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:37:23 UTC",
    "end_date": "21-12-24",
    "last_updated": "2025-01-04 12:37:19 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Ganesh Chaturthi",
    "start_date": "02-09-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Ganesh Chaturthi commemorates the birth of Lord Ganesha, the elephant-headed Hindu god of wisdom and prosperity.  Its origins are traced back to the 19th century, popularized by Lokmanya Tilak as a tool for promoting Indian nationalism.",
      "significance": "The festival is a significant cultural and religious event for Hindus, symbolizing the triumph of good over evil and the removal of obstacles.  It fosters community bonding and strengthens religious faith.",
      "observance_details": "Traditionally, Ganesha idols are installed in homes and public pandals, where prayers, aartis (devotional songs), and offerings are made.  The festivities involve storytelling, singing, and dancing, culminating in the immersion of the idol in water.",
      "modern_celebration": "Modern celebrations are often elaborate, with large-scale public immersions attracting huge crowds.  Celebrations incorporate elements of contemporary art, music, and technology, while maintaining the core religious practices.",
      "impact_and_legacy": "Ganesh Chaturthi has played a crucial role in shaping Indian social and political landscapes. It promotes cultural unity, environmental awareness (with eco-friendly immersions gaining traction), and continues to be a vibrant expression of faith."
    },
    "alternate_names": [
      "Vinayaka Chaturthi",
      "Ganeshotsav"
    ],
    "category": "Hinduism",
    "created_at": "2025-01-04 12:37:26 UTC",
    "end_date": "02-09-25",
    "last_updated": "2025-01-04 12:39:54 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Wesak",
    "start_date": "05-05-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Wesak, also known as Buddha Purnima, commemorates the birth, enlightenment, and death (parinirvana) of Gautama Buddha.  Its origins trace back to ancient Buddhist traditions in India and are celebrated across various Buddhist traditions worldwide. The exact date varies slightly depending on the lunar calendar.",
      "significance": "Wesak is a highly significant religious holiday for Buddhists globally, symbolizing the culmination of Buddha's life and his teachings. It's a time for reflection, meditation, and reaffirming Buddhist principles of compassion, wisdom, and enlightenment.",
      "observance_details": "Traditional observance includes visiting temples, offering prayers and flowers, participating in chanting ceremonies, and engaging in acts of charity and selfless service. Meditation retreats and study of Buddhist scriptures are also common practices.",
      "modern_celebration": "Modern celebrations involve a range of activities from large-scale public events and festivals to personal meditation and reflection.  Many Buddhists participate in community service projects or engage in mindfulness practices throughout the day.  Online resources and virtual events have expanded accessibility in recent years.",
      "impact_and_legacy": "Wesak fosters a sense of community and spiritual renewal within Buddhist communities. Its emphasis on compassion and ethical conduct continues to inspire acts of kindness and social responsibility worldwide, leaving a lasting impact on promoting peace and understanding."
    },
    "alternate_names": [
      "Vesak",
      "Buddha Day",
      "Buddha Purnima",
      "Buddha Jayanti"
    ],
    "category": "Buddhism",
    "created_at": "2025-01-04 12:37:30 UTC",
    "end_date": "05-05-25",
    "last_updated": "2025-01-04 12:42:22 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Pentecost",
    "start_date": "08-06-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Pentecost commemorates the descent of the Holy Spirit upon the Apostles fifty days after Jesus' resurrection, as described in the Book of Acts.  It marks the birth of the Christian Church and the fulfillment of Old Testament prophecies. This event is considered pivotal in establishing Christianity.",
      "significance": "Pentecost is a significant Christian holiday symbolizing the empowerment of the Church to spread the Gospel. It highlights the gift of the Holy Spirit and the unity of believers across diverse cultures and languages.  The event's significance extends beyond religious circles, influencing art, music, and literature.",
      "observance_details": "Traditionally, Pentecost is observed through church services featuring readings from the Book of Acts, special prayers, and sermons emphasizing the Holy Spirit.  Many denominations also incorporate baptisms or confirmations into their Pentecost celebrations.  Communion is frequently included as part of the service.",
      "modern_celebration": "Modern celebrations often include open-air services, festivals, and special music.  Many churches emphasize the themes of unity and diversity, reflecting the multicultural nature of modern Christianity.  Some churches feature charitable outreach programs tied to the themes of Pentecost.",
      "impact_and_legacy": "Pentecost has profoundly impacted Christian theology and practice, shaping doctrines of the Holy Spirit and the Church's mission.  Its emphasis on spiritual gifts and empowered witness continues to inspire Christian missions and social action globally.  Its legacy continues to be seen in artistic representations of the event and ongoing theological discussion."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-04 12:37:33 UTC",
    "end_date": "08-06-25",
    "last_updated": "2025-01-04 12:37:30 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Theophany",
    "start_date": "06-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Theophany, also known as Epiphany, commemorates the baptism of Jesus Christ by John the Baptist.  Its origins trace back to early Christian traditions celebrating the manifestation of God's glory in Jesus.  The date, January 6th, is tied to both the baptism and the visit of the Magi, historically combining these significant events.",
      "significance": "Theophany signifies the revelation of the Holy Trinity – God the Father, Son, and Holy Spirit –  and the beginning of Jesus' public ministry. It is a major Christian feast highlighting Jesus' divine nature and his mission of salvation. The event holds deep spiritual and theological importance for Christians worldwide.",
      "observance_details": "Traditional observances include special church services with the blessing of water, symbolizing the sanctification of creation.  In some traditions, the blessing of water extends to homes and fields, seeking divine protection for the year.  Processions and the recitation of specific hymns form part of the celebrations.",
      "modern_celebration": "Modern celebrations often involve church services featuring the Great Blessing of Waters, where priests bless water in rivers or other bodies of water, sometimes followed by the ritual of Epiphany swimming.  Many families attend special church services and share festive meals with family and friends.  The festival retains its importance as a time of spiritual reflection and communal celebration.",
      "impact_and_legacy": "Theophany has profoundly impacted Christian art, literature, and theology, inspiring numerous artistic representations and theological interpretations.  Its enduring legacy continues to shape Christian spirituality and liturgical practices. The celebration fosters community bonds and reinforces the central message of faith, hope, and love."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-04 12:37:37 UTC",
    "end_date": "06-01-25",
    "last_updated": "2025-01-04 12:37:33 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "ʻĪd al-'Aḍḥá",
    "start_date": "06-06-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Eid al-Adha commemorates Abraham's willingness to sacrifice his son for God.  It originates from the Islamic scriptures, specifically the Quran's account of this test of faith. The event is a central pillar in Islam, marking the culmination of the Hajj pilgrimage.",
      "significance": "Eid al-Adha is a time of spiritual reflection and reaffirmation of devotion to God. It emphasizes the values of sacrifice, obedience, and compassion.  The festival fosters community bonds and strengthens social ties through shared meals and prayers.",
      "observance_details": "The celebration begins with early morning prayers followed by the ritual sacrifice of an animal, usually a sheep, goat, cow, or camel.  The meat is then divided into three parts: one for the family, one for relatives and friends, and one for the poor and needy.  The Hajj pilgrimage concludes during this festival.",
      "modern_celebration": "Modern celebrations involve large congregational prayers, family gatherings with feasts, and the exchange of gifts. Many families travel to be with loved ones, and festivities often extend for several days.  The emphasis remains on community, sharing, and gratitude.",
      "impact_and_legacy": "Eid al-Adha strengthens social cohesion through communal acts of worship and charity. It promotes compassion and empathy by emphasizing the importance of sharing with those less fortunate. Its enduring legacy is the reinforcement of Islamic values and traditions across generations."
    },
    "alternate_names": [
      "Eid ul-Adha",
      "Eid al-Adha",
      "Bakrid",
      "Greater Eid"
    ],
    "category": "Islam",
    "created_at": "2025-01-04 12:37:41 UTC",
    "end_date": "10-06-25",
    "last_updated": "2025-01-04 12:41:14 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Christmas",
    "start_date": "24-12-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Christmas celebrates the birth of Jesus Christ, a central figure in Christianity.  Its origins blend Christian theology with pre-existing winter solstice festivals.  Early celebrations varied regionally but coalesced over time into a widely observed holiday.",
      "significance": "Christmas holds immense religious significance for billions of Christians worldwide.  It's also a major cultural holiday, fostering feelings of goodwill, family togetherness, and community spirit.  The holiday's emphasis on giving and charity impacts countless lives.",
      "observance_details": "Traditional observances include church attendance, exchanging gifts, sharing special meals with family, and decorating homes with Christmas trees and lights.  Carol singing and nativity scenes also feature prominently.  Many communities hold parades and public celebrations.",
      "modern_celebration": "Modern celebrations incorporate many secular traditions alongside religious ones.  Gift-giving is a major aspect, often involving elaborate shopping and online purchases.  Popular activities include watching Christmas movies, attending festive events, and enjoying special holiday treats.  Travel and family gatherings are central themes.",
      "impact_and_legacy": "Christmas has profoundly shaped Western culture, influencing art, music, literature, and social customs. Its emphasis on compassion and generosity continues to inspire charitable work and community engagement.  The holiday's commercial impact is significant, driving economic activity globally."
    },
    "alternate_names": [
      "Christmas Day",
      "Christmas Eve",
      "Nativity of Jesus",
      "Nativity of the Lord"
    ],
    "category": "Christianity",
    "created_at": "2025-01-04 12:37:45 UTC",
    "end_date": "24-12-24",
    "last_updated": "2025-01-04 12:37:41 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Family Day",
    "start_date": "16-02-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Family Day's origins are diverse, lacking a single, globally recognized founding.  Many countries have adopted variations of family-focused holidays, often rooted in religious or cultural traditions emphasizing family bonds.  Its modern form emerged from a growing recognition of the family unit's importance in society.",
      "significance": "Family Day highlights the crucial role families play in shaping individuals and society. It promotes family values, strengthens relationships, and encourages a sense of belonging and shared identity.  The event underscores the importance of nurturing familial connections for a healthy and thriving community.",
      "observance_details": "Traditional observances vary widely depending on cultural context.  Common practices include family gatherings, meals, and shared activities.  Some cultures may incorporate religious ceremonies or rituals emphasizing family unity and well-being.",
      "modern_celebration": "Modern celebrations are often informal, focusing on spending quality time together.  Activities range from simple home-based gatherings to outings, picnics, and travel.  The emphasis is consistently on creating positive memories and strengthening familial ties.",
      "impact_and_legacy": "Family Day's impact lies in its consistent reinforcement of family values.  It fosters a sense of community and belonging, particularly important in increasingly individualistic societies.  Its legacy is the continued promotion of strong family units and their essential contribution to societal well-being."
    },
    "alternate_names": [
      "Ontario Family Day",
      "Provincial Family Day"
    ],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:37:48 UTC",
    "end_date": "16-02-25",
    "last_updated": "2025-01-04 12:41:22 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Sri Krishna Jayanti",
    "start_date": "07-09-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Sri Krishna Janmashtami commemorates the birth of Lord Krishna, a major deity in Hinduism.  The exact date is debated, but it's celebrated on the Ashtami (eighth day) of Krishna Paksha in the month of Bhadrapada according to the Hindu lunisolar calendar.  Legends surrounding Krishna's birth and early life are central to the festival's narrative.",
      "significance": "The festival is deeply significant for Hindus, representing the triumph of good over evil, divine love, and the celebration of Krishna's playful yet profound nature.  It marks the victory of dharma (righteousness) over adharma (unrighteousness).  The occasion strengthens family bonds and reinforces devotion to Krishna.",
      "observance_details": "Traditional observances include fasting, prayers, and devotional songs (bhajans and kirtans).  Many participate in all-night vigils (jagrans), narrating stories from Krishna's life.  Temples host special pujas (rituals) and decorate intricately.",
      "modern_celebration": "Modern celebrations often include elaborate decorations, theatrical enactments of Krishna's life (ras lila), and community gatherings.  Fasting is still prevalent, but celebrations often include festive meals and sweets (like peda and makhan).  The festival is widely celebrated with enthusiasm across many regions.",
      "impact_and_legacy": "Sri Krishna Janmashtami strengthens religious faith and fosters a sense of community amongst Hindus globally.  The festival's enduring popularity ensures the continuation of Krishna's legend and its moral teachings across generations. It promotes the values of devotion, compassion, and righteousness."
    },
    "alternate_names": [
      "Janmashtami",
      "Krishna Janmashtami",
      "Gokulashtami"
    ],
    "category": "Hinduism",
    "created_at": "2025-01-04 12:37:52 UTC",
    "end_date": "07-09-25",
    "last_updated": "2025-01-04 12:42:07 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Advent",
    "start_date": "01-12-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Advent, meaning 'arrival' in Latin, originated in the 4th century as a period of spiritual preparation for the celebration of Christmas.  Initially observed with varying lengths and practices across different regions, it eventually standardized into a four-week period leading up to Christmas.",
      "significance": "Advent holds deep religious significance for Christians, marking a time of reflection, repentance, and anticipation of Christ's birth.  Culturally, it's associated with themes of hope, peace, joy, and love, influencing traditions and celebrations globally.",
      "observance_details": "Traditionally, Advent involved fasting, prayer, and increased church attendance.  Special liturgical services and readings were held, focusing on prophecies and themes of the Messiah's coming.  The lighting of candles on an Advent wreath, representing hope, peace, joy, and love, became a common practice.",
      "modern_celebration": "Modern celebrations incorporate many traditional elements, including Advent wreaths, calendars, and special church services.  Families often gather for special meals, and gift-giving (though less emphasized than during Christmas) may occur.  The emphasis remains on spiritual preparation for Christmas.",
      "impact_and_legacy": "Advent has significantly impacted the Christian calendar and liturgical year, shaping spiritual practices and devotional traditions. Its focus on reflection and anticipation has permeated Christian culture globally, inspiring art, music, and literature connected to the Christmas season."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-04 12:37:56 UTC",
    "end_date": "24-12-24",
    "last_updated": "2025-01-04 12:37:52 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Lucia",
    "start_date": "13-12-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Lucia, celebrated on December 13th, originates from the Roman festival of Saturnalia and the veneration of Saint Lucy, a 4th-century Sicilian martyr known for her piety and charitable acts.  Her feast day became intertwined with pre-Christian winter solstice celebrations.",
      "significance": "Lucia is a significant cultural and religious event in Scandinavia and some parts of Europe.  It represents the return of light after the winter solstice and celebrates the virtues of light, purity, and charity associated with Saint Lucy. It's a time for family and community gatherings.",
      "observance_details": "Traditionally, Lucia is celebrated with a young woman chosen to dress as Saint Lucy, wearing a white robe and a crown of candles.  She serves saffron buns and coffee to family members, symbolizing the bringing of light and warmth to the home.  Special songs and processions are also common.",
      "modern_celebration": "Modern celebrations maintain many traditions, including the Lucia procession featuring girls and women in white robes and candle crowns.  Schools and community groups often organize Lucia events, with performances of traditional songs and sharing of treats. The focus remains on community spirit and the light of hope during the dark winter months.",
      "impact_and_legacy": "Lucia's legacy continues as a strong symbol of Scandinavian heritage and cultural identity, maintaining its religious and secular significance.  It promotes community engagement and fosters a sense of shared tradition, offering a comforting and joyous celebration during the winter season. The event's emphasis on light and hope resonates across various cultural contexts."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:38:00 UTC",
    "end_date": "13-12-24",
    "last_updated": "2025-01-04 12:37:56 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Raksha Bandhan",
    "start_date": "03-08-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Raksha Bandhan's origins are debated, with some tracing it to ancient Hindu scriptures depicting a bond between brothers and sisters.  Other theories link it to historical alliances and protection treaties between kingdoms.  The festival's current form evolved over centuries, incorporating various regional traditions.",
      "significance": "The festival celebrates the sacred relationship between brothers and sisters, symbolizing love, protection, and duty. It emphasizes the importance of familial bonds and the reciprocal responsibility siblings have towards each other. Raksha Bandhan reinforces societal values of care and commitment within families.",
      "observance_details": "Traditionally, sisters tie a rakhi, a sacred thread, around their brothers' wrists, praying for their well-being.  Brothers, in return, promise to protect their sisters and offer gifts.  Prayers and rituals often accompany the ceremony, varying regionally.",
      "modern_celebration": "Modern celebrations often involve exchanging gifts, festive meals, and family gatherings.  The festival is widely observed across India and among Indian diaspora communities globally, adapting to contemporary lifestyles while maintaining its core values.  Social media plays a significant role in connecting siblings.",
      "impact_and_legacy": "Raksha Bandhan reinforces the importance of sibling relationships and familial bonds within Indian society.  The festival's enduring legacy lies in its ability to transcend geographical boundaries and generational gaps, promoting values of love, protection, and mutual respect. It serves as a powerful symbol of unity and family cohesion."
    },
    "alternate_names": [],
    "category": "Hinduism",
    "created_at": "2025-01-04 12:38:04 UTC",
    "end_date": "03-08-25",
    "last_updated": "2025-01-04 12:38:00 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Ramadan",
    "start_date": "01-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Ramadan commemorates the first revelation of the Quran to the Prophet Muhammad during the month of Ramadan, according to Islamic belief.  It's a pivotal event in the Islamic calendar, marking a period of spiritual reflection and renewal. The month's timing varies each year based on the lunar calendar.",
      "significance": "Ramadan holds immense religious significance for Muslims worldwide, representing a time for spiritual growth through fasting, prayer, and charity. It fosters a strong sense of community and shared faith, reinforcing bonds between Muslims globally. The month is considered sacred and a time for introspection and drawing closer to God.",
      "observance_details": "Traditional observance includes fasting from dawn till dusk, abstaining from food, drink, and other physical needs.  Increased prayer, recitation of the Quran, and acts of charity (Zakat) are central to the practice.  Families gather for evening meals (Iftar) to break the fast, strengthening social bonds.",
      "modern_celebration": "Modern celebrations maintain the core religious practices but often incorporate community events such as Iftar gatherings, mosque attendance for Taraweeh prayers, and charitable initiatives.  Many Muslims also use technology to connect with family and friends across geographical distances during Ramadan.  Special television programs and online resources often cater to the month's spiritual themes.",
      "impact_and_legacy": "Ramadan's impact extends beyond the religious sphere; it promotes empathy, compassion, and a focus on social justice. The emphasis on charity and self-reflection leaves a lasting impact on individual spiritual growth and fosters stronger community ties within Muslim societies. Its legacy is seen in the ongoing charitable work and acts of kindness throughout the year."
    },
    "alternate_names": [
      "Ramazan",
      "Ramzan",
      "Month of Fasting"
    ],
    "category": "Islam",
    "created_at": "2025-01-04 12:38:08 UTC",
    "end_date": "30-03-25",
    "last_updated": "2025-01-04 12:40:42 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Laylat al Baraat",
    "start_date": "21-04-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Laylat al-Baraat, or the Night of Forgiveness, is believed to have originated in Islamic tradition, with its roots possibly linked to earlier pre-Islamic Arabian beliefs.  Its significance is derived from various interpretations of prophetic traditions (Hadith), though its exact historical origins remain debated amongst Islamic scholars.",
      "significance": "Culturally, it's a night of intense spiritual reflection and seeking forgiveness. Socially, it fosters communal prayer and charity, reinforcing the Islamic emphasis on repentance and divine mercy.  It is considered a night of immense spiritual opportunity.",
      "observance_details": "Traditional observance includes spending the night in prayer, reciting the Quran, seeking forgiveness (Istighfar), performing acts of charity (Sadaqah), and engaging in introspection.  Many Muslims stay awake throughout the night, engaging in devotional practices.",
      "modern_celebration": "Modern celebrations involve congregational prayers in mosques, special sermons focusing on repentance and forgiveness, and increased charitable giving.  Families often gather for prayers and supplications, emphasizing the night's spiritual significance.",
      "impact_and_legacy": "Laylat al-Baraat has a lasting impact by reinforcing the Islamic values of repentance, forgiveness, and charity.  Its emphasis on self-reflection and spiritual renewal strengthens the community's bond with its faith, impacting individual morality and social cohesion.  It is a significant event in promoting spiritual growth amongst Muslims."
    },
    "alternate_names": [],
    "category": "Islam",
    "created_at": "2025-01-04 12:38:11 UTC",
    "end_date": "21-04-25",
    "last_updated": "2025-01-04 12:38:08 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Islamic New Year",
    "start_date": "19-07-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "The Islamic New Year, Muharram, marks the beginning of the Islamic lunar calendar.  It commemorates the migration (Hijra) of the Prophet Muhammad from Mecca to Medina in 622 CE, a pivotal event in Islamic history. This migration established the first Muslim community and marked the start of the Islamic era.",
      "significance": "Muharram holds significant religious importance as the first month of the Islamic calendar.  It's a time for reflection, repentance, and renewed commitment to Islamic principles.  Many Muslims engage in increased prayer, fasting, and charitable acts.",
      "observance_details": "Traditionally, Muharram is observed with increased prayer and devotion.  Fasting on the tenth day of Muharram, Ashura, is a common practice.  Many Muslims also engage in acts of charity and community service.",
      "modern_celebration": "Modern celebrations vary across different Muslim communities.  Some may attend special prayers at mosques, while others may gather with family and friends for meals and celebrations.  Educational programs about the Hijra's significance are also common.",
      "impact_and_legacy": "The Islamic New Year reinforces the core values of Islam, promoting unity, spirituality, and social responsibility. Its enduring legacy lies in its continuous reminder of the pivotal moment in Islamic history and its annual renewal of faith for millions worldwide."
    },
    "alternate_names": [
      "Hijri New Year",
      "Arabic New Year",
      "Muharram"
    ],
    "category": "Islam",
    "created_at": "2025-01-04 12:38:15 UTC",
    "end_date": "19-07-25",
    "last_updated": "2025-01-04 12:41:47 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Hanuman Jayanti",
    "start_date": "21-04-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Hanuman Jayanti commemorates the birth of Lord Hanuman, a prominent figure in the Hindu epic Ramayana.  The exact date is debated, but it's widely celebrated on the full moon day (Purnima) of the Hindu month Chaitra (March-April).  The festival's origins are deeply rooted in ancient Hindu traditions and the devotional worship of Hanuman.",
      "significance": "Hanuman is revered for his strength, devotion, and wisdom.  The festival celebrates these qualities and promotes values like courage, perseverance, and unwavering faith. Hanuman Jayanti reinforces the importance of dharma (righteousness) in Hindu culture.",
      "observance_details": "Traditional observances include fasting, reciting Hanuman Chalisa (a devotional hymn), visiting Hanuman temples, and offering prayers and flowers.  Many devotees perform special pujas (rituals) and engage in acts of selfless service.  Lighting diyas (oil lamps) is also a common practice.",
      "modern_celebration": "Modern celebrations involve grand processions, community gatherings, and religious discourses.  Large-scale pujas and bhajans (devotional songs) are common, often with mass participation.  Many organize charitable activities and community service projects in keeping with Hanuman's spirit of selfless service.",
      "impact_and_legacy": "Hanuman Jayanti fosters community bonding and strengthens religious faith.  The festival's emphasis on virtue and devotion continues to inspire individuals to strive for righteousness and selflessness.  It sustains a strong cultural identity and transmits the values enshrined in the Ramayana to future generations."
    },
    "alternate_names": [],
    "category": "Hinduism",
    "created_at": "2025-01-04 12:38:19 UTC",
    "end_date": "21-04-25",
    "last_updated": "2025-01-04 12:38:15 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Christmas",
    "start_date": "25-12-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Christmas celebrates the birth of Jesus Christ, a central figure in Christianity.  Its origins blend religious traditions with pagan winter solstice festivals, evolving over centuries into the globally recognized holiday it is today.  Early celebrations varied widely across different Christian communities before becoming standardized.",
      "significance": "Christmas holds immense religious significance for billions of Christians worldwide, symbolizing hope, peace, and the divine incarnation.  Culturally, it's a time for family gatherings, gift-giving, and widespread displays of goodwill, fostering a sense of community and shared celebration.",
      "observance_details": "Traditional observances include attending church services, sharing festive meals with family, exchanging gifts, decorating Christmas trees, and singing carols.  Many cultures incorporate unique customs, reflecting diverse traditions and beliefs.  The nativity scene, representing Jesus' birth, is a common visual element.",
      "modern_celebration": "Modern celebrations are diverse, incorporating secular aspects alongside religious traditions. Gift-giving, decorating homes and public spaces, and enjoying festive food and entertainment are widely practiced.  Commercialization is prevalent, contributing significantly to the economic impact of the holiday.",
      "impact_and_legacy": "Christmas has profoundly impacted global culture, shaping social customs and traditions for centuries. Its emphasis on charity and goodwill inspires acts of kindness and generosity. The holiday's widespread celebration continues to foster cross-cultural understanding and connection."
    },
    "alternate_names": [
      "Christmas Day",
      "Christmas Eve",
      "Nativity of Jesus",
      "Nativity of the Lord"
    ],
    "category": "Christianity",
    "created_at": "2025-01-04 12:38:23 UTC",
    "end_date": "25-12-24",
    "last_updated": "2025-01-04 12:42:22 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Asalha Puja",
    "start_date": "26-07-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Asalha Puja commemorates the Buddha's first sermon in Deer Park, Sarnath, India, after his enlightenment.  This sermon, known as the Dhammacakkappavattana Sutta, set in motion the wheel of Dhamma (Buddhist teachings). The event is believed to have occurred on the full moon day of Asalha (July/August).",
      "significance": "Asalha Puja is one of the most important Buddhist holidays, marking the beginning of the Buddha's teachings and the spread of Buddhism. It signifies the propagation of the Buddha's message of enlightenment and the path to liberation from suffering, deeply impacting Buddhist life and culture.",
      "observance_details": "Traditional observance involves attending special sermons and meditation sessions at temples.  Monks often chant Buddhist scriptures, and lay Buddhists participate in acts of merit, such as making offerings and giving alms.  Many spend the day in reflection and contemplation.",
      "modern_celebration": "Modern celebrations include large gatherings at temples with chanting, sermons, and meditation.  Many Buddhists light candles, offer flowers, and participate in processions.  The event is also a time for community bonding and sharing Buddhist principles with others.",
      "impact_and_legacy": "Asalha Puja has significantly impacted Buddhist societies globally, fostering spiritual growth and community engagement.  Its enduring legacy lies in the continued propagation of the Buddha's teachings and their relevance to achieving peace and understanding in the world.  The event strengthens Buddhist identity and faith."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-04 12:38:26 UTC",
    "end_date": "26-07-25",
    "last_updated": "2025-01-04 12:38:23 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Saka New Year",
    "start_date": "22-04-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Saka New Year, also known as the Saka Era, is a lunisolar calendar used in many parts of South and Southeast Asia.  Its origins trace back to the Kushan Empire around the 1st century CE, marking the beginning of their era. The calendar's adoption spread through trade and influence across various regions.",
      "significance": "Saka New Year holds immense cultural and religious significance for many communities, marking a new beginning, a time for renewal, and reflection. It's often associated with auspicious beginnings and positive energy, influencing daily life and societal activities.",
      "observance_details": "Traditional observances often include prayers, rituals, and feasts. Families gather, clean their homes, and prepare special dishes.  Specific customs vary regionally, incorporating local traditions and beliefs.",
      "modern_celebration": "Modern celebrations often blend traditional practices with contemporary elements.  Many participate in community events, religious ceremonies, and festive gatherings. The holiday is increasingly marked by public celebrations and social media engagement.",
      "impact_and_legacy": "The Saka calendar has had a lasting impact on the cultural landscape of many Asian countries, shaping their historical records, agricultural practices, and social norms. Its continued use reflects its deep integration into the fabric of their societies and traditions."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-04 12:38:30 UTC",
    "end_date": "22-04-25",
    "last_updated": "2025-01-04 12:38:26 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Victoria Day",
    "start_date": "19-05-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Victoria Day is a Canadian federal holiday observed annually on the Monday before May 25th, celebrating the birthday of Queen Victoria.  The holiday's origins trace back to the late 19th century, solidifying as a national celebration in the early 20th century.",
      "significance": "It signifies a period of significant growth and prosperity under Queen Victoria's reign in Canada.  The holiday reflects a continued sense of national identity and historical connection to the British monarchy, albeit with evolving perspectives.",
      "observance_details": "Traditionally, Victoria Day involves community events, parades, and family gatherings.  Many participate in outdoor activities, enjoying the arrival of warmer weather, often involving picnics and barbecues.",
      "modern_celebration": "Modern celebrations are similar, incorporating family time and community celebrations.  Many enjoy long weekends, traveling and engaging in leisure activities; fireworks displays are also common in various communities.",
      "impact_and_legacy": "Victoria Day fosters a sense of collective national identity and shared experience.  The holiday's enduring legacy is its ability to unite Canadians across diverse backgrounds in commemoration and festive celebrations."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:38:33 UTC",
    "end_date": "19-05-25",
    "last_updated": "2025-01-04 12:38:30 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Epiphany",
    "start_date": "06-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Epiphany, also known as Three Kings' Day, celebrates the manifestation of God incarnate as Jesus Christ to the Gentiles.  Its origins lie in the early Christian church, commemorating the visit of the Magi to the infant Jesus, as described in the Gospel of Matthew. The date, January 6th, was chosen to mark the end of the Christmas season.",
      "significance": "Epiphany holds great religious significance for Christians, representing the revelation of Jesus as the Messiah to the world.  It symbolizes the universality of God's love, extending beyond the Jewish people to all nations.  The feast also emphasizes the importance of faith, wisdom, and the pursuit of spiritual truth.",
      "observance_details": "Traditionally, Epiphany is observed with church services featuring special readings and hymns.  Many cultures incorporate processions or plays depicting the journey of the Magi.  The blessing of water is also common, symbolizing purification and renewal.",
      "modern_celebration": "Modern celebrations often include family gatherings, gift-giving, especially to children, often mimicking the gifts of the Magi.  Many communities continue the tradition of Epiphany processions and church services.  The holiday is sometimes associated with the end of the Christmas season and the beginning of a new year.",
      "impact_and_legacy": "Epiphany's impact includes the perpetuation of the Christmas narrative and the ongoing celebration of the universality of Christianity.  Its legacy is reflected in various cultural traditions and customs around the world, shaping artistic expressions and community celebrations for centuries. The emphasis on gifts also continues to influence secular traditions."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-04 12:38:37 UTC",
    "end_date": "06-01-25",
    "last_updated": "2025-01-04 12:38:33 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Bodhi Day",
    "start_date": "08-12-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Bodhi Day commemorates the day Siddhartha Gautama, the historical Buddha, attained enlightenment under the Bodhi tree in Bodh Gaya, India.  This event, believed to have occurred around the 6th century BCE, marks a pivotal moment in Buddhist history and the beginning of his teachings. The exact date is debated but is typically celebrated on December 8th in many Buddhist traditions.",
      "significance": "Bodhi Day is a highly significant holiday in Buddhism, symbolizing spiritual awakening and the path to liberation from suffering. It represents the culmination of the Buddha's intense meditation and the achievement of Nirvana, inspiring Buddhists worldwide to pursue their own spiritual growth. The day encourages reflection on the Buddha's teachings and their application in daily life.",
      "observance_details": "Traditional observance often involves visiting temples, chanting sutras, and meditating under a Bodhi tree (if available).  Monks and lay practitioners alike engage in special prayers and ceremonies, focusing on the principles of the Buddha's enlightenment.  Many may also undertake personal retreats or periods of heightened spiritual practice.",
      "modern_celebration": "Modern celebrations incorporate a variety of practices, including attending special Bodhi Day services at temples and monasteries.  Many Buddhists engage in mindfulness meditation, read Buddhist scriptures, or participate in dharma talks focusing on the path to enlightenment.  Online communities and social media platforms also offer opportunities for global participation and reflection.",
      "impact_and_legacy": "Bodhi Day continues to inspire millions of Buddhists worldwide to strive for enlightenment and compassion.  The day's emphasis on self-reflection and spiritual practice promotes peace and mindfulness, impacting individuals and communities.  Its enduring legacy lies in its continued reinforcement of core Buddhist values and its ongoing inspiration for personal and societal transformation."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-04 12:38:50 UTC",
    "end_date": "08-12-24",
    "last_updated": "2025-01-04 12:38:37 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "National Day for Truth and Reconciliation",
    "start_date": "30-09-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "The National Day for Truth and Reconciliation in Canada is observed annually on September 30th.  It stems from the Truth and Reconciliation Commission's (TRC) 2015 Calls to Action, specifically Call to Action #80, which recommended a statutory holiday to honour the survivors of residential schools and commemorate the children who died while attending them.",
      "significance": "This day holds profound cultural and social significance for Indigenous peoples in Canada, marking a time for remembrance and reflection on the devastating legacy of residential schools. It is a day for Canadians to learn about the history and ongoing impacts of colonization and to commit to reconciliation.",
      "observance_details": "Traditionally, Indigenous communities hold ceremonies and events to honour survivors, remember lost children, and share their stories.  Many participate in commemorative walks and moments of silence.  Educational initiatives focus on raising awareness about the history of residential schools.",
      "modern_celebration": "Modern celebrations involve educational initiatives in schools and workplaces, public ceremonies and events, and the wearing of orange shirts to symbolize the suffering of residential school children.  Many Canadians participate in reflection and learning about Indigenous history and culture.",
      "impact_and_legacy": "The day's impact lies in fostering dialogue and understanding about the harms of colonization.  Its lasting legacy will depend on continued commitment to education, truth-telling, and the implementation of the TRC's Calls to Action to achieve reconciliation between Indigenous and non-Indigenous peoples in Canada."
    },
    "alternate_names": [
      "Orange Shirt Day"
    ],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:38:53 UTC",
    "end_date": "30-09-24",
    "last_updated": "2025-01-04 12:41:51 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Martyrdom of Guru Arjan Dev Ji",
    "start_date": "26-05-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Guru Arjan Dev Ji, the fifth Sikh Guru, compiled the Adi Granth, the Sikh scriptures.  His emphasis on the equality of all humans and his defiance of Mughal Emperor Jahangir's policies led to conflict.",
      "significance": "The martyrdom is a pivotal event in Sikh history, symbolizing unwavering faith and sacrifice for religious freedom. It solidified the Guru's position as a powerful spiritual leader and cemented the Adi Granth's sacred status.",
      "observance_details": "The martyrdom is observed annually with Akhand Paths (continuous recitation of the Guru Granth Sahib), Kirtan (devotional singing), and Katha (religious discourses).  Special prayers and commemorative services are held in Gurdwaras (Sikh temples).",
      "modern_celebration": "Modern celebrations include large gatherings at Harmandir Sahib (Golden Temple) and other Gurdwaras.  Langar (community kitchen) serves food to all, irrespective of caste or creed.  The day is marked with deep reflection and remembrance.",
      "impact_and_legacy": "Guru Arjan Dev Ji's martyrdom strengthened the Sikh community's resolve and inspired generations.  His sacrifice became a cornerstone of Sikh identity, fostering resilience and commitment to their faith's principles."
    },
    "alternate_names": [],
    "category": "Sikhism",
    "created_at": "2025-01-04 12:38:57 UTC",
    "end_date": "26-05-25",
    "last_updated": "2025-01-04 12:38:53 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Le Réveillon de Noël",
    "start_date": "24-12-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Le Réveillon de Noël, or Christmas Eve supper, originates from the medieval tradition of breaking the Christmas fast after attending midnight mass.  It evolved into a significant family meal, reflecting the importance of sharing and community during the holiday season. Its roots lie in both religious and social customs.",
      "significance": "The Réveillon holds deep cultural significance in French-speaking regions, symbolizing family unity, shared traditions, and the start of the Christmas festivities.  It represents a time of feasting and reflection, bridging the gap between religious observance and secular celebration. The abundance of food reflects prosperity and hope for the coming year.",
      "observance_details": "Traditionally, the Réveillon is a lavish meal enjoyed late on Christmas Eve after attending midnight mass.  It features a rich array of dishes, often including oysters, lobster, foie gras, and other delicacies, varying regionally.  The meal is a prolonged affair, focusing on togetherness and conversation.",
      "modern_celebration": "While still centered around a festive meal, modern Réveillons might incorporate more diverse culinary choices and relaxed timings. Families still gather, often with extended family and friends, to share food, stories, and gifts. The emphasis remains on communal celebration.",
      "impact_and_legacy": "The Réveillon continues to be a cornerstone of French Christmas traditions, strengthening family bonds and cultural identity. Its focus on shared food and conviviality has influenced holiday celebrations in other cultures.  It's a powerful symbol of community and the importance of cherished customs."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:39:05 UTC",
    "end_date": "24-12-24",
    "last_updated": "2025-01-04 12:39:01 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Thanksgiving",
    "start_date": "10-10-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Thanksgiving's origins trace back to 1621, a harvest feast shared by the Pilgrims and the Wampanoag Native Americans after their first harvest in Plymouth.  While not exactly like modern Thanksgiving, it represents an early example of intercultural cooperation and celebration.",
      "significance": "Thanksgiving is a significant secular holiday in the United States and Canada, emphasizing gratitude, family, and the bounty of the harvest.  It serves as a time for reflection and appreciation for blessings, both large and small.",
      "observance_details": "Traditionally, Thanksgiving involves a large feast with family and friends, featuring a roasted turkey as the centerpiece.  Other common dishes include stuffing, mashed potatoes, gravy, cranberry sauce, and pumpkin pie.  The day often includes watching parades and football games.",
      "modern_celebration": "Modern celebrations often include a blend of traditional elements and personal variations.  Families may travel long distances to gather, participate in volunteer activities, or engage in various autumnal activities.  The emphasis remains on togetherness and gratitude.",
      "impact_and_legacy": "Thanksgiving has evolved into a powerful symbol of national unity and shared heritage in the United States and Canada.  Its emphasis on gratitude and togetherness continues to resonate deeply, even amidst growing awareness of its complex historical context."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:39:08 UTC",
    "end_date": "10-10-24",
    "last_updated": "2025-01-04 12:39:05 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Lunar New Year",
    "start_date": "29-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Lunar New Year, also known as the Spring Festival, originated in ancient China thousands of years ago as a celebration of the harvest and the start of a new agricultural year.  It's rooted in agricultural cycles and ancient beliefs regarding the balance of nature and the spirits.  Over time, it evolved incorporating elements of mythology and religious practices.",
      "significance": "The festival holds immense cultural and social significance as a time for family reunions, reflecting the importance of kinship and ancestral reverence in many East and Southeast Asian cultures. It's a period of renewal, hope, and looking forward to a prosperous year ahead, symbolized by lucky colors and auspicious symbols.",
      "observance_details": "Traditional observances include elaborate family feasts, the giving of red envelopes containing money (hongbao), lion and dragon dances performed to ward off evil spirits, and the setting off of fireworks.  Cleaning homes before the new year symbolizes removing bad luck, and specific foods are eaten for good fortune.",
      "modern_celebration": "Modern celebrations retain many traditional elements but have also adapted to contemporary lifestyles.  While family gatherings remain central, celebrations often incorporate new technologies for virtual reunions and social media sharing. Public events like parades and cultural performances have also grown in popularity.",
      "impact_and_legacy": "Lunar New Year's impact extends to its widespread global celebration, fostering cultural exchange and understanding between diverse communities.  Its rich traditions and symbolism continue to shape cultural identities and practices, demonstrating resilience across generations and geographies."
    },
    "alternate_names": [
      "Chinese New Year",
      "Spring Festival",
      "Tết"
    ],
    "category": "Buddhism",
    "created_at": "2025-01-04 12:39:12 UTC",
    "end_date": "29-01-25",
    "last_updated": "2025-01-04 12:42:25 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Vaisakhi",
    "start_date": "14-04-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Vaisakhi, also known as Baisakhi, marks the beginning of the solar new year for many Sikhs and Hindus.  It commemorates the formation of the Khalsa Panth by Guru Gobind Singh in 1699 and also celebrates the harvest festival.  Historically, it has been a significant agricultural event in the Punjab region.",
      "significance": "Vaisakhi holds immense cultural and religious significance for Sikhs, symbolizing the establishment of their community's identity and principles. For Hindus, it marks the beginning of a new cycle and is associated with a bountiful harvest.  The festival fosters a sense of community and renewal.",
      "observance_details": "Traditionally, Vaisakhi is observed with prayers, hymns, and visits to Gurdwaras (Sikh temples) for Sikhs.  Hindus participate in processions, fairs, and ceremonies.  Celebrations often include traditional music, dance, and feasts.",
      "modern_celebration": "Modern celebrations often include vibrant parades, community gatherings, and religious services.  People wear new clothes, share meals, and engage in cultural performances.  The festival has become a global event, celebrated by Sikh and Hindu communities worldwide.",
      "impact_and_legacy": "Vaisakhi's legacy lies in its enduring contribution to the collective identity of Sikhs and its promotion of unity.  It continues to be a powerful symbol of faith, resilience, and cultural heritage. The harvest aspect has maintained its economic and social significance across generations."
    },
    "alternate_names": [
      "Baisakhi",
      "Vaisakhdi",
      "Khalsa Day"
    ],
    "category": "Sikhism",
    "created_at": "2025-01-04 12:39:16 UTC",
    "end_date": "14-04-25",
    "last_updated": "2025-01-04 12:41:14 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Mid-Autumn Festival",
    "start_date": "29-09-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "The Mid-Autumn Festival, also known as the Moon Festival, originated in China during the Harvest Moon, possibly dating back to the Shang Dynasty.  It evolved from ancient harvest celebrations and moon-worshipping rituals, intertwining with folklore and mythology.",
      "significance": "The festival is a significant harvest celebration symbolizing family reunion and togetherness.  It's a time for appreciating the autumn harvest and the beauty of the full moon, carrying strong cultural and emotional weight.",
      "observance_details": "Traditionally, families gather to admire the full moon, share mooncakes (baked pastries), and light lanterns.  Stories of Chang'e, the moon goddess, are told, and offerings are made to the moon.",
      "modern_celebration": "Modern celebrations involve similar traditions with the addition of outdoor family gatherings, lantern displays, and mooncake variations.  Many communities organize events and festivals, combining traditional customs with contemporary elements.",
      "impact_and_legacy": "The Mid-Autumn Festival has profoundly impacted East and Southeast Asian cultures, strengthening family bonds and maintaining cultural identity across generations.  Its enduring symbolism fosters community and preserves rich traditions."
    },
    "alternate_names": [
      "Moon Festival",
      "Mooncake Festival"
    ],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:39:20 UTC",
    "end_date": "29-09-24",
    "last_updated": "2025-01-04 12:39:50 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Laylat al-Qadr",
    "start_date": "07-04-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Laylat al-Qadr, or the Night of Power, is mentioned in the Quran as the night when the first verses of the Quran were revealed to Prophet Muhammad.  Its exact date within Ramadan is unknown, though it is believed to fall within the last ten days of the month.  The night holds immense spiritual significance for Muslims worldwide.",
      "significance": "It is considered the holiest night of the year for Muslims.  This night represents divine mercy, forgiveness, and spiritual blessings. The night is believed to be more virtuous than a thousand months.",
      "observance_details": "Traditionally, Muslims spend Laylat al-Qadr in prayer, reciting the Quran, seeking forgiveness (Istighfar), and engaging in acts of worship.  Many stay awake throughout the night in intense devotion.  They also give increased charity and perform good deeds.",
      "modern_celebration": "Modern celebrations often involve congregational prayers at mosques, special Quranic recitations, and increased religious gatherings.  Families often spend the night in prayer together at home.  Many use the night for self-reflection and spiritual renewal.",
      "impact_and_legacy": "Laylat al-Qadr has had a profound impact on Islamic spirituality, shaping devotion and practice throughout history. It strengthens the bonds of community and encourages introspection. The night's focus on spiritual renewal has continued to inspire Muslims to seek closeness to God."
    },
    "alternate_names": [],
    "category": "Islam",
    "created_at": "2025-01-04 12:39:23 UTC",
    "end_date": "07-04-25",
    "last_updated": "2025-01-04 12:39:20 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Nowruz",
    "start_date": "21-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Nowruz, meaning \"new day\", is an ancient Persian festival celebrating the beginning of spring and the new year. Its origins trace back over 3000 years to the Zoroastrian religion and the arrival of spring in the northern hemisphere.  The festival has been celebrated continuously across diverse cultures and regions, adapting and evolving over millennia.",
      "significance": "Nowruz is a significant cultural and social event symbolizing rebirth, renewal, and the victory of good over evil.  It's a time for family gatherings, reconciliation, and the celebration of new beginnings, fostering community bonds and cultural identity. The festival carries powerful symbolic meanings around nature's cycle and the promise of a prosperous year.",
      "observance_details": "Traditional Nowruz celebrations involve a thorough house cleaning (khaneh tekouni), preparing special foods like haft-seen (seven symbolic items starting with 'S' in Persian), visiting family and friends, and exchanging gifts.  The Haft-seen table is central to the celebration, embodying hopes for a bountiful year.  Many partake in outdoor activities and enjoy festive performances.",
      "modern_celebration": "In modern times, Nowruz is celebrated globally by diverse communities, blending traditional practices with contemporary elements.  Celebrations often include large public gatherings, cultural performances, and family feasts. Social media plays a significant role in connecting people across geographical boundaries.",
      "impact_and_legacy": "Nowruz has had a lasting impact on societies across continents, demonstrating the resilience of cultural traditions across time and borders.  It serves as a bridge connecting past generations with future ones while promoting tolerance and intercultural dialogue.  UNESCO's recognition of Nowruz as an Intangible Cultural Heritage highlights its global significance."
    },
    "alternate_names": [
      "Norooz",
      "Persian New Year",
      "Iranian New Year"
    ],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:39:28 UTC",
    "end_date": "21-03-25",
    "last_updated": "2025-01-04 12:41:10 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "4shanbe Souri",
    "start_date": "19-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Chaharshanbe Suri, or Wednesday Night, is a centuries-old Iranian tradition, its origins possibly linked to ancient Zoroastrian fire festivals.  It's a celebration marking the end of winter and the arrival of spring, representing the triumph of light over darkness and renewal.",
      "significance": "The event holds deep cultural and social significance for Iranians, symbolizing purification and cleansing before the new year (Nowruz). It's a time for community bonding, expressing hopes for a prosperous future, and playfully celebrating the transition of seasons.",
      "observance_details": "Traditionally, people jump over bonfires, symbolizing the purging of the past year's misfortunes. They also make noise with firecrackers and drums, and participate in various rituals associated with cleansing and purification.  The burning of symbolic items is another key part.",
      "modern_celebration": "Modern celebrations retain many traditional aspects, incorporating bonfires and noise-making.  However, due to safety concerns and environmental impacts, some communities emphasize more community-centered events and symbolic representations of the bonfire tradition. Increased use of fireworks adds a different dynamic.",
      "impact_and_legacy": "Chaharshanbe Suri's impact is visible in the continued strong community bonds it fosters, the festive atmosphere it creates, and its role in preserving Iranian cultural heritage.  Its enduring popularity reflects its relevance across generations and underscores its significance in Iranian identity."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:39:31 UTC",
    "end_date": "19-03-25",
    "last_updated": "2025-01-04 12:39:28 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Birth Date of Guru Gobind Singh Ji",
    "start_date": "21-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Guru Gobind Singh Ji, the tenth and final Sikh Guru, was born on December 22, 1666, in Patna, Bihar, India.  His birth was prophesied and considered auspicious, marking a pivotal moment in Sikh history. He was born to Guru Tegh Bahadur and Mata Gujri.",
      "significance": "The birth of Guru Gobind Singh Ji is celebrated as a momentous occasion for Sikhs worldwide.  It marks the birth of the Guru who established the Khalsa, the warrior community of Sikhs, and formalized the Five Ks. His teachings shaped Sikh identity and philosophy.",
      "observance_details": "Traditionally, the day is observed with prayers, kirtan (devotional singing), and akhand path (continuous recitation of the Guru Granth Sahib).  Families gather for langar (community kitchen) and share meals, emphasizing community and sharing.",
      "modern_celebration": "Modern celebrations often include large gatherings at Gurdwaras (Sikh temples) with special prayers and sermons.  Many Sikhs attend religious services and participate in community seva (selfless service). Festive processions and celebrations also take place.",
      "impact_and_legacy": "Guru Gobind Singh Ji's birth profoundly impacted Sikhism, establishing a distinct identity and a framework for future generations. His legacy continues to inspire courage, selflessness, and the pursuit of justice, influencing millions worldwide."
    },
    "alternate_names": [],
    "category": "Sikhism",
    "created_at": "2025-01-04 12:39:35 UTC",
    "end_date": "21-01-25",
    "last_updated": "2025-01-04 12:39:31 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Good Friday",
    "start_date": "18-04-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Good Friday commemorates the crucifixion of Jesus Christ and is observed by Christians worldwide.  Its origins trace back to the early Church and the accounts of Jesus' death in the Gospels. The day's name reflects the 'goodness' of Christ's sacrifice in achieving salvation.",
      "significance": "Good Friday holds immense religious significance as a day of mourning, reflection, and remembrance of Jesus' suffering.  It's a crucial element in the Christian liturgical year, leading up to Easter Sunday's celebration of the Resurrection. The day underscores themes of sacrifice, redemption, and hope.",
      "observance_details": "Traditionally, Good Friday is observed with solemn church services, often featuring readings from the Gospels recounting the crucifixion. Many Christians participate in fasting, prayer, and acts of penance.  Special processions and symbolic representations of the crucifixion are also common.",
      "modern_celebration": "Modern celebrations maintain many traditional elements but also incorporate diverse expressions of faith.  Church services are widely attended, often incorporating music and reflection.  Many individuals and families participate in community service or spend time in quiet contemplation.",
      "impact_and_legacy": "Good Friday's impact is seen in the widespread Christian practice of observing Lent and the enduring power of the crucifixion narrative in shaping Christian theology and art. Its legacy endures in the ongoing reflection on themes of sacrifice, love, and forgiveness."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-04 12:39:38 UTC",
    "end_date": "18-04-25",
    "last_updated": "2025-01-04 12:39:35 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Lohri",
    "start_date": "13-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Lohri is an ancient Punjabi harvest festival, its origins possibly linked to pre-Sikh traditions celebrating the winter solstice and the new harvest.  It's associated with the legendary tale of Dulla Bhatti, a folk hero who protected the poor from oppression. Over time, it evolved into a community celebration marking the end of winter and the start of longer days.",
      "significance": "Lohri signifies the triumph of good over evil, prosperity, and the bounty of the harvest.  It is a significant cultural event fostering community bonding and celebrating the cycle of nature. The festival carries immense emotional value for Punjabi families, signifying warmth, togetherness, and hope.",
      "observance_details": "Traditionally, Lohri is observed by lighting a bonfire, offering food to the flames, and singing folk songs.  People gather around the bonfire, share sweets and food, and celebrate the harvest with traditional dances.  It's a time for families to come together and express gratitude for the blessings of the season.",
      "modern_celebration": "Modern Lohri celebrations still involve bonfires and community gatherings but often incorporate modern elements.  Families and friends exchange gifts, participate in festivities organized by community groups, and enjoy a diverse range of food and music.  The use of social media also enhances sharing and celebrating the event across geographical boundaries.",
      "impact_and_legacy": "Lohri has played a vital role in preserving Punjabi culture and traditions. It continues to strengthen community ties and promote the values of sharing and togetherness. Its enduring popularity signifies its deep roots in Punjabi society and its significance as a festival of hope and renewal."
    },
    "alternate_names": [],
    "category": "Sikhism",
    "created_at": "2025-01-04 12:39:42 UTC",
    "end_date": "13-01-25",
    "last_updated": "2025-01-04 12:39:38 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Diwali",
    "start_date": "01-11-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Diwali, or Deepavali, is an ancient Hindu festival celebrated for five days.  Its origins are linked to various legends, including the return of Lord Rama to Ayodhya after defeating Ravana and the victory of good over evil.  Different regions and communities may emphasize different aspects of these narratives.",
      "significance": "Diwali signifies the triumph of light over darkness, good over evil, and knowledge over ignorance.  It's a time for family gatherings, reflection, and expressing gratitude. The festival fosters a sense of community and shared cultural identity.",
      "observance_details": "Traditional observances include lighting diyas (oil lamps), offering prayers to deities, sharing sweets and gifts, and creating elaborate rangoli designs.  Fireworks displays are also common, symbolizing the dispelling of darkness. Families perform Lakshmi Puja to invoke prosperity and good fortune.",
      "modern_celebration": "Modern celebrations retain traditional elements but often incorporate contemporary aspects.  People decorate their homes with electric lights, exchange electronic greetings, and participate in community events.  Diwali is increasingly celebrated globally by people of Indian heritage and beyond.",
      "impact_and_legacy": "Diwali's impact is evident in its widespread celebration and enduring symbolism. It fosters cross-cultural understanding and appreciation for diverse traditions. Its legacy lies in its continuous adaptation and relevance across generations, promoting hope and positivity."
    },
    "alternate_names": [
      "Deepavali",
      "Festival of Lights",
      "Deepawali"
    ],
    "category": "Hinduism",
    "created_at": "2025-01-04 12:39:46 UTC",
    "end_date": "01-11-24",
    "last_updated": "2025-01-04 12:42:07 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "ʻĪd al-Fiṭr",
    "start_date": "30-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Eid al-Fitr marks the end of Ramadan, the Islamic holy month of fasting.  It's rooted in the Islamic calendar, commemorating the completion of the fast and celebrating the submission to God's will. The prophet Muhammad established the practice of celebrating this occasion.",
      "significance": "Eid al-Fitr is a time of great joy and spiritual reflection, signifying gratitude for God's blessings.  It emphasizes communal solidarity and strengthens family bonds through shared celebrations and prayer. The holiday promotes acts of charity and generosity.",
      "observance_details": "The day begins with the Fajr prayer (dawn prayer), followed by offering special Eid prayers at mosques or open spaces.  Families gather for festive meals and exchange gifts.  Zakat al-Fitr, a mandatory charity, is given to the needy before prayers.",
      "modern_celebration": "Modern celebrations often include large family gatherings, feasts featuring traditional dishes, and exchanging gifts.  New clothes are often worn, and children receive Eidi (money or gifts).  Many communities organize Eid prayer events in larger venues.",
      "impact_and_legacy": "Eid al-Fitr fosters a sense of unity and strengthens community ties among Muslims worldwide.  Its emphasis on charity and generosity supports vulnerable populations. The holiday's enduring legacy lies in its capacity to promote spiritual renewal and social cohesion."
    },
    "alternate_names": [
      "Eid ul-Fitr",
      "Eid al-Fitr",
      "Ramadan Eid",
      "Lesser Eid"
    ],
    "category": "Islam",
    "created_at": "2025-01-04 12:39:50 UTC",
    "end_date": "31-03-25",
    "last_updated": "2025-01-04 12:41:40 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Day of Ḥajj",
    "start_date": "08-06-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "The Day of Ḥajj, or Yawm al-Nahr, marks the culmination of the Hajj pilgrimage.  Its origins trace back to the Prophet Ibrahim's (Abraham's) willingness to sacrifice his son, Ismail (Ishmael), as an act of obedience to God. This pivotal event is commemorated annually by Muslims worldwide.",
      "significance": "The Day of Ḥajj is the most significant day of the Hajj pilgrimage, representing spiritual renewal and submission to God. It symbolizes sacrifice, devotion, and the unity of the Muslim Ummah (community) as millions gather in Mecca. The day holds immense religious importance, signifying a spiritual climax for pilgrims.",
      "observance_details": "On the Day of Ḥajj, pilgrims perform the symbolic stoning of the devil at Jamaraat. They then participate in the ritual sacrifice of an animal, usually a sheep or goat, the meat of which is often distributed to the poor.  This is followed by the celebration of Eid al-Adha.",
      "modern_celebration": "Modern celebrations include large-scale communal prayers and the distribution of sacrificial meat to those in need.  Many Muslims worldwide celebrate Eid al-Adha with family and friends, exchanging gifts and participating in festive meals.  The day is also marked by increased acts of charity and community service.",
      "impact_and_legacy": "The Day of Ḥajj fosters a strong sense of global Muslim brotherhood and unity.  Its enduring legacy lies in its continuous reinforcement of Islamic values such as sacrifice, compassion, and devotion to God. The rituals also strengthen the bonds of community among pilgrims."
    },
    "alternate_names": [],
    "category": "Islam",
    "created_at": "2025-01-04 12:39:54 UTC",
    "end_date": "08-06-25",
    "last_updated": "2025-01-04 12:39:50 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Theravāda New Year",
    "start_date": "14-04-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Theravada New Year, also known as Sinhala and Myanmar New Year, is an ancient festival rooted in the lunar calendar's astrological calculations.  Its origins trace back to pre-Buddhist agrarian cycles and were later integrated into Buddhist traditions. The specific dates vary slightly across different Theravada Buddhist countries.",
      "significance": "The New Year signifies a time for renewal, reflection, and spiritual cleansing.  It's a period for strengthening family bonds, practicing generosity, and making merit through religious observances.  The festival reinforces the community's shared cultural identity.",
      "observance_details": "Traditionally, the New Year begins with religious rituals like temple visits and offering alms to monks.  Families engage in house cleaning, preparing traditional meals, and participating in games and festivities.  The day also involves symbolic acts such as making merit, visiting relatives, and engaging in charitable acts.",
      "modern_celebration": "Modern celebrations often involve community events, cultural performances, and large-scale gatherings.  While traditional practices continue, elements like fireworks, social media interactions, and modern entertainment are now part of the festivities.  Families still place emphasis on the religious and social aspects.",
      "impact_and_legacy": "The Theravada New Year continues to play a vital role in preserving cultural traditions and values. It fosters social cohesion and community spirit. The festival's legacy lies in its ability to blend religious practices with vibrant cultural expressions, ensuring its continued relevance."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-04 12:39:58 UTC",
    "end_date": "14-04-25",
    "last_updated": "2025-01-04 12:39:54 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Navaratri",
    "start_date": "29-10-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Navaratri, meaning 'nine nights', is a Hindu festival celebrating the victory of good over evil.  Its origins are linked to ancient scriptures and mythology, particularly the goddess Durga's triumph over the demon Mahishasura.  Different regions associate it with various goddesses and stories.",
      "significance": "Navaratri holds immense cultural and spiritual significance, symbolizing the divine feminine power and the triumph of virtue.  It's a time for self-reflection, spiritual practices, and seeking blessings. The festival unites communities in celebration and reinforces faith.",
      "observance_details": "Traditionally, Navaratri involves nine days of fasting, prayer, and devotional worship to different forms of the Goddess Durga.  People visit temples, perform pujas (rituals), and sing devotional songs.  Fasting varies in intensity, with some observing complete abstinence.",
      "modern_celebration": "Modern celebrations include vibrant cultural programs, Garba and Dandiya Raas dances, and elaborate decorations.  Families and communities gather for feasts and celebrations, incorporating elements of both traditional rituals and modern entertainment.  The festival is also marked by social gatherings and exhibitions.",
      "impact_and_legacy": "Navaratri has a profound impact on society, fostering a sense of community and shared cultural identity.  Its legacy lies in its enduring power to inspire faith, promote virtue, and celebrate the feminine divine.  The festival’s traditions continue to evolve, adapting to contemporary contexts while preserving its core essence."
    },
    "alternate_names": [
      "Navratri",
      "Durga Puja",
      "Dussehra"
    ],
    "category": "Hinduism",
    "created_at": "2025-01-04 12:40:01 UTC",
    "end_date": "29-10-24",
    "last_updated": "2025-01-04 12:39:58 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Holi",
    "start_date": "10-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Holi's origins are rooted in ancient Hindu mythology, possibly linked to the victory of good over evil as represented by the story of Prahlad and Holika.  It's also associated with the arrival of spring and the celebration of new beginnings.  Over time, the festival has evolved, incorporating various regional traditions and beliefs.",
      "significance": "Holi signifies the triumph of good over evil, the arrival of spring, and the end of winter. It's a festival of colors symbolizing joy, renewal, and the vibrant energy of life, fostering a sense of unity and community among people.",
      "observance_details": "Traditionally, Holi is celebrated over two days.  The first day, Holika Dahan, involves a bonfire symbolizing the burning of evil. The second day, Rangwali Holi, is characterized by the playful throwing of colored powder and water.",
      "modern_celebration": "Modern celebrations often involve elaborate preparations, including the creation of natural or synthetic colors.  Large gatherings and parties are common, sometimes featuring music, dance, and traditional sweets.  The festival has also spread to many parts of the world beyond India.",
      "impact_and_legacy": "Holi's impact is seen in its promotion of social harmony and community bonding.  Its vibrant colors and joyous atmosphere have inspired art, literature, and popular culture globally, solidifying its status as a significant cultural symbol."
    },
    "alternate_names": [],
    "category": "Hinduism",
    "created_at": "2025-01-04 12:40:05 UTC",
    "end_date": "10-03-25",
    "last_updated": "2025-01-04 12:40:01 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Festival of Ksitigarbha",
    "start_date": "30-09-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "The Festival of Ksitigarbha, also known as Ullambana, originates from a Buddhist sutra detailing the filial piety of Maudgalyayana, who rescued his deceased mother from suffering in the underworld through Buddhist practices.  Its roots lie in ancient Chinese Buddhism and have spread throughout East Asia.  The festival's core revolves around showing respect for ancestors and deceased loved ones.",
      "significance": "The festival holds immense cultural and social significance, emphasizing filial piety and the importance of ancestor veneration. It underscores the Buddhist concept of karmic relationships and the power of prayers to alleviate suffering in the afterlife. The festival fosters family unity and strengthens communal bonds through shared rituals.",
      "observance_details": "Traditionally, the festival involves chanting sutras dedicated to Ksitigarbha, the Bodhisattva of the underworld, and performing rituals to benefit deceased relatives.  Monks often conduct special services, and families may visit temples and offer prayers for their ancestors' liberation from suffering. Offerings of food and incense are common.",
      "modern_celebration": "Modern celebrations often include temple services, chanting, and the preparation of special vegetarian meals.  Many families visit cemeteries to clean and decorate their ancestors' graves.  The emphasis remains on prayers for the deceased and acts of piety to honor their memory.",
      "impact_and_legacy": "The festival's enduring legacy lies in its promotion of filial piety and family values.  It has shaped cultural practices related to death and remembrance throughout East Asia.  The festival's focus on karmic connections and the importance of compassionate action continues to resonate with practitioners today."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-04 12:40:09 UTC",
    "end_date": "30-09-24",
    "last_updated": "2025-01-04 12:40:05 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Mahashivaratri",
    "start_date": "21-02-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Mahashivaratri, meaning \"The Great Night of Shiva\", is a Hindu festival celebrating the union of Lord Shiva and Goddess Parvati.  Its origins are ancient, with references found in various scriptures and traditions, though the exact historical beginning is unclear.  The night is considered auspicious, symbolizing the triumph of good over evil.",
      "significance": "The festival holds immense spiritual significance, representing the awakening of Kundalini energy and the potential for spiritual growth.  It's a time for introspection, prayer, and devotion to Lord Shiva, fostering a sense of unity and faith among devotees.  Many believe that performing austerities on this night brings immense spiritual merit.",
      "observance_details": "Traditionally, devotees observe a fast, staying awake all night through chanting, meditation, and worship of Shiva lingams.  They may visit Shiva temples, participate in special pujas (rituals), and offer prayers and offerings.  The night is often filled with religious music and devotional songs.",
      "modern_celebration": "Modern celebrations often involve large gatherings at temples and homes, with elaborate decorations and devotional singing.  Many incorporate community events, processions, and feasts.  Technological advancements have enabled online participation and global connectivity among devotees.",
      "impact_and_legacy": "Mahashivaratri continues to unite millions of Hindus globally, fostering a sense of community and shared spiritual practice.  Its emphasis on self-reflection and devotion to a higher power has left a lasting influence on Hindu culture and spirituality. The festival's enduring popularity reflects its deep-rooted significance in the lives of believers."
    },
    "alternate_names": [
      "Maha Shivaratri",
      "Great Night of Shiva"
    ],
    "category": "Hinduism",
    "created_at": "2025-01-04 12:40:13 UTC",
    "end_date": "21-02-25",
    "last_updated": "2025-01-04 12:40:28 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Indigenous Veterans Day",
    "start_date": "08-11-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Indigenous Veterans Day lacks a single, universally recognized origin date or founder.  Its emergence reflects a growing awareness and acknowledgment of the contributions of Indigenous peoples to the military service of their respective nations.  The day's observance developed organically from grassroots efforts and local initiatives to honor these veterans.",
      "significance": "The day holds immense cultural and social significance as it recognizes the unique sacrifices and challenges faced by Indigenous veterans who often served while confronting systemic racism and discrimination within their own countries.  It also highlights the resilience and patriotism of Indigenous communities. The event serves as a powerful moment of recognition and reconciliation.",
      "observance_details": "Traditional observances vary depending on the specific Indigenous nation or community.  Common practices include ceremonies, speeches, and tributes honoring veterans' service.  Many include traditional Indigenous songs, dances, and prayers.  Specific commemorations often occur on the same date as other Veterans Day observances.",
      "modern_celebration": "Modern celebrations often involve community gatherings, parades, and the unveiling of memorials dedicated to Indigenous veterans.  Many events feature storytelling and the sharing of veterans' personal experiences.  Increased media attention and social media campaigns also serve to raise awareness.",
      "impact_and_legacy": "Indigenous Veterans Day fosters greater understanding and appreciation of Indigenous contributions to military service.  It pushes for ongoing reconciliation and addresses historical injustices.  The event helps to build bridges between Indigenous communities and the broader society, promoting a more inclusive and equitable commemoration of military service."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:40:17 UTC",
    "end_date": "08-11-24",
    "last_updated": "2025-01-04 12:40:13 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Ascension",
    "start_date": "29-05-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Ascension Day commemorates the ascension of Jesus Christ into Heaven, forty days after his resurrection.  The event is described in the New Testament, particularly in the Gospels and the Book of Acts.  Its origins are rooted in early Christian traditions and became an established part of the liturgical calendar.",
      "significance": "Ascension Day holds immense theological significance for Christians, signifying Christ's triumph over death and his return to the Father.  It marks the culmination of Jesus' earthly ministry and the beginning of the Church's mission to spread the Gospel.  The event reinforces the hope of Christian believers in the promise of eternal life.",
      "observance_details": "Traditionally, Ascension Day is observed with special church services, featuring readings from the Gospel accounts of the Ascension.  Processions and sermons emphasizing Christ's ascension and the promise of the Holy Spirit often take place.  It was historically a significant holy day with restrictions on work and celebrations.",
      "modern_celebration": "While less widely observed as a public holiday in many parts of the world, Ascension Day is still celebrated in various Christian denominations with church services.  Some churches hold special events, and the day may be observed with prayer and reflection.  The significance varies depending on denomination and cultural context.",
      "impact_and_legacy": "The Ascension profoundly shaped Christian theology, influencing doctrines related to Christ's divinity and the nature of the church.  Its commemoration continues to inspire believers and reaffirm their faith in Christ's promise of salvation.  The impact on societal practices has lessened in secularized societies, but remains significant in many Christian communities."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-04 12:40:20 UTC",
    "end_date": "29-05-25",
    "last_updated": "2025-01-04 12:40:17 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Navaratri",
    "start_date": "29-09-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Navaratri, meaning 'nine nights', is a Hindu festival celebrated over nine days and nights.  Its origins are linked to the victory of Goddess Durga over the demon Mahishasura, symbolizing the triumph of good over evil.  Different regional variations exist, emphasizing different aspects of the Goddess.",
      "significance": "Navaratri holds immense cultural and religious significance, representing the divine feminine energy and the victory of good over evil. It's a time for self-reflection, spiritual growth, and seeking blessings from the Goddess. The festival unites communities and promotes social harmony.",
      "observance_details": "Traditionally, Navaratri involves fasting, prayers, and devotional songs dedicated to the nine forms of Goddess Durga.  People visit temples, perform 'puja' (worship), and create elaborate 'golu' displays (arrangements of dolls and statues).  Fasting practices vary depending on individual devotion and regional customs.",
      "modern_celebration": "Modern celebrations include vibrant cultural programs, dance performances (especially Garba and Dandiya Raas), and social gatherings.  Families often decorate their homes, exchange gifts, and enjoy festive meals. The festival has become a significant tourist attraction in many regions.",
      "impact_and_legacy": "Navaratri has a profound impact on social cohesion, fostering a sense of community and shared religious identity. Its lasting legacy lies in its enduring popularity and its ability to transcend regional and linguistic boundaries, uniting people through shared celebrations and devotion."
    },
    "alternate_names": [
      "Navratri",
      "Durga Puja",
      "Dussehra"
    ],
    "category": "Hinduism",
    "created_at": "2025-01-04 12:40:24 UTC",
    "end_date": "29-09-24",
    "last_updated": "2025-01-04 12:41:44 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Magha Puja",
    "start_date": "12-02-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Magha Puja commemorates the first gathering of 1,250 arahants (enlightened beings) with the Buddha in Vesali, India, during the full moon of Magha.  This event is significant as it marked the culmination of the Buddha's teachings and the strengthening of the Sangha (Buddhist community). The specific date is determined by the lunar calendar.",
      "significance": "Magha Puja is considered one of the most important Buddhist festivals, symbolizing unity, harmony, and the supreme achievement of enlightenment. It reinforces the importance of monastic discipline and the collective efforts towards spiritual growth within the Sangha.",
      "observance_details": "Traditionally, Magha Puja involves attending special sermons and meditation sessions at temples. Monks and lay devotees participate in chanting and offering prayers, reflecting on the Buddha's teachings and striving for self-improvement.  The day is dedicated to religious observance and contemplation.",
      "modern_celebration": "Modern celebrations often include elaborate candlelight processions, chanting ceremonies, and community gatherings at Buddhist temples worldwide.  Many people engage in acts of charity and mindfulness practices throughout the day.  Educational programs about the Buddha's teachings are also common.",
      "impact_and_legacy": "Magha Puja fosters a strong sense of community and shared spiritual aspiration among Buddhists. It continues to inspire individuals towards ethical conduct, compassion, and the pursuit of enlightenment, leaving a lasting legacy of peace and understanding. The event strengthens Buddhist identity and promotes unity across different traditions."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-04 12:40:28 UTC",
    "end_date": "12-02-25",
    "last_updated": "2025-01-04 12:40:24 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Festival of Higan-e",
    "start_date": "21-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Higan-e, meaning 'equinox', is a Buddhist festival originating in China and introduced to Japan centuries ago.  It's observed during the autumnal and vernal equinoxes, marking the transition between seasons and honoring ancestors.",
      "significance": "Higan-e is a time for remembering and honoring deceased family members. It emphasizes filial piety and reflects the Buddhist concept of the cyclical nature of life and death.  The festival promotes reflection on one's life and relationship with the spiritual world.",
      "observance_details": "Traditionally, Higan-e involves visiting family graves to clean and offer flowers and food. Buddhist temples hold special services, and people offer prayers for the deceased and their own well-being.  Strict vegetarian diets are often observed during the festival period.",
      "modern_celebration": "While many still observe traditional practices, modern celebrations may include simpler memorial visits or offering prayers at home.  Some families gather for meals emphasizing seasonal foods. Higan-e's significance as a time for family reflection continues to resonate.",
      "impact_and_legacy": "Higan-e has deeply influenced Japanese culture, promoting family bonds and respect for ancestors across generations.  Its emphasis on remembrance and the interconnectedness of life and death continues to shape spiritual and social values in Japan. The festival's adaptability ensures its continued relevance in modern society."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-04 12:40:31 UTC",
    "end_date": "21-03-25",
    "last_updated": "2025-01-04 12:40:28 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Easter",
    "start_date": "20-04-25",
    "additional_details": null,
    "alternate_names": [
      "Easter Sunday",
      "Easter Day",
      "Resurrection Sunday",
      "Paschal Sunday"
    ],
    "category": "Christianity",
    "created_at": "2025-01-04 12:40:34 UTC",
    "end_date": "20-04-25",
    "last_updated": "2025-01-04 12:42:22 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ],
    "additional_information": {
      "historical_background": "Easter is a Christian festival celebrating the resurrection of Jesus Christ, as described in the New Testament.  Its origins are rooted in Jewish Passover, reflecting Jesus's last supper and crucifixion.  The date varies annually, falling on the first Sunday after the Paschal full moon.",
      "significance": "Easter is the most important holiday in the Christian liturgical year, signifying hope, renewal, and the triumph of life over death. It holds deep spiritual meaning for billions worldwide, representing faith and redemption.  The holiday's themes often resonate even with non-believers, focusing on springtime and new beginnings.",
      "observance_details": "Traditional observances include church services focusing on the resurrection, often featuring hymns and sermons.  Many Christians participate in Lent, a period of fasting and reflection leading up to Easter.  Family gatherings and special meals are common.",
      "modern_celebration": "Modern Easter celebrations incorporate many traditions, including Easter egg hunts for children, gift-giving, and elaborate Easter meals.  Many communities host Easter parades and public celebrations.  The holiday is a time for family reunions and joyful gatherings.",
      "impact_and_legacy": "Easter's impact extends beyond religious practice, influencing art, music, and literature for centuries.  Its symbolism of rebirth and renewal remains powerfully resonant across cultures. The holiday continues to be a significant cultural event, promoting community and fostering a sense of shared tradition."
    }
  },
  {
    "name": "Installation of the Sri Guru Granth Sahib Ji",
    "start_date": "14-04-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "The installation of the Sri Guru Granth Sahib Ji, the holy scripture of Sikhism, marks the culmination of the Sikh Gurus' teachings and the establishment of the Guru Granth Sahib as the eternal Guru.  Following Guru Gobind Singh Ji's passing, he designated the Adi Granth (the original compilation) as the eternal Guru. The Adi Granth was later expanded and officially installed as the Sri Guru Granth Sahib Ji.",
      "significance": "The installation signifies the transition of spiritual authority from the line of human Gurus to the eternal Guru, the Sri Guru Granth Sahib Ji.  It is a deeply sacred event symbolizing the continuation of Sikh spiritual guidance and the ultimate source of truth and wisdom for Sikhs. This event is central to the Sikh faith and its identity.",
      "observance_details": "Traditionally, the installation involves a meticulously planned ceremony led by Panj Pyare (five beloved ones), with specific rituals, prayers, and hymns recited.  The Granth Sahib is ceremonially placed on a raised platform (Takht), adorned with reverence.  The community participates with hymns, prayers, and offerings of respect.",
      "modern_celebration": "Modern celebrations often involve large gatherings of Sikhs, with religious leaders conducting the installation ceremony.  The event is frequently marked by Akhand Paath (continuous recitation of the Sri Guru Granth Sahib Ji), Kirtan (devotional singing), and Langar (community kitchen) signifying shared faith and brotherhood.  Many Gurdwaras worldwide conduct such installations.",
      "impact_and_legacy": "The installation ensured the continuity of Sikh religious practice and teachings, providing a unifying force for the community.  It established the Granth Sahib as the supreme authority, fostering a strong sense of unity and collective identity among Sikhs globally.  The event remains a pivotal moment in Sikh history, shaping its religious and cultural landscape."
    },
    "alternate_names": [],
    "category": "Sikhism",
    "created_at": "2025-01-04 12:40:38 UTC",
    "end_date": "14-04-25",
    "last_updated": "2025-01-04 12:40:34 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Commonwealth Day",
    "start_date": "10-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Commonwealth Day's origins trace back to Empire Day in 1902, commemorating the accession of King Edward VII.  It evolved into Commonwealth Day in 1958, reflecting the shift from empire to the Commonwealth of Nations. The day is now celebrated annually across the Commonwealth.",
      "significance": "Commonwealth Day celebrates the shared values, history, and diversity of its 56 member states. It fosters a sense of global community and promotes cooperation on issues such as sustainable development, human rights, and democracy. The day emphasizes the enduring bonds between nations.",
      "observance_details": "Traditionally, Commonwealth Day involves church services, flag-raising ceremonies, and educational programs focusing on the Commonwealth.  Speeches and events often highlight the themes of cooperation and shared values. Many schools and communities organize events to mark the day.",
      "modern_celebration": "Modern celebrations incorporate digital platforms for wider reach, including virtual events and social media campaigns using the #CommonwealthDay hashtag.  Events often incorporate artistic performances and cultural exchanges, showcasing the diversity of the Commonwealth.  A central Commonwealth Day theme is announced annually.",
      "impact_and_legacy": "Commonwealth Day strengthens international collaboration, fostering ties between nations and promoting understanding across diverse cultures. It builds a network of shared learning and experiences, supporting sustainable development across the Commonwealth. The day's legacy lies in its continued promotion of unity and cooperation."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:40:42 UTC",
    "end_date": "10-03-25",
    "last_updated": "2025-01-04 12:40:38 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Remembrance Day",
    "start_date": "11-11-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Remembrance Day originated in the aftermath of World War I to commemorate the armistice signed on November 11, 1918, ending hostilities on the Western Front.  It evolved from Armistice Day and expanded to honor all military personnel who died in conflicts.",
      "significance": "Remembrance Day holds profound cultural and social significance as a time for national mourning and reflection on the sacrifices made in war. It fosters a sense of unity and remembrance for fallen soldiers and victims of conflict.",
      "observance_details": "Traditionally, Remembrance Day is observed with a two-minute silence at 11:00 am on November 11th, the time the armistice was signed.  Poppy wearing is a widespread symbol of remembrance, and services are held at war memorials and cemeteries.",
      "modern_celebration": "Modern celebrations include wreath-laying ceremonies, parades, memorial services, and educational programs in schools.  The wearing of poppies remains prominent, and acts of remembrance are increasingly shared online and through social media.",
      "impact_and_legacy": "Remembrance Day has fostered a lasting legacy of remembering those who died in service, promoting peace, and raising awareness about the impact of war.  It continues to shape national identity and encourages reflection on the costs of conflict."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:40:48 UTC",
    "end_date": "11-11-24",
    "last_updated": "2025-01-04 12:40:44 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "All Saints Day",
    "start_date": "01-11-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "All Saints' Day, also known as All Hallows' Day, originated in the early Middle Ages as a day to honor all Christian saints.  Its origins are linked to the dedication of a church in Rome in 609 AD and later adoption by the church.  The date, November 1st, was likely chosen to follow the ancient Celtic festival of Samhain.",
      "significance": "All Saints' Day holds significant religious importance for Catholics and many other Christians, serving as a time for remembrance and prayer for the faithful departed. It's a day to celebrate the lives and holiness of all saints, known and unknown. The day promotes reflection on faith and spiritual connection.",
      "observance_details": "Traditionally, All Saints' Day involves attending special masses and services in churches.  Many visit cemeteries to decorate graves and pray for deceased loved ones.  The day is often one of solemn reflection and remembrance.",
      "modern_celebration": "Modern celebrations vary across cultures and regions.  Many attend religious services, while others spend time with family and friends, remembering those who have passed.  Visits to cemeteries, placing flowers or lighting candles on graves remain common practices, reflecting enduring traditions.",
      "impact_and_legacy": "All Saints' Day continues to shape religious practices globally, fostering a strong sense of community and shared faith among believers. Its legacy emphasizes the importance of remembering the departed and celebrating the lives of saints who inspire faith. The day's enduring traditions reflect a deep-rooted cultural and spiritual connection."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-04 12:40:55 UTC",
    "end_date": "01-11-24",
    "last_updated": "2025-01-04 12:40:51 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Sir John A. Macdonald Day",
    "start_date": "10-06-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Sir John A. Macdonald Day commemorates the birth of Canada's first Prime Minister, Sir John A. Macdonald, born on January 11, 1815.  The day's origins are rooted in recognizing his role in Confederation and the formation of the Canadian nation.  While not initially a widely celebrated national holiday, it gained prominence over time through regional and local observances.",
      "significance": "The day holds significance as a commemoration of a pivotal figure in Canadian history, acknowledging his contributions to nation-building.  However, its significance is complex, given Macdonald's controversial legacy, particularly his role in the residential school system and policies towards Indigenous peoples. The day's observance thus sparks ongoing debate and reflection on Canada's past.",
      "observance_details": "Traditionally, Sir John A. Macdonald Day involved speeches, historical reenactments, and community gatherings focusing on his life and accomplishments.  Some communities might hold parades or historical displays highlighting key events of his political career. These events aimed to educate and celebrate his contributions to Canadian identity.",
      "modern_celebration": "Modern celebrations vary across Canada, with some communities maintaining traditional observances while others focus on critical reassessments of Macdonald's legacy.  The day is often an occasion for discussions on reconciliation with Indigenous peoples and addressing Canada's colonial past.  Some events combine historical commemorations with educational programs aimed at fostering a more comprehensive understanding of this complicated historical figure.",
      "impact_and_legacy": "Macdonald's legacy continues to shape Canadian identity and political systems, leaving a lasting impact on the nation's structure and institutions.  However, his legacy is also intertwined with profound injustices inflicted upon Indigenous communities, sparking ongoing debate about how to reconcile Canada's founding with its colonial past and acknowledge the harm caused. His impact remains a focal point in the ongoing conversation around reconciliation and truth."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:40:59 UTC",
    "end_date": "10-06-25",
    "last_updated": "2025-01-04 12:40:55 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Islamic New Year",
    "start_date": "05-07-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Islamic New Year, Muharram, marks the beginning of the Islamic lunar calendar.  It commemorates the Hijra, the migration of the Prophet Muhammad from Mecca to Medina in 622 CE, a pivotal event in Islamic history. This migration signifies the establishment of the first Muslim community and the beginning of the Islamic era.",
      "significance": "Muharram holds immense religious significance for Muslims worldwide. It's a time for reflection, repentance, and renewed commitment to faith.  The month is considered sacred and many Muslims engage in increased prayer, charity, and self-reflection.",
      "observance_details": "Traditionally, Muharram is observed through increased prayer and recitation of the Quran.  Fasting on the tenth day of Muharram, Ashura, is a common practice, although not obligatory for all.  Many Muslims also engage in acts of charity and community service.",
      "modern_celebration": "Modern celebrations often include special prayers in mosques, family gatherings, and feasts.  Many Muslim communities organize religious lectures, cultural events, and charity drives.  The focus remains on spiritual reflection and strengthening community bonds.",
      "impact_and_legacy": "The Islamic New Year continues to unify Muslims globally, fostering a sense of shared identity and history.  Its emphasis on spiritual renewal and social responsibility reinforces ethical values.  The ongoing observance of Muharram ensures the enduring memory of the Hijra and its significance in shaping Islamic civilization."
    },
    "alternate_names": [
      "Hijri New Year",
      "Arabic New Year",
      "Muharram"
    ],
    "category": "Islam",
    "created_at": "2025-01-04 12:41:03 UTC",
    "end_date": "06-07-25",
    "last_updated": "2025-01-04 12:40:59 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Mahāyāna New Year",
    "start_date": "29-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Mahāyāna New Year, while not a universally fixed date like the Gregorian calendar's New Year, is associated with the lunar calendar and varies by region and tradition.  It's rooted in the Buddhist concept of cyclical time and renewal, reflecting the emphasis on spiritual rebirth within Mahāyāna Buddhism.  Its precise origins are difficult to pinpoint due to the decentralized nature of Mahāyāna traditions.",
      "significance": "The New Year holds immense cultural and spiritual significance, marking a time for reflection, repentance, and setting new intentions for spiritual growth. It represents a fresh start and an opportunity to strengthen one's commitment to Buddhist practice.  Community gatherings and rituals reinforce social bonds and shared faith.",
      "observance_details": "Traditional observances often include temple visits for prayers and ceremonies, offerings to Buddhas and Bodhisattvas, chanting of sutras, and making merit through charitable giving.  Many abstain from negative actions and engage in practices like meditation and mindfulness.  Families may gather for special meals and share blessings.",
      "modern_celebration": "Modern celebrations retain many traditional elements but are often adapted to contemporary lifestyles.  Community events, religious festivals, and online gatherings are common.  Emphasis is placed on community engagement and spreading positive energy.  The integration of New Year's themes into digital platforms and social media is growing.",
      "impact_and_legacy": "The Mahāyāna New Year reinforces the values of compassion, mindfulness, and community within Buddhist societies.  Its continued celebration ensures the transmission of Buddhist teachings and traditions across generations.  The emphasis on self-reflection and renewal contributes to personal and societal well-being."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-04 12:41:07 UTC",
    "end_date": "29-01-25",
    "last_updated": "2025-01-04 12:41:03 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Ash Wednesday",
    "start_date": "05-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Ash Wednesday marks the beginning of Lent in the Christian liturgical year.  Its origins trace back to early penitential practices in the church and the imposition of ashes as a symbol of repentance and mortality. The practice became formalized over centuries, solidifying its place in the liturgical calendar.",
      "significance": "Ash Wednesday holds deep spiritual significance for Christians, representing a time of reflection, repentance, and preparation for Easter.  It serves as a call to turn away from sin and embrace a renewed commitment to faith. Socially, it's a widely recognized period of spiritual observance, impacting individual and communal life.",
      "observance_details": "Traditionally, Ash Wednesday involves the imposition of ashes on the forehead in the shape of a cross, accompanied by a liturgical service.  Fasting and abstinence from certain foods are common practices, symbolizing sacrifice and penitence. Prayers of confession and repentance are central to the day's observances.",
      "modern_celebration": "Modern celebrations often incorporate Ash Wednesday services in churches, with many attending to receive ashes and participate in prayer.  While fasting practices may vary, the emphasis remains on spiritual reflection and preparation for Lent.  Some incorporate charitable acts and community service into their observance.",
      "impact_and_legacy": "Ash Wednesday's impact is seen in its lasting influence on Christian spirituality and the liturgical calendar.  It continues to provide a time for self-examination and renewal, prompting reflection on mortality and the importance of faith.  Its influence extends beyond the religious sphere, shaping cultural attitudes towards self-reflection and charitable giving."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-04 12:41:10 UTC",
    "end_date": "05-03-25",
    "last_updated": "2025-01-04 12:41:07 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Pride Weekend",
    "start_date": "29-06-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Pride events originated in the aftermath of the Stonewall riots of 1969, a pivotal moment in the LGBTQ+ rights movement.  The first Pride marches and celebrations were organized to commemorate the uprising and to advocate for LGBTQ+ equality.  These early events laid the groundwork for the global Pride movement we see today.",
      "significance": "Pride Weekend holds immense cultural and social significance as a demonstration of LGBTQ+ pride and solidarity.  It serves as a platform for advocacy, raising awareness about LGBTQ+ issues and promoting inclusivity. The event fosters a sense of community and belonging for LGBTQ+ individuals and allies.",
      "observance_details": "Historically, Pride events involved marches and demonstrations, focusing on political activism and demanding equal rights.  These early celebrations often included speeches, rallies, and community gatherings.  The focus was largely on visibility and challenging discrimination.",
      "modern_celebration": "Modern Pride celebrations are vibrant festivals characterized by parades, concerts, parties, and community events.  Many Pride festivals also incorporate educational and awareness initiatives, including workshops, talks, and art exhibitions.  The celebrations are now much larger and more inclusive, with diverse participation from allies and LGBTQ+ people of various identities.",
      "impact_and_legacy": "Pride events have significantly impacted society by raising awareness of LGBTQ+ issues and fostering a more inclusive and accepting society.  They have played a vital role in advancing LGBTQ+ rights and equality worldwide.  The enduring legacy of Pride is its continued demonstration of resilience, strength, and the ongoing pursuit of justice."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:41:14 UTC",
    "end_date": "29-06-25",
    "last_updated": "2025-01-04 12:41:10 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "National Flag of Canada Day",
    "start_date": "01-07-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Canada's national flag, officially adopted on February 15, 1965, is known as the Maple Leaf Flag.  Its design, featuring a red maple leaf on a white background, followed a period of debate and consideration of various designs.  The adoption marked a significant step in the nation's development of a distinct national identity.",
      "significance": "The flag symbolizes Canadian unity and pride, transcending regional and cultural differences.  It represents the nation's sovereignty and history, uniting Canadians under a common symbol.  The maple leaf itself holds deep cultural significance, representing strength, resilience, and the country's natural beauty.",
      "observance_details": "Traditionally, the day of adoption, February 15th, has seen flag-raising ceremonies and civic events.  Schools and government buildings prominently displayed the flag.  While not a widely celebrated public holiday, it is a day to reflect on Canadian identity.",
      "modern_celebration": "Modern celebrations are often low-key, with some communities holding flag-raising events or educational programs focused on the history of the flag.  Canadians may express patriotism by displaying the flag on their homes or businesses.  Online discussions and social media posts often commemorate the day.",
      "impact_and_legacy": "The adoption of the Maple Leaf Flag solidified a sense of national unity and identity for Canadians.  The flag's design has been widely adopted and is instantly recognizable globally as a symbol of Canada.  The flag has transcended partisan politics and remains a powerful symbol of national pride."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:41:18 UTC",
    "end_date": "01-07-25",
    "last_updated": "2025-01-04 12:41:14 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "National Day for Remembrance and Action on Violence Against Women",
    "start_date": "06-12-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "The National Day for Remembrance and Action on Violence Against Women in Canada originated in 1991, commemorating the 14 women murdered at l'École Polytechnique de Montréal in 1989.  The day was established to raise awareness and call for action to end gender-based violence.  It evolved from a grassroots movement to a nationally recognized day of remembrance.",
      "significance": "This day holds immense cultural and social significance in Canada, serving as a powerful reminder of the pervasive issue of violence against women. It fosters a crucial conversation around gender inequality, societal structures that perpetuate violence, and the need for collective responsibility in creating a safer society. The day provides a platform for mourning victims and advocating for change.",
      "observance_details": "Traditionally, the day involves vigils and memorial services to honor the victims of gender-based violence.  Many communities hold events focusing on education and awareness, featuring speakers and workshops focused on prevention.  Candlelight vigils are common, symbolizing remembrance and hope.",
      "modern_celebration": "Modern celebrations incorporate diverse initiatives, including online campaigns using social media hashtags, educational programs in schools and workplaces, and collaborations between community groups and government agencies.  Many organizations dedicate the day to fundraising for support services for survivors and advocacy groups working to prevent violence.  Public displays and statements by leaders reaffirm commitment to combating violence.",
      "impact_and_legacy": "The day has significantly raised awareness of violence against women in Canada, leading to increased funding for support services and shelters. It has influenced policy changes and legal reforms aimed at improving protection for women and girls.  Its legacy continues to inspire advocacy, activism, and ongoing efforts to achieve gender equality and end violence."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:41:22 UTC",
    "end_date": "06-12-24",
    "last_updated": "2025-01-04 12:41:18 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Pavarana Day",
    "start_date": "26-10-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Pavarana marks the end of the three-month Vassa retreat in Theravada Buddhism.  Originating in ancient India, it signifies the conclusion of a period of intense spiritual practice and reflection for monks and nuns.  This period of seclusion and study helped to maintain the integrity of the Buddhist teachings and monastic community.",
      "significance": "Pavarana is a crucial event in the Buddhist calendar, symbolizing the recommitment to ethical conduct and the strengthening of the Sangha (monastic community). It’s a time of confession and mutual forgiveness, emphasizing community harmony and spiritual growth. The day holds immense significance for both lay followers and monastic practitioners.",
      "observance_details": "Traditionally, the event involves a formal ceremony where monks confess any wrongdoings from the Vassa period. Senior monks then formally release the junior monks from the restrictions of the retreat.  This is followed by a period of sharing and communal reflection.",
      "modern_celebration": "Today, Pavarana is observed with varying degrees of formality in Buddhist communities worldwide.  Monasteries hold ceremonies, and lay followers often participate in special prayers, meditation sessions, and acts of charity. Many engage in communal meals and reflective practices.",
      "impact_and_legacy": "Pavarana reinforces the importance of self-reflection, ethical conduct, and community in Buddhist practice.  Its emphasis on confession and forgiveness has a lasting impact on individual spiritual development and fostering harmonious relationships.  The event continues to shape Buddhist values and practices globally."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-04 12:41:26 UTC",
    "end_date": "26-10-24",
    "last_updated": "2025-01-04 12:41:22 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Makar Sankranti",
    "start_date": "14-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Makar Sankranti marks the sun's transit into Makara (Capricorn), signifying the northward journey and the end of the winter solstice.  Its origins are ancient, rooted in Vedic traditions and associated with the harvest and the renewal of nature.",
      "significance": "It's a significant harvest festival celebrated across India and its diaspora, symbolizing prosperity, good fortune, and the triumph of light over darkness. The festival is deeply intertwined with agricultural cycles and spiritual renewal.",
      "observance_details": "Traditional observances include taking a holy dip in rivers, offering prayers to the sun god Surya, donating to the needy, and flying kites.  Specific rituals and customs vary regionally, reflecting diverse cultural practices.",
      "modern_celebration": "Modern celebrations often involve elaborate kite flying competitions, feasts with traditional sweets like til laddu and Undhiyu, and family gatherings.  The festival is also marked by vibrant street processions and cultural programs.",
      "impact_and_legacy": "Makar Sankranti reinforces community bonds and fosters social harmony through shared celebrations. Its enduring legacy lies in its ability to transcend regional differences, uniting people across India in a shared cultural experience."
    },
    "alternate_names": [],
    "category": "Hinduism",
    "created_at": "2025-01-04 12:41:29 UTC",
    "end_date": "14-01-25",
    "last_updated": "2025-01-04 12:41:26 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Ramanavami",
    "start_date": "10-04-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Ramanavami commemorates the birth of Lord Rama, the seventh avatar of Vishnu, in Hindu mythology.  The date is determined by the Hindu lunisolar calendar, falling in the month of Chaitra (March-April).  The epic Ramayana details Lord Rama's life, making this event central to the Hindu faith.",
      "significance": "Ramanavami holds immense religious significance for Hindus worldwide, symbolizing the triumph of good over evil and dharma over adharma.  It is a celebration of Lord Rama's ideals of righteousness, devotion, and selfless duty.  The festival reinforces the importance of moral values in society.",
      "observance_details": "Traditionally, Ramanavami is observed with chanting of hymns from the Ramayana, special prayers and pujas in temples dedicated to Lord Rama.  Fasting is common, and devotees often listen to or read the epic Ramayana.  Many visit temples and participate in processions.",
      "modern_celebration": "Modern celebrations involve grand processions with decorated chariots, devotional songs, and theatrical performances depicting scenes from the Ramayana.  Many communities organize religious discourses and cultural programs.  The day is often marked with community feasts and gatherings.",
      "impact_and_legacy": "Ramanavami fosters a sense of unity and devotion among Hindus.  It strengthens faith and promotes the ideals of righteousness and moral conduct exemplified by Lord Rama.  The festival's enduring legacy lies in its continued ability to inspire and uplift people across generations."
    },
    "alternate_names": [],
    "category": "Hinduism",
    "created_at": "2025-01-04 12:41:33 UTC",
    "end_date": "10-04-25",
    "last_updated": "2025-01-04 12:41:29 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Hola Mohalla",
    "start_date": "14-04-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Hola Mohalla, a vibrant Sikh festival, originated in the early 18th century in Anandpur Sahib, Punjab, India.  It was started by the tenth Sikh Guru, Gobind Singh, as a display of martial arts and religious fervor.  It is celebrated alongside the Hindu festival of Holi.",
      "significance": "Hola Mohalla signifies the strength and courage of the Khalsa, the Sikh warrior community. It emphasizes the importance of both spiritual discipline and physical prowess. The festival fosters a sense of community and brotherhood among Sikhs worldwide.",
      "observance_details": "Traditionally, Hola Mohalla involves mock battles (Gatka), religious processions (nagar kirtan), and displays of martial arts skills.  Sikhs gather to participate in religious discourses (katha) and kirtan (devotional singing).  The festival is marked by enthusiastic participation and a festive atmosphere.",
      "modern_celebration": "Today, Hola Mohalla continues to be a major event, attracting large crowds.  It combines traditional elements like Gatka and religious gatherings with modern celebrations.  The festival often includes cultural programs, exhibitions, and community meals (langar).",
      "impact_and_legacy": "Hola Mohalla has played a significant role in preserving Sikh identity and culture. It continues to foster a sense of community and religious pride among Sikhs.  The festival's emphasis on strength and faith remains a powerful symbol of Sikh heritage."
    },
    "alternate_names": [],
    "category": "Sikhism",
    "created_at": "2025-01-04 12:41:37 UTC",
    "end_date": "14-04-25",
    "last_updated": "2025-01-04 12:41:33 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Spring Ohigan",
    "start_date": "21-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Spring Ohigan, also known as the Spring Equinox Festival, has roots in ancient Japanese agricultural traditions and Buddhist practices.  It evolved from the vernal equinox celebrations and became integrated with Buddhist beliefs emphasizing ancestor veneration during this transitional time of year.",
      "significance": "Spring Ohigan is a significant time for family gatherings and honoring ancestors.  It represents a time for reflection, remembrance, and reaffirming family ties, bridging the gap between the living and the deceased.",
      "observance_details": "Traditionally, families visit ancestral graves to clean and offer flowers, food, and incense.  They perform Buddhist rituals and prayers at temples and homes, seeking blessings for the deceased and the living.  The three-day period is observed with special meals and mindful activities.",
      "modern_celebration": "While traditional practices persist, modern celebrations often incorporate elements of both Buddhist and secular traditions.  Families might visit graves, hold memorial services, or simply gather to remember loved ones.  The emphasis remains on respect, gratitude, and reflection.",
      "impact_and_legacy": "Spring Ohigan fosters a strong sense of family unity and filial piety in Japanese culture.  Its emphasis on remembering and honoring ancestors maintains connections across generations and reinforces community bonds.  The event's continued observance highlights the enduring importance of cultural traditions and spiritual practices."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-04 12:41:40 UTC",
    "end_date": "21-03-25",
    "last_updated": "2025-01-04 12:41:37 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Birth Date of Guru Nanak Dev Ji",
    "start_date": "15-11-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Guru Nanak Dev Ji's birth, celebrated annually as Gurpurab, marks the beginning of the Sikh faith. Born in 1469 in Talwandi, now Nankana Sahib in Pakistan, his teachings revolutionized spiritual thought in the Indian subcontinent.",
      "significance": "Gurpurab is the most significant festival in the Sikh calendar, commemorating the birth of the founder of Sikhism.  It reinforces the core principles of Sikhism, including equality, service, and devotion to God.",
      "observance_details": "Traditional celebrations include Akhand Path (continuous recitation of the Guru Granth Sahib), kirtan (devotional singing), and katha (religious discourse).  Langar (community kitchen) provides free meals to all.",
      "modern_celebration": "Modern celebrations involve large-scale processions (nagar kirtan), special prayers in Gurdwaras (Sikh temples), and community feasts.  Many Sikhs visit historical Gurdwaras associated with Guru Nanak's life.",
      "impact_and_legacy": "Guru Nanak's teachings continue to inspire millions worldwide, promoting interfaith harmony and social justice.  His emphasis on selfless service and equality has had a profound and lasting impact on the social fabric of the Indian subcontinent and beyond."
    },
    "alternate_names": [],
    "category": "Sikhism",
    "created_at": "2025-01-04 12:41:44 UTC",
    "end_date": "15-11-24",
    "last_updated": "2025-01-04 12:41:40 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Bandhi Chhor Divas",
    "start_date": "01-11-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Bandhi Chhor Divas, or the day of liberation from bondage, commemorates the release of Mahatma Gandhi from prison in 1944.  It marks a significant turning point in the Indian independence movement, boosting morale and inspiring further struggle. The event gained importance due to Gandhi's prominence and the context of the ongoing fight for freedom.",
      "significance": "The day holds immense cultural and social significance as a symbol of hope, freedom, and resilience.  It underscores the power of non-violent resistance and Gandhi's leadership in India's freedom struggle. It continues to be a reminder of the sacrifices made for independence.",
      "observance_details": "Traditionally, Bandhi Chhor Divas was observed with prayers, public meetings, and speeches highlighting Gandhi's philosophy and the importance of non-violent struggle.  People would express their joy and gratitude for Gandhi's release.  Many engaged in community service as a reflection of Gandhi's ideals.",
      "modern_celebration": "Modern celebrations often include prayer meetings, Gandhian speeches, and cultural programs focusing on his life and teachings.  Educational institutions organize events to educate the youth about the struggle for independence.  Many organizations undertake social service initiatives, embodying the spirit of the day.",
      "impact_and_legacy": "Bandhi Chhor Divas has left a lasting legacy by inspiring generations to fight for justice and freedom through peaceful means. It reinforces the importance of civil rights and liberties.  The day's significance continues to resonate in India and globally, reminding people of the power of non-violent resistance."
    },
    "alternate_names": [],
    "category": "Sikhism",
    "created_at": "2025-01-04 12:41:47 UTC",
    "end_date": "01-11-24",
    "last_updated": "2025-01-04 12:41:44 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Vasanta Panchami",
    "start_date": "22-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Vasanta Panchami, also known as Spring Panchami, is an ancient Hindu festival celebrating the arrival of spring and the goddess Saraswati, the deity of knowledge, music, arts, wisdom, and learning.  Its origins are rooted in Vedic traditions, with references found in ancient scriptures.",
      "significance": "The festival signifies the triumph of good over evil, the awakening of nature after winter, and the auspicious beginning of learning and creativity.  It's considered an auspicious day to start new ventures, especially education and artistic pursuits.",
      "observance_details": "Traditionally, Vasanta Panchami is observed by worshipping Goddess Saraswati with offerings of flowers, sweets, and books.  People wear yellow clothes, the color associated with the spring season and the goddess.  New educational ventures are often initiated on this day.",
      "modern_celebration": "Modern celebrations involve elaborate pujas (worship ceremonies) in temples and homes.  Schools and educational institutions often hold special events and functions.  The day is also marked by cultural programs showcasing music, dance, and art.",
      "impact_and_legacy": "Vasanta Panchami continues to be a widely celebrated festival, fostering a sense of community and cultural identity. Its emphasis on education and arts promotes learning and creativity.  The festival's enduring popularity showcases its relevance across generations."
    },
    "alternate_names": [],
    "category": "Hinduism",
    "created_at": "2025-01-04 12:41:51 UTC",
    "end_date": "22-01-25",
    "last_updated": "2025-01-04 12:41:47 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Mawlid al-Nabīy",
    "start_date": "29-09-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Mawlid al-Nabī (ميلاد النبي), meaning 'birth of the prophet', commemorates the birth of the Prophet Muhammad.  While the exact date of his birth is unknown, it's celebrated on the 12th of Rabi' al-Awwal in the Islamic lunar calendar.  The widespread celebration of Mawlid gained popularity centuries after Muhammad's death.",
      "significance": "Mawlid is a significant event for Muslims worldwide, serving as an occasion for religious reflection and community bonding.  It reinforces the teachings and example of the Prophet Muhammad, inspiring ethical behavior and strengthening faith.  The event promotes love and respect for the prophet and his legacy.",
      "observance_details": "Traditional observances include attending special prayers, reciting Quranic verses and prophetic narrations (ahadith), and listening to sermons about the Prophet's life.  Many communities organize gatherings with religious songs (Nasheeds), and the distribution of food and charity to the poor is common. Family and community celebrations are also important parts of the observance.",
      "modern_celebration": "Modern celebrations often incorporate larger-scale events like conferences, festivals, and public gatherings.  Many Islamic centers and mosques host Mawlid programs featuring religious lectures, poetry readings, and cultural performances.  The use of social media and digital platforms has also broadened the scope of celebrations and information sharing.",
      "impact_and_legacy": "Mawlid has had a lasting impact on Islamic culture, fostering a deeper understanding and appreciation of the Prophet's life and teachings.  The event promotes unity and solidarity among Muslims globally and reinforces core Islamic values.  It also contributes to the rich cultural tapestry of Muslim communities through diverse expressions of faith and tradition."
    },
    "alternate_names": [
      "Mawlid",
      "Milad un Nabi",
      "Prophet's Birthday"
    ],
    "category": "Islam",
    "created_at": "2025-01-04 12:41:55 UTC",
    "end_date": "29-09-24",
    "last_updated": "2025-01-04 12:42:22 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Labour Day",
    "start_date": "08-09-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Labour Day originated in the late 19th century from the labour movement's fight for workers' rights and shorter working hours.  Inspired by the Haymarket affair and earlier protests, it became a day to commemorate those struggles and advocate for improved working conditions.  Many countries adopted similar celebrations, reflecting a growing international awareness of workers' issues.",
      "significance": "Labour Day is a significant cultural event, symbolizing the achievements of the labour movement in securing better working conditions and social justice.  It underscores the importance of worker solidarity and collective bargaining.  The day serves as a reminder of the ongoing fight for fair wages, safe workplaces, and workers' rights.",
      "observance_details": "Traditionally, Labour Day involved parades and marches organized by labour unions, showcasing the strength and unity of the workforce.  Speeches and rallies highlighted workers' issues and celebrated past achievements.  Many workers also took the day off, enjoying time with family and friends.",
      "modern_celebration": "Modern Labour Day celebrations often include parades, picnics, barbecues, and family gatherings.  Many labour unions still organize events, but the focus might be more on community celebrations and family-oriented activities.  The day remains a public holiday in many countries, providing a break from work and an opportunity for relaxation.",
      "impact_and_legacy": "Labour Day has significantly impacted labour laws, working conditions, and social welfare programs worldwide.  Its legacy includes shorter work weeks, safer workplaces, and improved worker benefits.  It continues to inspire ongoing efforts to improve workers' rights and promote social and economic justice."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:41:59 UTC",
    "end_date": "08-09-24",
    "last_updated": "2025-01-04 12:41:55 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Midsummer",
    "start_date": "21-06-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Midsummer, also known as the summer solstice, has ancient roots in pagan celebrations marking the height of summer and the sun's power.  These traditions predate Christianity and are linked to festivals honoring various deities associated with fertility and the sun.  Many customs evolved over centuries, blending with Christian traditions in various regions.",
      "significance": "Midsummer holds deep cultural and social significance as a time of community, renewal, and celebration. It represents the peak of the harvest cycle, a time for joy and abundance. The longest day of the year is symbolic of hope, light, and the triumph of summer over winter.",
      "observance_details": "Traditional Midsummer celebrations often involved bonfires, symbolic of warding off evil spirits and cleansing.  Maypole dancing and flower crowns were common elements, representing fertility and the beauty of nature.  Celebrations frequently took place in open fields or forests, emphasizing the connection with the natural world.",
      "modern_celebration": "Modern Midsummer celebrations often retain elements of traditional practices, with bonfires and outdoor gatherings remaining popular.  Many incorporate music, dancing, and feasting, creating a festive atmosphere.  Some communities maintain older traditions like maypole dancing, while others adapt them to contemporary settings.",
      "impact_and_legacy": "Midsummer's impact on society is evident in its enduring popularity as a time for community bonding and celebration.  Its legacy continues through the retention of many traditional customs and their adaptation to modern lifestyles. The event's emphasis on nature and light contributes to a broader appreciation for the environment and seasonal cycles."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-04 12:42:03 UTC",
    "end_date": "21-06-25",
    "last_updated": "2025-01-04 12:41:59 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Laylat al-Mi'rāj",
    "start_date": "21-04-25",
    "additional_details": null,
    "alternate_names": [],
    "category": "Islam",
    "created_at": "2025-01-04 12:42:03 UTC",
    "end_date": "21-04-25",
    "last_updated": "2025-01-04 12:42:03 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Vassa",
    "start_date": "26-07-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Vassa, also known as the Rains Retreat, originated in ancient India as a three-month rainy season retreat for Buddhist monks.  This practice, dating back to the time of the Buddha, prevented monks from unintentionally damaging crops or disturbing wildlife while traveling during monsoon season.",
      "significance": "Vassa is a crucial period of spiritual reflection and intensive study for Buddhist monks. It's a time for community building and deepening of Buddhist practice, fostering a sense of unity and shared spiritual journey.",
      "observance_details": "Traditionally, monks resided in one place during Vassa, engaging in meditation, chanting, and studying Buddhist scriptures. Laypeople would offer alms and support to the monastic community, participating in ceremonies and religious activities.",
      "modern_celebration": "Modern celebrations vary across Buddhist traditions.  Monks still observe the retreat, while lay practitioners participate in temple ceremonies, give alms, and engage in meditation retreats.  Many events feature sermons, chanting, and community gatherings.",
      "impact_and_legacy": "Vassa has profoundly impacted Buddhist communities worldwide by reinforcing monastic discipline and strengthening the bond between monks and lay followers. Its enduring legacy lies in its contribution to spiritual development and the preservation of Buddhist teachings."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-04 12:42:07 UTC",
    "end_date": "26-07-25",
    "last_updated": "2025-01-04 12:42:03 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Navvarsha",
    "start_date": "29-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Navaratri, and by extension Navarasha, is an ancient Hindu festival with origins possibly tracing back to pre-vedic times.  It's associated with the victory of Goddess Durga over the demon Mahishasura, signifying the triumph of good over evil.  Various regional interpretations and legends contribute to its diverse celebrations across India.",
      "significance": "Navaratri, which culminates in Navarasha, is a significant period of spiritual reflection and devotion.  It symbolizes the divine feminine power and the victory of dharma (righteousness).  The festival's nine nights are dedicated to different forms of the Goddess, each representing different aspects of power and strength.",
      "observance_details": "Traditionally, Navaratri involves daily prayers, fasting, and offerings to the Goddess.  People create elaborate pandals (temporary shrines) and perform devotional dances like Garba and Dandiya Raas.  Fasting and chanting are common practices across nine days, building towards the final day's celebration.",
      "modern_celebration": "Modern celebrations retain traditional elements but are often more vibrant and community-oriented.  Garba and Dandiya Raas dances are performed in large gatherings, often with music and lights.  Families visit temples, exchange gifts, and enjoy festive meals.  Large-scale events are common, especially in Gujarat and Maharashtra.",
      "impact_and_legacy": "Navaratri's legacy lies in its enduring celebration of the divine feminine, promoting values of strength, courage, and devotion.  The festival fosters community bonding and strengthens social ties. Its vibrant cultural expressions, like the dances and songs, remain an integral part of Indian heritage and continue to adapt and evolve."
    },
    "alternate_names": [],
    "category": "Hinduism",
    "created_at": "2025-01-04 12:42:11 UTC",
    "end_date": "29-01-25",
    "last_updated": "2025-01-04 12:42:07 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Arbaeen",
    "start_date": "16-10-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Arbaeen marks the 40th day after the martyrdom of Imam Hussein, the grandson of Prophet Muhammad, at the Battle of Karbala in 680 CE.  It's a Shia Muslim tradition rooted in the Islamic belief in mourning and commemorating significant figures.  The event's commemoration has evolved over centuries.",
      "significance": "Arbaeen is a major pilgrimage for Shia Muslims, demonstrating their devotion and solidarity with Imam Hussein's sacrifice.  It symbolizes the fight against injustice and oppression, and is a powerful expression of faith and community. The event underscores the importance of remembering historical events and learning from them.",
      "observance_details": "Traditionally, Arbaeen involved mourning rituals, including reciting elegies (noha), self-flagellation (matam), and processions.  Families would visit the Imam Hussein Shrine in Karbala, Iraq.  The focus was on expressing grief and spiritual reflection.",
      "modern_celebration": "Millions of Shia Muslims from across the globe now participate in the Arbaeen pilgrimage to Karbala.  The event involves massive processions, religious gatherings, and acts of charity.  It's a significant display of communal faith and shared identity.",
      "impact_and_legacy": "Arbaeen has a profound impact on Shia communities globally, fostering unity and religious devotion.  The pilgrimage demonstrates the enduring power of faith and collective memory. The event's scale and global participation make it a powerful demonstration of religious fervor and social cohesion."
    },
    "alternate_names": [],
    "category": "Islam",
    "created_at": "2025-01-04 12:42:14 UTC",
    "end_date": "16-10-24",
    "last_updated": "2025-01-04 12:42:11 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Martyrdom of Guru Tegh Bahadur Ji",
    "start_date": "24-11-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "In 1675, Mughal Emperor Aurangzeb's oppressive policies targeting Hindus and their religious practices prompted Guru Tegh Bahadur, the ninth Sikh Guru, to intervene.  He offered himself as a sacrifice to protect Kashmiri Pandits facing forced conversions.  His martyrdom solidified his commitment to religious freedom and justice.",
      "significance": "Guru Tegh Bahadur's sacrifice stands as a profound symbol of courage and religious tolerance.  His martyrdom is a testament to the Sikh faith's commitment to defending the rights of the persecuted. It inspired countless individuals to uphold justice and religious freedom in the face of adversity.",
      "observance_details": "The martyrdom is commemorated annually on the day of his execution, often involving processions, prayers, and kirtan (devotional hymns) at Gurudwaras.  Special prayers and commemorative ceremonies are performed.  Akhand Paths (continuous recitation of the Guru Granth Sahib) are held.",
      "modern_celebration": "Large-scale gatherings and processions take place at Gurudwaras globally.  Many participate in religious services,  community meals (langar), and share stories of Guru Tegh Bahadur Ji's life and sacrifice.  Educational programs highlighting his teachings are also common.",
      "impact_and_legacy": "Guru Tegh Bahadur's sacrifice deeply influenced Sikh identity and the broader fight against religious intolerance.  His unwavering commitment to justice continues to inspire movements for religious freedom worldwide.  His legacy serves as a potent reminder of the importance of speaking out against oppression."
    },
    "alternate_names": [],
    "category": "Sikhism",
    "created_at": "2025-01-04 12:42:18 UTC",
    "end_date": "24-11-24",
    "last_updated": "2025-01-04 12:42:14 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Persons Day",
    "start_date": "16-02-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Persons Day, also known as International Persons Day, doesn't have a universally recognized historical origin or established date.  Various sources suggest it might be a localized or informal observance with roots in celebrating individuals and their contributions. There's no single founding event or individual associated with its creation.",
      "significance": "The significance lies in acknowledging the value and uniqueness of each person. It promotes respect for human dignity and fosters appreciation for individual differences and contributions to society. The concept highlights the interconnectedness of humanity and the importance of empathy.",
      "observance_details": "Traditional observance, if any, is highly variable and depends on the context. It could involve acts of kindness, community service, or personal reflection on one's impact on others.  Some might engage in self-care practices, focusing on personal well-being.",
      "modern_celebration": "Modern celebrations, if they exist, are likely informal and highly diverse.  They might involve social media campaigns promoting human rights and inclusivity, or small gatherings focused on personal connections and appreciating those around you.  The day is not widely promoted or commercially driven.",
      "impact_and_legacy": "The impact is mainly on individual perspectives, emphasizing self-worth and interpersonal relationships.  The potential legacy is a continued focus on human dignity and respect for diversity.  Its lack of widespread recognition limits its broader social impact."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-04 12:42:22 UTC",
    "end_date": "16-02-25",
    "last_updated": "2025-01-04 12:42:18 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Nirvana Day",
    "start_date": "08-12-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Nirvana Day commemorates the death of Siddhartha Gautama, who attained enlightenment and became the Buddha.  It marks the transition from earthly existence to Nirvana, a state of liberation. The exact date varies slightly among Buddhist traditions.",
      "significance": "It's a significant day of reflection and remembrance for Buddhists worldwide, highlighting the path to enlightenment and liberation from suffering.  It underscores the core Buddhist teachings of compassion, mindfulness, and the impermanence of life.",
      "observance_details": "Traditionally, Nirvana Day involves meditation, chanting, and attending special services at Buddhist temples.  Monks and lay practitioners engage in acts of devotion and charity.  Many spend the day in quiet contemplation.",
      "modern_celebration": "Modern celebrations often include public lectures, meditation retreats, and community events focused on Buddhist principles.  Many Buddhists participate in ceremonies and offer prayers for peace and enlightenment.  Online resources and virtual events have also become common.",
      "impact_and_legacy": "Nirvana Day reinforces the Buddhist message of peace and compassion, influencing ethical behavior and social harmony.  It continues to inspire individuals to seek spiritual growth and work towards reducing suffering.  The day's legacy lies in its promotion of mindfulness and personal transformation."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-04 12:42:25 UTC",
    "end_date": "08-12-24",
    "last_updated": "2025-01-04 12:42:22 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Birth Date of the Aga Khan",
    "start_date": "13-12-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "The birth date of the Aga Khan, the Imam of the Shia Ismaili Muslims, marks the succession of a hereditary spiritual leader within a lineage tracing back to the Prophet Muhammad's cousin and son-in-law, Ali.  Each Aga Khan's birth is a significant event within the Ismaili community, signifying the continuation of their spiritual guidance. The current Aga Khan, Shah Karim al-Husayni, is the 49th Imam.",
      "significance": "The Aga Khan's birth is a day of profound spiritual significance for Ismailis worldwide. It signifies the continuation of a lineage of spiritual leadership and provides a focal point for faith and community cohesion.  The event underscores the importance of the Imam's role in guiding the spiritual and temporal lives of Ismailis.",
      "observance_details": "Traditionally, the birth of an Aga Khan is celebrated through prayers, readings from Islamic scripture, and expressions of gratitude for the Imam's guidance.  Special religious ceremonies and gatherings are often held in mosques and community centers. Family and friends exchange greetings and partake in celebratory meals.",
      "modern_celebration": "In modern times, the celebrations incorporate a blend of traditional practices and contemporary expressions of faith and joy.  Many Ismailis use social media to express their felicitations, while community organizations often organize larger events combining religious observances with community gatherings and charitable activities.",
      "impact_and_legacy": "The Aga Khan's birth and subsequent leadership have had a profound impact on the Ismaili community and beyond.  The Aga Khan's focus on social development, education, and pluralism continues to inspire positive change globally, leaving a lasting legacy of service and human betterment."
    },
    "alternate_names": [],
    "category": "Islam",
    "created_at": "2025-01-04 12:42:29 UTC",
    "end_date": "13-12-24",
    "last_updated": "2025-01-04 12:42:25 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  }
]