[
  {
    "name": "Canada Day",
    "start_date": "01-07-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Canada Day commemorates the July 1, 1867, enactment of the Constitution Act, 1867, which united three British North American colonies into a single federation called Canada.  This act established Canada as a self-governing dominion within the British Empire, marking a significant step towards national identity.",
      "significance": "Canada Day is a powerful symbol of national unity, pride, and shared identity for Canadians. It's a day to celebrate the country's diverse cultures, heritage, and achievements, fostering a sense of belonging and patriotism.",
      "observance_details": "Traditionally, Canada Day involved parades, picnics, and community gatherings.  Citizens displayed national flags and symbols, attending church services or commemorative ceremonies.  Many individuals reflected on Canada's history and progress.",
      "modern_celebration": "Modern celebrations are vibrant and diverse, encompassing large-scale festivals, fireworks displays, concerts, and cultural events across the country.  Communities host local events, while many Canadians enjoy time with family and friends, engaging in outdoor activities.",
      "impact_and_legacy": "Canada Day has solidified a shared national identity, fostering a sense of belonging amongst Canadians from diverse backgrounds. Its enduring legacy lies in its ability to unite the nation in celebration and reflection, promoting civic pride and national unity."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-07 18:55:18 UTC",
    "end_date": "01-07-25",
    "last_updated": "2025-01-07 18:58:00 UTC",
    "source_urls": [
      "https://www.ontario.ca/page/ontarios-celebrations-and-commemorations",
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Remembrance Day",
    "start_date": "05-11-25",
    "additional_details": "On Remembrance Day (November 11) and Remembrance Day and Veterans’ week (November 5 to 11), we pay tribute to the men and women of all backgrounds who have served and continue to serve our country during times of war, conflict and peace.",
    "additional_information": {
      "historical_background": "Remembrance Day originated in the aftermath of World War I to commemorate the armistice signed on November 11, 1918, ending hostilities on the Western Front.  Initially known as Armistice Day, it evolved into a broader commemoration of all those who died in war.",
      "significance": "Remembrance Day holds immense cultural and social significance as a time for reflection, remembrance, and honoring the sacrifices made by military personnel. It serves as a powerful symbol of peace and reconciliation, fostering unity and understanding across nations.",
      "observance_details": "Traditionally observed with a two-minute silence at 11:00 am on November 11th, the event often includes wreath-laying ceremonies at war memorials and cenotaphs.  Poppies, a symbol of remembrance, are worn, and services are held to honor the fallen.",
      "modern_celebration": "Modern celebrations continue to feature the two-minute silence and poppy distribution.  Educational programs and community events are increasingly common, aiming to educate younger generations about the significance of the day and its historical context. Many countries hold parades and other public commemorations.",
      "impact_and_legacy": "Remembrance Day has had a profound impact on societal attitudes towards war and remembrance. It fosters a shared national identity and promotes a culture of respecting those who served their countries. The day's legacy ensures that the sacrifices made are never forgotten."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-07 18:55:22 UTC",
    "end_date": "11-11-25",
    "last_updated": "2025-01-07 18:55:18 UTC",
    "source_urls": [
      "https://www.ontario.ca/page/ontarios-celebrations-and-commemorations"
    ]
  },
  {
    "name": "Family Day",
    "start_date": "17-02-26",
    "additional_details": "",
    "additional_information": {
      "historical_background": "Family Day's origins are diverse, with no single global origin.  Many countries have adopted variations, often tied to existing holidays or specific historical events promoting family values.  The emphasis on family unity has roots in various cultural traditions across the globe.",
      "significance": "Family Day underscores the importance of family bonds and togetherness in society.  It promotes stronger family relationships and reinforces the role of the family unit in individual and societal well-being.  The event highlights the need for nurturing and supporting families.",
      "observance_details": "Traditionally, Family Day involved family gatherings, meals, and shared activities.  Many communities organized special events or festivals focused on family participation.  The specific activities varied depending on cultural practices and local traditions.",
      "modern_celebration": "Modern celebrations often include family outings, picnics, and recreational activities.  Many families utilize technology to connect with extended family members, regardless of geographic location.  The emphasis remains on spending quality time together.",
      "impact_and_legacy": "Family Day's impact lies in its promotion of family values and strengthening community ties.  It reinforces the importance of intergenerational connections and supports a sense of belonging.  The event contributes to the overall well-being of individuals and society as a whole."
    },
    "alternate_names": [
      "Ontario Family Day",
      "Provincial Family Day"
    ],
    "category": "Additional Observances",
    "created_at": "2025-01-07 18:55:25 UTC",
    "end_date": "17-02-26",
    "last_updated": "2025-01-07 18:55:22 UTC",
    "source_urls": [
      "https://www.ontario.ca/page/ontarios-celebrations-and-commemorations"
    ]
  },
  {
    "name": "Emancipation Day",
    "start_date": "01-08-26",
    "additional_details": "",
    "additional_information": {
      "historical_background": "Emancipation Day commemorates the abolition of slavery.  In various countries, it marks different dates reflecting the specific legal or de facto end of slavery.  The significance varies regionally, reflecting unique historical contexts and struggles for freedom.",
      "significance": "Emancipation Day is a powerful symbol of freedom and justice, representing the triumph over oppression and the ongoing fight for equality. It serves as a reminder of the injustices of slavery and the importance of continuing to work towards racial justice and equity.",
      "observance_details": "Traditional observances varied greatly depending on location and community.  Many involved religious services, speeches, and gatherings to reflect on the past and celebrate freedom.  Family reunions and community events were also common.",
      "modern_celebration": "Modern celebrations often include parades, festivals, educational programs, and commemorative speeches.  Many communities organize events focused on education, cultural expression, and advocacy for social justice, building upon the historical significance.",
      "impact_and_legacy": "Emancipation Day's impact continues to inspire movements for social justice and equality.  It serves as a constant reminder of the need to confront systemic racism and discrimination, fostering ongoing conversations about historical trauma and its lasting consequences."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-07 18:55:29 UTC",
    "end_date": "01-08-26",
    "last_updated": "2025-01-07 18:55:25 UTC",
    "source_urls": [
      "https://www.ontario.ca/page/ontarios-celebrations-and-commemorations"
    ]
  },
  {
    "name": "Mawlid al-Nabīy",
    "start_date": "28-09-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Mawlid al-Nabi, or the Prophet's Birthday, is an observance celebrating the birth of the Islamic prophet Muhammad.  Its origins are debated, with some tracing it to early Sufi traditions, while others link it to later historical developments. The exact date of Muhammad's birth is unknown, leading to varying celebration dates among different communities.",
      "significance": "The event holds immense religious and cultural significance for Muslims worldwide. It's a time for reflection on Muhammad's life and teachings, reinforcing Islamic values and promoting unity within the community.  The celebration fosters a sense of spiritual renewal and shared faith.",
      "observance_details": "Traditionally, Mawlid involves special prayers (salat), recitations from the Quran, and the telling of stories (seerah) about the Prophet's life.  Many communities hold processions, gatherings, and feasts, emphasizing community bonds and charitable acts.  Religious scholars often deliver lectures on Islamic teachings and the life of the Prophet.",
      "modern_celebration": "Modern celebrations often incorporate diverse cultural expressions, with different regions exhibiting unique traditions and practices.  Public gatherings, including lectures, poetry readings, and musical performances, are common. Many participate in community service projects and acts of charity in the spirit of the Prophet's teachings.",
      "impact_and_legacy": "Mawlid has fostered a stronger sense of community and religious identity among Muslims.  It's helped transmit the Prophet's life and teachings across generations, inspiring ethical behavior and social responsibility. The event's enduring legacy lies in its continuous role in reinforcing Islamic values and promoting communal solidarity."
    },
    "alternate_names": [
      "Mawlid",
      "Milad un Nabi",
      "Prophet's Birthday"
    ],
    "category": "Islam",
    "created_at": "2025-01-07 18:55:59 UTC",
    "end_date": "28-09-25",
    "last_updated": "2025-01-07 18:59:15 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Ramadan",
    "start_date": "01-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Ramadan is an Islamic holy month, observed by Muslims worldwide as a time of fasting, prayer, reflection, and community.  It commemorates the first revelation of the Quran to the Prophet Muhammad. Its timing is based on the lunar Islamic calendar.",
      "significance": "Ramadan holds immense spiritual significance, fostering piety and self-discipline through fasting.  It strengthens community bonds through shared experiences and increased charitable giving. It's a time for personal growth and increased connection with God.",
      "observance_details": "Observant Muslims abstain from food and drink from dawn till dusk during Ramadan.  They increase their prayers, recite the Quran, and engage in acts of charity.  The month culminates in Eid al-Fitr, a joyous celebration marking the end of the fast.",
      "modern_celebration": "Modern celebrations include communal iftars (breaking of the fast), special prayers, increased religious study, and family gatherings.  Many communities organize charitable events and initiatives to support the needy.  Online platforms also facilitate community engagement and sharing of religious content.",
      "impact_and_legacy": "Ramadan has profoundly impacted Islamic culture and society, shaping ethical values and promoting social justice. Its emphasis on self-reflection and compassion fosters personal growth and strengthens community ties across generations.  The legacy of Ramadan continues to inspire acts of kindness and generosity worldwide."
    },
    "alternate_names": [
      "Ramazan",
      "Ramzan",
      "Month of Fasting"
    ],
    "category": "Islam",
    "created_at": "2025-01-07 18:56:03 UTC",
    "end_date": "30-03-25",
    "last_updated": "2025-01-07 19:00:20 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Lunar New Year",
    "start_date": "29-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Lunar New Year, also known as the Spring Festival, originated in China thousands of years ago, possibly stemming from ancient agricultural celebrations and ancestor veneration.  It's associated with a mythical beast, Nian, whose expulsion is celebrated with loud noises and bright colors.",
      "significance": "The festival is deeply significant for many East and Southeast Asian communities, symbolizing new beginnings, family reunion, and good fortune for the coming year.  It's a time for reflection, renewal, and strengthening family bonds.",
      "observance_details": "Traditional observances include cleaning houses to sweep away bad luck, decorating with red lanterns and paper cuttings, offering prayers to ancestors, and sharing elaborate feasts with family.  Lion and dragon dances are common performances to ward off evil spirits.",
      "modern_celebration": "Modern celebrations incorporate many traditional elements but also include fireworks displays, parades, temple visits, and gift-giving.  Many families travel long distances to reunite, and various cultural performances are enjoyed by communities.",
      "impact_and_legacy": "Lunar New Year's impact is seen globally through its influence on cuisine, art, literature, and cultural exchange. Its enduring legacy is the fostering of family unity, cultural preservation, and the spreading of joy and hope at the start of a new year."
    },
    "alternate_names": [
      "Chinese New Year",
      "Spring Festival",
      "Tết"
    ],
    "category": "Buddhism",
    "created_at": "2025-01-07 18:56:06 UTC",
    "end_date": "29-01-25",
    "last_updated": "2025-01-07 19:00:51 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Spring Ohigan",
    "start_date": "20-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Spring Ohigan, also known as the Spring Equinox Festival, is a Buddhist holiday originating in Japan.  It's rooted in ancient traditions honoring ancestors and has evolved over centuries, incorporating elements of both Buddhism and Shinto beliefs.",
      "significance": "Spring Ohigan is a time for remembering and honoring deceased loved ones, reflecting on the cycle of life and death.  It emphasizes family bonds and promotes reflection on spiritual matters, fostering community and peace.",
      "observance_details": "Traditionally, families visit ancestral graves to clean and offer flowers and food.  They also attend special Buddhist services at temples, reciting sutras and prayers for the deceased.  Many people observe a period of quiet reflection and abstain from certain foods.",
      "modern_celebration": "While traditional practices persist, modern celebrations often blend religious observance with family gatherings.  People might visit gravesites, but also participate in picnics or other activities honoring loved ones' memories.  Temples often adapt services to accommodate modern sensibilities.",
      "impact_and_legacy": "Spring Ohigan reinforces the importance of ancestral reverence in Japanese culture and fosters strong family ties.  Its focus on remembrance and reflection contributes to a sense of continuity across generations and promotes peaceful coexistence with the natural world."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-07 18:56:10 UTC",
    "end_date": "20-03-25",
    "last_updated": "2025-01-07 18:56:06 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "ʻĪd al-Fiṭr",
    "start_date": "30-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Eid al-Fitr marks the end of Ramadan, the Islamic holy month of fasting.  It commemorates the completion of this spiritual journey and the breaking of the fast.  The Prophet Muhammad established the celebration as a day of thanksgiving and joy.",
      "significance": "Eid al-Fitr is a time for communal celebration, reinforcing bonds of family and community.  It emphasizes gratitude for Allah's blessings and promotes acts of charity and generosity.  The festival signifies spiritual renewal and a fresh start.",
      "observance_details": "The day begins with early morning prayers (Salat al-Eid) followed by festive meals shared with family.  Zakat al-Fitr, a charitable donation of food to the needy, is given before prayers.  The day is characterized by visiting friends and relatives, exchanging gifts, and enjoying traditional meals.",
      "modern_celebration": "Modern celebrations often include large gatherings, family outings, and new clothes.  Many Muslims attend Eid prayers at mosques or outdoor venues, followed by feasts and celebrations.  The festivities often involve decorating homes and attending social events.",
      "impact_and_legacy": "Eid al-Fitr fosters social cohesion and strengthens community ties among Muslims globally.  Its emphasis on charity and generosity contributes to social welfare.  The festival's enduring legacy lies in its ability to renew faith and promote compassion."
    },
    "alternate_names": [
      "Eid ul-Fitr",
      "Eid al-Fitr",
      "Ramadan Eid",
      "Lesser Eid"
    ],
    "category": "Islam",
    "created_at": "2025-01-07 18:56:13 UTC",
    "end_date": "31-03-25",
    "last_updated": "2025-01-07 19:00:58 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Vassa",
    "start_date": "19-07-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Vassa, also known as the Rains Retreat, originated in ancient India as a period of seclusion for Buddhist monks during the monsoon season.  This practice, dating back to the time of the Buddha, prevented monks from unintentionally damaging crops or disrupting village life while traveling.",
      "significance": "Vassa is a crucial time for spiritual reflection and intensive meditation for Buddhist practitioners. It represents a period of intense self-discipline and community building within the Sangha (monastic community).  The event reinforces core Buddhist values of mindfulness, compassion, and community.",
      "observance_details": "Traditionally, monks reside in one place for three lunar months during Vassa, engaging in study, meditation, and community service. Laypeople offer alms and support to the monks, participating in merit-making activities.  The period concludes with a ceremony celebrating the end of the retreat.",
      "modern_celebration": "Modern celebrations vary across Buddhist traditions, but often include special lectures, meditation retreats, and community gatherings. Laypeople actively participate through offerings, attending ceremonies, and engaging in acts of generosity and kindness.  Many incorporate traditional rituals alongside contemporary practices.",
      "impact_and_legacy": "Vassa reinforces the importance of mindful living and spiritual growth within Buddhist communities.  Its emphasis on self-reflection and community strengthens social cohesion. The legacy of Vassa continues to shape Buddhist practice globally, fostering a sense of unity and shared purpose."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-07 18:56:17 UTC",
    "end_date": "19-07-25",
    "last_updated": "2025-01-07 18:56:13 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Installation of the Sri Guru Granth Sahib Ji",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "The installation of the Sri Guru Granth Sahib Ji, the holy scripture of Sikhism, marks the culmination of the Sikh Gurus' teachings.  The final Guru, Gobind Singh Ji, designated the Adi Granth as the eternal Guru, establishing its central role in Sikh faith and practice.  This act formalized the scripture's authority and established a unique form of religious leadership.",
      "significance": "The installation signifies the transition from personal gurus to a living Guru in the form of the scripture. It represents the embodiment of divine wisdom and guidance for Sikhs globally. The event is a cornerstone of Sikh identity and underscores the importance of scripture in their religious life.",
      "observance_details": "Traditionally, the installation involves elaborate ceremonies led by experienced Sikh priests (Granthis).  The Granth Sahib is placed on a raised platform (Takht) in a designated Gurdwara (temple), and prayers and hymns are chanted. The event is marked by deep reverence and piety.",
      "modern_celebration": "Modern celebrations often involve large congregations and community participation.  The event is often accompanied by devotional singing (kirtan), speeches, and community meals (langar).  Many Gurdwaras may organize special events leading up to or around the installation anniversary.",
      "impact_and_legacy": "The installation established the Sri Guru Granth Sahib Ji as the central figure in Sikh worship and practice, shaping Sikh theology and identity.  Its authority provides a unifying force for the diverse Sikh community and ensures the continued relevance of Guru's teachings for generations to come. The event continues to inspire spiritual devotion and social harmony."
    },
    "alternate_names": [],
    "category": "Sikhism",
    "created_at": "2025-01-07 18:56:21 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:56:17 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Birth Date of Guru Gobind Singh Ji",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Guru Gobind Singh Ji, the tenth and final Sikh Guru, was born on December 22, 1666, in Patna, Bihar, India.  His birth is celebrated as a momentous occasion in Sikh history, marking the culmination of the Gurus' lineage and the establishment of the Khalsa Panth.",
      "significance": "Guru Gobind Singh Ji's birth is profoundly significant as it represents the birth of a spiritual leader who championed human rights and equality. His teachings and actions continue to inspire millions worldwide, fostering courage, justice, and selfless service.",
      "observance_details": "Traditionally, the birth anniversary is marked with prayers, kirtan (devotional singing), and katha (religious discourse) in Gurdwaras (Sikh temples).  Langar (community kitchen) provides free meals to all attendees, symbolizing equality and brotherhood.",
      "modern_celebration": "Modern celebrations often involve processions, Nagar Kirtan (religious processions), and community gatherings.  Many Gurdwaras host special events, including akhand path (continuous recitation of the Guru Granth Sahib), to commemorate the day.",
      "impact_and_legacy": "Guru Gobind Singh Ji's legacy extends to the establishment of the Khalsa, a community dedicated to upholding righteousness and defending the weak.  His emphasis on courage, selflessness, and dedication to truth continue to shape Sikh identity and inspire social justice movements."
    },
    "alternate_names": [],
    "category": "Sikhism",
    "created_at": "2025-01-07 18:56:25 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:56:21 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Mahashivaratri",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Mahashivaratri, meaning 'The Great Night of Shiva', is an ancient Hindu festival celebrating the union of Shiva and Shakti.  Its origins are debated, with some linking it to the cosmic dance of Shiva, while others associate it with the night Shiva consumed the poison Halahala.",
      "significance": "The festival signifies spiritual awakening and the triumph of good over evil.  It's a time for devotees to deepen their connection with Shiva, seeking his blessings and liberation from the cycle of birth and death.",
      "observance_details": "Traditionally, devotees observe a strict fast, engage in intense prayer and meditation throughout the night, and perform puja (worship) rituals.  They often stay awake all night chanting mantras and singing devotional songs.",
      "modern_celebration": "Modern celebrations include large-scale gatherings at temples, with special aartis (ceremonial worship) and processions.  Many people participate in community prayers and undertake pilgrimages to significant Shiva temples.",
      "impact_and_legacy": "Mahashivaratri fosters a sense of unity and devotion among Hindus worldwide.  Its enduring legacy is seen in the continued reverence for Shiva and the preservation of ancient traditions through generations."
    },
    "alternate_names": [
      "Maha Shivaratri",
      "Great Night of Shiva"
    ],
    "category": "Hinduism",
    "created_at": "2025-01-07 18:56:28 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 19:00:51 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Bandhi Chhor Divas",
    "start_date": "01-11-24",
    "additional_details": "a celebratory day in the Sikh community",
    "additional_information": {
      "historical_background": "Bandhi Chhor Divas, or the Day of Liberation, commemorates the release of Mahatma Gandhi from prison on May 6, 1938.  This release followed his arrest during the Satyagraha movement against the British Raj.  The event marked a significant moment in the Indian independence struggle.",
      "significance": "The day holds immense cultural and social significance as a symbol of hope and resilience during the fight for freedom.  It's a reminder of Gandhi's unwavering commitment to non-violent resistance.  The event serves as a powerful reminder of the importance of peaceful struggle for justice.",
      "observance_details": "Traditionally, Bandhi Chhor Divas involved prayers, public meetings, and speeches emphasizing Gandhian ideals of truth and non-violence.  Celebrations often incorporated singing of patriotic songs and recalling the struggles of the freedom movement.  People also engaged in community service and acts of kindness.",
      "modern_celebration": "Modern celebrations often involve rallies, speeches, and seminars focused on Gandhi's philosophy and its relevance to contemporary issues.  Educational institutions organize events highlighting his contributions.  Gandhi's teachings on peace and non-violence are often emphasized during these commemorations.",
      "impact_and_legacy": "Bandhi Chhor Divas reinforces the importance of peaceful resistance and social justice.  It continues to inspire activists and leaders working towards positive social change. The event's legacy lies in its enduring message of hope and the power of non-violent methods in achieving freedom and justice."
    },
    "alternate_names": [],
    "category": "Sikhism",
    "created_at": "2025-01-07 18:56:32 UTC",
    "end_date": "01-11-24",
    "last_updated": "2025-01-07 18:56:28 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Nowruz",
    "start_date": "21-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Nowruz, meaning \"new day\", is an ancient Persian festival marking the beginning of spring and the new year.  Its origins trace back over 3000 years to the ancient Persian empire, evolving through various empires and cultures.  It's considered one of the oldest continuing traditions globally.",
      "significance": "Nowruz symbolizes renewal, rebirth, and the triumph of good over evil.  It's a time for family gatherings, reconciliation, and expressing hope for the future.  The festival reinforces cultural identity and heritage across diverse communities.",
      "observance_details": "Traditional observances include the Haft-Seen table, a symbolic arrangement of seven items beginning with the letter 'S' in Persian.  Families clean their homes, prepare special foods, and engage in festive activities.  Visiting family and friends is a central part of the celebrations.",
      "modern_celebration": "Modern celebrations incorporate elements of both ancient traditions and contemporary cultural expressions.  Many countries with significant Persian populations hold parades, concerts, and public events.  The use of social media has expanded the global reach and visibility of Nowruz.",
      "impact_and_legacy": "Nowruz's enduring legacy lies in its ability to transcend geographical and political boundaries, uniting people of diverse backgrounds.  It fosters cross-cultural understanding and respect for ancient traditions.  Its continued observance demonstrates the resilience of cultural heritage and the importance of shared celebrations."
    },
    "alternate_names": [
      "Norooz",
      "Persian New Year",
      "Iranian New Year"
    ],
    "category": "Additional Observances",
    "created_at": "2025-01-07 18:56:35 UTC",
    "end_date": "21-03-25",
    "last_updated": "2025-01-07 19:01:14 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Makar Sankranti",
    "start_date": "14-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Makar Sankranti marks the transition of the Sun into Makara (Capricorn) in the Hindu solar calendar.  Its origins are ancient, linked to the agricultural cycle and the sun's northward journey signifying the end of winter and the start of longer days.  The festival has been celebrated for centuries, with its roots deeply embedded in Vedic traditions.",
      "significance": "It's a harvest festival celebrated across India with regional variations.  Makar Sankranti signifies the victory of light over darkness and good over evil, symbolizing new beginnings and prosperity.  The festival holds spiritual and astronomical significance, marking an auspicious time for prayers and rituals.",
      "observance_details": "Traditionally, people take holy dips in rivers, offer prayers to the Sun God Surya, and perform special pujas.  Kite flying is a popular custom, representing the release of negativity and welcoming the new year.  Sharing sweets and traditional foods with family and friends is central to the celebrations.",
      "modern_celebration": "Modern celebrations involve large-scale kite flying competitions, vibrant cultural events, and family gatherings.  Social media plays a significant role, with people sharing photos and greetings online.  The festival also sees a surge in tourism, with people traveling to different regions to participate in local traditions.",
      "impact_and_legacy": "Makar Sankranti reinforces social bonding and strengthens family ties through shared festivities.  The festival's agricultural connections highlight the importance of nature and its cycles.  Its enduring popularity ensures the continuation of ancient traditions and cultural heritage across generations."
    },
    "alternate_names": [],
    "category": "Hinduism",
    "created_at": "2025-01-07 18:56:39 UTC",
    "end_date": "14-01-25",
    "last_updated": "2025-01-07 18:56:35 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Family Day",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Family Day, while not having a single, universally agreed-upon origin, emerged from various movements emphasizing family values and strengthening family bonds throughout the 20th century.  Many countries adopted variations independently, often tied to specific social or political contexts.  The specific dates and traditions vary widely based on location and culture.",
      "significance": "Family Day highlights the importance of family as the fundamental unit of society. It promotes unity, love, and togetherness within families, strengthening social structures and transmitting cultural values across generations. The event underscores the role of family in personal well-being and societal stability.",
      "observance_details": "Traditional observances often include family gatherings, meals, and activities shared by family members.  These might involve visits to relatives, special family outings, or participation in community events related to family.  Religious or cultural elements are often incorporated, depending on the family's traditions.",
      "modern_celebration": "Modern celebrations maintain the focus on family togetherness, often incorporating contemporary activities like family games, movie nights, or vacations.  Social media plays a role, with families sharing photos and stories of their celebrations. Many families also use the day for volunteering or acts of service, expanding the focus beyond individual families.",
      "impact_and_legacy": "Family Day fosters stronger family ties and promotes a sense of belonging. It raises awareness about the challenges facing families and encourages support networks.  Its enduring legacy lies in its continued emphasis on the fundamental importance of family in a constantly changing world."
    },
    "alternate_names": [
      "Ontario Family Day",
      "Provincial Family Day"
    ],
    "category": "Additional Observances",
    "created_at": "2025-01-07 18:56:43 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 19:00:16 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Holi",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Holi's origins are rooted in ancient Hindu mythology, possibly linked to the legend of Holika and Prahlad, symbolizing the triumph of good over evil.  It's also associated with the arrival of spring and the harvest season, signifying renewal and fertility.",
      "significance": "Holi is a vibrant celebration of love, joy, and the victory of good over evil. It fosters a sense of community and strengthens social bonds, bridging societal divides and promoting forgiveness.",
      "observance_details": "Traditionally, Holi involves two days: Holika Dahan, where bonfires are lit to symbolize the burning of evil, and Rangwali Holi, characterized by the playful throwing of colored powders and water.",
      "modern_celebration": "Modern celebrations often include elaborate processions, music, dancing, and feasting.  The use of eco-friendly colors and water conservation methods are increasingly emphasized, while the core spirit of joy and camaraderie remains central.",
      "impact_and_legacy": "Holi's enduring legacy lies in its ability to transcend geographical and social boundaries, promoting unity and celebrating the diversity of human experience. Its vibrant colors and joyful spirit continue to captivate people worldwide."
    },
    "alternate_names": [],
    "category": "Hinduism",
    "created_at": "2025-01-07 18:56:46 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:56:43 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Vasanta Panchami",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Vasanta Panchami, also known as Spring Panchami, is an ancient Hindu festival celebrating the arrival of spring and the goddess Saraswati, the deity of knowledge, music, arts, wisdom, and learning. Its origins are rooted in ancient Vedic traditions and are mentioned in various scriptures.",
      "significance": "The festival signifies the triumph of good over evil, the awakening of nature, and the beginning of a new phase of learning and creativity. It is considered an auspicious day to begin new ventures, especially those related to education and the arts.",
      "observance_details": "Traditionally, Vasanta Panchami is observed by worshipping Goddess Saraswati with offerings of flowers, sweets, and incense. People wear yellow clothes, signifying the color of spring, and participate in prayers and devotional songs.  Students often seek blessings for academic success.",
      "modern_celebration": "Modern celebrations involve similar rituals, but with added elements like cultural programs, music recitals, and feasts. Schools and educational institutions often organize special events to mark the occasion.  The festival is also celebrated with greater enthusiasm and participation through community gatherings.",
      "impact_and_legacy": "Vasanta Panchami's impact is evident in its continued widespread celebration, fostering a sense of community and cultural unity. Its emphasis on learning and creativity has left a lasting legacy on education and the arts across generations. The festival's vibrant traditions continue to inspire and enrich lives."
    },
    "alternate_names": [],
    "category": "Hinduism",
    "created_at": "2025-01-07 18:56:50 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:56:46 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Birth Date of the Aga Khan",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "The birth date of the Aga Khan marks the succession within the Ismaili Shia Muslim community.  The Aga Khan is the hereditary Imam (spiritual leader), and each new Imam's birth is a significant event in Ismaili history, tracing back centuries to the Prophet Muhammad.  The lineage ensures continuity of religious and community leadership.",
      "significance": "The birth of the Aga Khan is a time of celebration and renewal for Ismailis worldwide.  It signifies the continued spiritual guidance and leadership provided by the Imam, and underscores the importance of faith and community unity. The event fosters a sense of collective identity and shared purpose among Ismailis.",
      "observance_details": "Traditionally, the birth of the Aga Khan is marked with prayers, religious ceremonies, and community gatherings.  Many Ismailis participate in special prayers and devotional acts.  The event is an opportunity to reaffirm faith and strengthen bonds within the community.",
      "modern_celebration": "In modern times, celebrations often include community events, gatherings, and charitable initiatives.  Many Ismailis express their joy and loyalty through acts of service and contributions to projects aligning with the Aga Khan's philanthropic endeavors.  Online platforms also play a role in connecting communities globally.",
      "impact_and_legacy": "The Aga Khan's leadership has had a significant global impact through his work in promoting education, development, and pluralism.  His commitment to social justice and community development extends far beyond religious boundaries.  The celebration of his birth reinforces his legacy and the values he represents."
    },
    "alternate_names": [],
    "category": "Islam",
    "created_at": "2025-01-07 18:56:54 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:56:50 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Islamic New Year",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "The Islamic New Year, Muharram, marks the beginning of the Islamic lunar calendar.  It commemorates the hijra, the migration of the Prophet Muhammad from Mecca to Medina in 622 CE, a pivotal event in Islamic history. This migration marked the establishment of the first Muslim community.",
      "significance": "Muharram is considered a sacred month, emphasizing reflection and repentance.  It holds significant religious importance for Muslims worldwide, encouraging introspection and spiritual renewal.  Many Muslims observe fasts and engage in acts of charity during this time.",
      "observance_details": "Traditionally, Muharram is observed with prayer, fasting (particularly on the tenth day, Ashura), and acts of charity.  Reciting the Quran and engaging in religious study are common practices.  Some Muslims also abstain from certain activities, focusing on spiritual devotion.",
      "modern_celebration": "Modern celebrations vary across different cultures.  Many Muslims attend special prayers at mosques, while family gatherings and feasts are common.  The emphasis remains on spiritual reflection and strengthening community bonds.  Social media also plays a role in spreading messages of peace and unity.",
      "impact_and_legacy": "The Islamic New Year reinforces the core tenets of Islam, including faith, community, and social responsibility.  Its emphasis on introspection and spiritual renewal promotes personal growth and moral development. The legacy of Muharram is a continuous cycle of reflection and recommitment to Islamic principles."
    },
    "alternate_names": [
      "Hijri New Year",
      "Arabic New Year",
      "Muharram"
    ],
    "category": "Islam",
    "created_at": "2025-01-07 18:56:58 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:59:38 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Easter",
    "start_date": "20-04-25",
    "additional_details": null,
    "alternate_names": [
      "Easter Sunday",
      "Easter Day",
      "Resurrection Sunday",
      "Paschal Sunday"
    ],
    "category": "Christianity",
    "created_at": "2025-01-07 18:57:00 UTC",
    "end_date": "20-04-25",
    "last_updated": "2025-01-07 19:01:10 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ],
    "additional_information": {
      "historical_background": "Easter is a Christian festival celebrating the resurrection of Jesus Christ, as described in the New Testament. Its origins are rooted in Jewish Passover, reflecting the liberation of the Israelites from slavery in Egypt.  Early Christians adopted and adapted the Passover traditions to commemorate Jesus's triumph over death.",
      "significance": "Easter holds immense religious significance for Christians worldwide, signifying hope, renewal, and the promise of eternal life. It's a time for spiritual reflection and reaffirming faith. Socially, it's a major holiday marked by family gatherings and community celebrations.",
      "observance_details": "Traditional observances include church services, often featuring special hymns and readings from the Bible.  Many participate in Lenten practices leading up to Easter, including fasting and prayer.  The symbolic egg, representing new life, is a prominent element in many Easter traditions.",
      "modern_celebration": "Modern celebrations involve Easter egg hunts for children, family dinners featuring traditional foods like ham or lamb, and gift-giving.  Many participate in community events such as parades and Easter brunches.  The holiday is widely observed, regardless of religious affiliation, as a springtime celebration.",
      "impact_and_legacy": "Easter has significantly impacted Christian theology and spirituality for centuries, shaping religious beliefs and practices. Its enduring legacy lies in the message of hope and redemption it offers, providing comfort and inspiration to countless individuals. Easter continues to be a powerful symbol of rebirth and renewal in many cultures worldwide."
    }
  },
  {
    "name": "Mid-Autumn Festival",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "The Mid-Autumn Festival, also known as the Moon Festival, originated in China during the Zhou dynasty, possibly as a harvest celebration.  Over time, it evolved, incorporating elements of moon worship and legendary stories like that of Chang'e, the moon goddess.  Its traditions spread throughout East and Southeast Asia.",
      "significance": "The festival is a time for family reunions, symbolizing togetherness and harmony.  It's culturally significant as a celebration of the autumn harvest and the beauty of the full moon, a potent symbol in many East Asian cultures. The moon is associated with family unity and togetherness.",
      "observance_details": "Traditional observances include family gatherings, offering mooncakes to ancestors, and admiring the full moon.  Lanterns are lit and children often play lantern-guessing games.  The entire family usually comes together for a special meal.",
      "modern_celebration": "Modern celebrations still center on family gatherings and mooncakes, but also incorporate more modern elements, like elaborate lantern displays and festive decorations.  Many communities organize large-scale events with cultural performances and celebrations.  Traveling to be with family has also become a significant aspect.",
      "impact_and_legacy": "The festival's emphasis on family ties continues to strengthen community bonds.  The rich symbolism surrounding the moon and harvest has inspired art, literature, and music across cultures. It fosters a sense of cultural identity and heritage for many communities in East and Southeast Asia."
    },
    "alternate_names": [
      "Moon Festival",
      "Mooncake Festival"
    ],
    "category": "Additional Observances",
    "created_at": "2025-01-07 18:57:03 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:59:34 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Mahāyāna New Year",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Mahāyāna New Year, unlike a fixed calendar date, is celebrated on the first day of the first lunar month in the traditional lunisolar calendar. Its origins are deeply rooted in East Asian Buddhist traditions, evolving from a combination of pre-existing indigenous festivals and Buddhist principles.",
      "significance": "The New Year signifies a fresh start, a time for reflection and renewal, mirroring Buddhist ideals of self-improvement and spiritual growth. It is a time for family reunions, expressing gratitude, and making resolutions for the coming year.",
      "observance_details": "Traditional observances include temple visits for prayers and blessings, making offerings to deities, cleaning and decorating homes, preparing special foods, and wearing new clothes. Family gatherings are central, with feasts and gift-giving.",
      "modern_celebration": "Modern celebrations retain many traditional aspects but often incorporate contemporary elements.  Public celebrations include temple fairs, cultural performances, and community events.  Many blend secular New Year traditions with Buddhist practices.",
      "impact_and_legacy": "The Mahāyāna New Year has significantly shaped East Asian cultures, fostering community cohesion and spiritual reflection. Its legacy continues in the preservation of traditions, the reinforcement of family bonds, and the enduring influence of Buddhist values."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-07 18:57:07 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:57:03 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Wesak",
    "start_date": "05-05-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Wesak, also known as Buddha Purnima, commemorates the birth, enlightenment, and death (parinirvana) of Gautama Buddha.  Its origins trace back to ancient Buddhist traditions in India and are celebrated across various Buddhist traditions.",
      "significance": "Wesak is a highly significant religious festival for Buddhists worldwide, symbolizing the Buddha's life cycle and embodying the path to enlightenment. It's a time for reflection, spiritual renewal, and strengthening of Buddhist communities.",
      "observance_details": "Traditional observances include meditation, chanting of sutras, and visiting temples.  Monks often engage in special ceremonies, and many Buddhists offer flowers, incense, and candles as offerings.",
      "modern_celebration": "Modern celebrations involve various activities like religious sermons, processions, and community gatherings.  Many Buddhists participate in acts of charity and mindfulness practices, emphasizing compassion and inner peace.",
      "impact_and_legacy": "Wesak continues to foster spiritual growth and promote peace among Buddhist communities globally. Its emphasis on compassion and enlightenment inspires positive social change and strengthens Buddhist identity."
    },
    "alternate_names": [
      "Vesak",
      "Buddha Day",
      "Buddha Purnima",
      "Buddha Jayanti"
    ],
    "category": "Buddhism",
    "created_at": "2025-01-07 18:57:10 UTC",
    "end_date": "05-05-25",
    "last_updated": "2025-01-07 19:01:06 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Yalda",
    "start_date": "21-12-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Yalda, also known as Shab-e Yalda or Shab-e Chelleh, is an ancient Iranian festival marking the winter solstice.  Its origins are pre-Islamic, possibly linked to Zoroastrian traditions celebrating the sun's rebirth.  Over time, it integrated with various cultural and religious influences.",
      "significance": "Yalda signifies the triumph of light over darkness and the symbolic victory of good over evil. It's a time for family gatherings, reinforcing community bonds and celebrating the longest night of the year. The festival is deeply rooted in Iranian culture and heritage.",
      "observance_details": "Traditionally, families gather to recite poetry, particularly works by Hafez, and share stories.  The consumption of fruits, particularly pomegranates and watermelons, symbolizing fertility and good fortune, is central to the celebration.  The night is often spent awake, resisting the darkness.",
      "modern_celebration": "Modern Yalda celebrations maintain many traditional aspects but also incorporate contemporary elements.  Families might watch movies or play games together, and social media plays a role in sharing greetings and photos.  The emphasis on family togetherness and the symbolic significance remain unchanged.",
      "impact_and_legacy": "Yalda’s enduring appeal demonstrates its resilience across generations and cultural shifts. It fosters a sense of national identity and cultural continuity among Iranians globally. The festival's focus on family and community contributes to the social fabric of Iranian society."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-07 18:57:14 UTC",
    "end_date": "21-12-24",
    "last_updated": "2025-01-07 18:57:10 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Ramanavami",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Ramanavami commemorates the birth of Lord Rama, the seventh avatar of Vishnu, in Hindu mythology.  The date is determined by the Hindu lunisolar calendar, falling in the month of Chaitra.  The event's origins are deeply rooted in ancient Indian epics like the Ramayana.",
      "significance": "Ramanavami is a significant religious festival for Hindus worldwide, celebrating the embodiment of dharma, righteousness, and ideal conduct.  It signifies the victory of good over evil, emphasizing the importance of virtue and devotion. The festival reinforces the values of righteousness, courage, and family.",
      "observance_details": "Traditionally, Ramanavami is observed with prayers, chanting of hymns from the Ramayana, and fasting.  Temples hold special pujas (worship ceremonies) and processions featuring idols of Lord Rama.  Devotees often visit temples and offer prayers throughout the day.",
      "modern_celebration": "Modern celebrations often include grand processions, devotional singing, and theatrical performances depicting scenes from the Ramayana.  Many families perform special pujas at home and share festive meals.  Community events and cultural programs also take place.",
      "impact_and_legacy": "Ramanavami strengthens community bonds through collective celebrations and fosters religious devotion. Its enduring legacy lies in the continuous retelling of the Ramayana's story and its emphasis on ethical conduct. The festival inspires individuals to strive for moral excellence and uphold righteous principles."
    },
    "alternate_names": [],
    "category": "Hinduism",
    "created_at": "2025-01-07 18:57:18 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:57:14 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Diwali",
    "start_date": "01-11-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Diwali, the 'festival of lights', is an ancient Hindu festival celebrating the triumph of good over evil and light over darkness.  Its origins are linked to various mythological events, including the return of Lord Rama to Ayodhya after defeating Ravana and the goddess Lakshmi's appearance.",
      "significance": "Diwali holds immense cultural and religious significance for Hindus, Jains, Sikhs, and some Buddhists. It symbolizes new beginnings, prosperity, and the victory of dharma (righteousness) over adharma (unrighteousness).  The festival fosters togetherness and strengthens community bonds.",
      "observance_details": "Traditionally, Diwali is observed by lighting diyas (oil lamps), performing puja (worship) to Lakshmi and Ganesha, sharing sweets and gifts with family and friends, and creating elaborate rangoli designs.  Fireworks displays are also a common feature of the celebrations.",
      "modern_celebration": "Modern Diwali celebrations incorporate many of the traditional practices, but also include new elements like elaborate light decorations, large-scale community events, and online greetings.  The festival has also become a popular celebration for people of different faiths, reflecting its universal message of hope and positivity.",
      "impact_and_legacy": "Diwali's impact is seen in its enduring celebration across diverse communities globally.  Its legacy lies in promoting the values of light, hope, and unity, offering a time for reflection and renewal. The economic impact is also significant, boosting trade and tourism."
    },
    "alternate_names": [
      "Deepavali",
      "Festival of Lights",
      "Deepawali"
    ],
    "category": "Hinduism",
    "created_at": "2025-01-07 18:57:21 UTC",
    "end_date": "01-11-24",
    "last_updated": "2025-01-07 19:01:14 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Sri Krishna Jayanti",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Sri Krishna Janmashtami commemorates the birth of Lord Krishna, a major deity in Hinduism.  The exact date is debated, but it's celebrated on the eighth day of the Krishna Paksha (dark fortnight) in the month of Bhadrapada according to the Hindu lunisolar calendar.  Its origins are rooted in ancient Vedic traditions and the epic Mahabharata.",
      "significance": "The festival signifies the triumph of good over evil, dharma over adharma.  It is a time for spiritual reflection and devotion, celebrating Krishna's divine attributes and his teachings.  Krishna's life and teachings offer profound philosophical and moral guidance.",
      "observance_details": "Traditional observances involve fasting, prayers, chanting of Krishna's names (bhajan), and storytelling related to his life.  Temples are decorated elaborately, and devotees offer prayers and sweets.  Many people observe a fast that ends after midnight.",
      "modern_celebration": "Modern celebrations include grand processions, cultural programs, and theatrical performances depicting Krishna's life.  Homes and temples are decorated with flowers and lights.  Dahi Handi, a competitive pot-breaking event, is a popular feature in many regions.",
      "impact_and_legacy": "Krishna Janmashtami fosters a sense of community and shared faith among Hindus globally.  It reinforces the values of devotion, righteousness, and compassion.  The festival's enduring appeal is a testament to Krishna's lasting influence on Hindu culture and spirituality."
    },
    "alternate_names": [
      "Janmashtami",
      "Krishna Janmashtami",
      "Gokulashtami"
    ],
    "category": "Hinduism",
    "created_at": "2025-01-07 18:57:25 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:59:15 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Raksha Bandhan",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Raksha Bandhan's origins are debated, with some tracing it back to ancient scriptures mentioning a bond between brothers and sisters.  It's also linked to historical instances of alliances formed through tying threads.  Over time, it evolved into a widely celebrated festival.",
      "significance": "The festival celebrates the sacred bond between brothers and sisters, symbolizing protection, love, and responsibility. It emphasizes the importance of familial relationships and mutual support within the family structure.",
      "observance_details": "Traditionally, sisters tie a rakhi, a sacred thread, around their brothers' wrists, praying for their well-being.  Brothers, in return, offer gifts and pledge their lifelong protection.  Rituals may include prayers and a shared meal.",
      "modern_celebration": "Modern celebrations often involve exchanging gifts, elaborate rakhis, and festive meals.  The festival has expanded to include relationships beyond siblings, with people tying rakhis on friends and mentors, signifying a bond of respect and affection.",
      "impact_and_legacy": "Raksha Bandhan reinforces the values of familial bonds and mutual respect within Indian society.  Its lasting legacy is the powerful symbol of sibling love and the enduring strength of family ties, promoting unity and emotional support."
    },
    "alternate_names": [],
    "category": "Hinduism",
    "created_at": "2025-01-07 18:57:28 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:57:25 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Shrove Tuesday",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Shrove Tuesday, also known as Pancake Day, is the day before Ash Wednesday, marking the beginning of Lent in the Christian calendar.  Its origins lie in the medieval practice of using up rich foods like eggs and butter before the Lenten fast.  The term 'Shrove' comes from the Old English word 'shrive', meaning to confess one's sins.",
      "significance": "Shrove Tuesday holds religious significance as a final opportunity for indulgence before the period of penitence. It's a time for community and celebration, often bringing families and neighbours together.  The focus on food transcends religious boundaries, making it a widely enjoyed secular event.",
      "observance_details": "Traditionally, Shrove Tuesday involved confession and the ringing of church bells to call people to confession.  The consuming of pancakes, symbolizing the use of rich ingredients before Lent, became a central part of the day's observance.  Other rich foods were also consumed.",
      "modern_celebration": "Today, Shrove Tuesday is largely celebrated through pancake-making and eating.  Pancake races, often featuring participants tossing pancakes in frying pans as they run, are popular community events.  Many families and individuals simply enjoy making and sharing pancakes at home.",
      "impact_and_legacy": "Shrove Tuesday's legacy lies in its ability to unite people through a shared culinary tradition.  It's a vibrant example of how religious practices can evolve into secular celebrations, maintaining a sense of community and festive spirit.  Its association with pancakes remains globally recognized and widely enjoyed."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-07 18:57:32 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:57:28 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Emancipation Day",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Emancipation Day commemorates the legal emancipation of enslaved African people.  Its specific date varies depending on the jurisdiction, often tied to the abolishment of slavery in a particular region or country.  Many observances are linked to specific acts of emancipation or declarations of freedom.",
      "significance": "Emancipation Day holds profound cultural and social significance, representing a pivotal moment in the fight for freedom and equality.  It symbolizes the resilience and perseverance of formerly enslaved people and serves as a reminder of the ongoing struggle for racial justice. The day emphasizes the importance of remembering this history to create a more equitable future.",
      "observance_details": "Traditional observances vary widely.  They may include church services, parades, picnics, and community gatherings.  Speeches and readings often highlight historical figures and events leading to emancipation.  The focus is usually on celebrating freedom and reflecting on the journey towards equality.",
      "modern_celebration": "Modern celebrations often incorporate educational initiatives and artistic expression to share historical narratives.  Community events often combine music, food, and speeches to create inclusive spaces for remembrance and celebration.  The focus is evolving to incorporate conversations around ongoing systemic inequalities.",
      "impact_and_legacy": "Emancipation Day has significantly impacted societal views on freedom and equality, inspiring ongoing activism and social movements.  Its legacy serves as a constant reminder of the injustices of slavery and the continuing fight for racial justice.  It continues to inspire the pursuit of a more just and equitable society for all."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-07 18:57:36 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:57:32 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Navvarsha",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Navaratri, and thus Navarasha, originates from ancient Hindu scriptures and traditions, evolving over centuries through regional variations and interpretations.  It's linked to the victory of Goddess Durga over the demon Mahishasura, symbolizing the triumph of good over evil.  The festival's specific customs and rituals have varied across different regions and communities.",
      "significance": "Navaratri is a significant Hindu festival celebrating the divine feminine energy (Shakti).  It's a time for spiritual reflection, self-purification, and devotion to the nine forms of the Goddess Durga. The festival fosters community bonding and cultural preservation through shared rituals and traditions.",
      "observance_details": "Traditionally, Navaratri involves nine days of fasting, prayer, and devotional activities dedicated to different forms of the Goddess.  People visit temples, perform pujas (worship ceremonies), and often observe specific dietary restrictions.  Many engage in classical dance performances such as Garba and Dandiya Raas.",
      "modern_celebration": "Modern celebrations often incorporate more vibrant and elaborate festivities. Garba and Dandiya Raas are celebrated with music, dance, and colourful attire in large public gatherings.  Families gather, exchange gifts, and share traditional meals.  The use of technology has broadened accessibility and participation in festivities.",
      "impact_and_legacy": "Navaratri fosters social cohesion through shared rituals and celebrations, strengthening community ties and cultural identity.  Its emphasis on devotion and self-reflection promotes spiritual growth and ethical conduct.  The festival continues to inspire art, music, and dance, preserving ancient traditions for future generations."
    },
    "alternate_names": [],
    "category": "Hinduism",
    "created_at": "2025-01-07 18:57:40 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:57:36 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Laylat al-Qadr",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Laylat al-Qadr, or the Night of Power, is mentioned in the Quran, specifically in Surah Al-Qadr.  It's believed to be the night when the first verses of the Quran were revealed to the Prophet Muhammad.  Its exact date within Ramadan remains unknown, prompting various interpretations and celebrations.",
      "significance": "It's considered the most significant night in the Islamic calendar, exceeding even the value of a thousand months.  Muslims believe that prayers and supplications made on this night are especially answered by God.  It holds immense spiritual and religious significance for Muslims worldwide.",
      "observance_details": "Traditionally, Muslims spend the night in prayer, reciting the Quran, seeking forgiveness, and engaging in acts of worship.  Many attend special Taraweeh prayers in mosques, and families often gather for supplications and reflection.  It's a time for introspection and spiritual rejuvenation.",
      "modern_celebration": "Modern celebrations involve increased attendance at mosques for special prayers and lectures.  Many families stay awake throughout the night in prayer and contemplation, sharing meals and engaging in acts of charity.  The night is marked by a heightened sense of spiritual devotion and community gathering.",
      "impact_and_legacy": "Laylat al-Qadr has profoundly impacted the Islamic faith, reinforcing the importance of devotion, reflection, and divine connection.  Its legacy lies in the annual spiritual renewal it inspires in Muslims globally, strengthening their faith and promoting community bonds.  The search for this blessed night continues to be a potent symbol of hope and faith."
    },
    "alternate_names": [],
    "category": "Islam",
    "created_at": "2025-01-07 18:57:46 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:57:42 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Vaisakhi",
    "start_date": "14-04-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Vaisakhi marks the beginning of the solar New Year for Sikhs and also commemorates the formation of the Khalsa Panth in 1699 by Guru Gobind Singh.  It's also an important harvest festival for Hindus in many parts of India, signifying the start of the new harvest season.",
      "significance": "For Sikhs, Vaisakhi is the most sacred day of the year, celebrating their collective identity and commitment to the Khalsa.  For Hindus, it symbolizes abundance and prosperity, celebrating the bounty of nature's harvest. It represents renewal, community, and spiritual strength for both.",
      "observance_details": "Traditional observances include attending special prayers and processions (nagar kirtan) at Gurdwaras for Sikhs. Hindus often participate in temple visits, prayers, and family gatherings.  Special foods are prepared and shared within communities.",
      "modern_celebration": "Modern celebrations feature large-scale parades, cultural performances, and community feasts.  Many Sikhs wear traditional attire, and there are often festive processions with music and dance.  Celebrations are frequently shared among different communities.",
      "impact_and_legacy": "Vaisakhi fosters a sense of unity and collective identity within Sikh and Hindu communities globally.  Its lasting impact lies in its enduring celebration of faith, heritage, and the agricultural cycle.  The festival continues to promote cultural exchange and understanding."
    },
    "alternate_names": [
      "Baisakhi",
      "Vaisakhdi",
      "Khalsa Day"
    ],
    "category": "Sikhism",
    "created_at": "2025-01-07 18:57:52 UTC",
    "end_date": "14-04-25",
    "last_updated": "2025-01-07 19:01:14 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Day of Ḥajj",
    "start_date": "04-06-25",
    "additional_details": "for students participating in the pilgrimage to Makkah",
    "additional_information": {
      "historical_background": "The Day of Ḥajj (Yawm al-Ḥajj), the culmination of the Hajj pilgrimage, commemorates Abraham's willingness to sacrifice his son Ishmael as an act of obedience to God.  This pivotal event is deeply rooted in Islamic history and is mentioned in the Quran.  The rituals performed on this day directly relate to Abraham's actions and subsequent divine intervention.",
      "significance": "The Day of Ḥajj is the most significant day of the Hajj pilgrimage, symbolizing spiritual renewal and unity among Muslims worldwide. It reinforces the core Islamic values of submission to God, compassion, and community.  The day signifies the completion of the Hajj, bringing spiritual fulfillment to pilgrims.",
      "observance_details": "The day begins with pilgrims assembling at the Plain of Arafat for the 'wuquf' (standing) in prayer and supplication. This is followed by moving to Muzdalifah for collecting pebbles, and then to Mina for the symbolic stoning of the devil (ramī al-jamarāt).  The ritual slaughter of animals (udhiyah) is also a central element.",
      "modern_celebration": "Millions of Muslims globally participate in the Hajj pilgrimage annually, converging in Mecca, Saudi Arabia.  Governments and organizations facilitate the logistics and provide support for the vast number of pilgrims.  Modern technology is increasingly used to manage crowds, provide information, and facilitate communication.",
      "impact_and_legacy": "The Day of Ḥajj fosters a strong sense of global Muslim brotherhood and sisterhood, strengthening social ties.  It leaves a lasting spiritual impact on pilgrims, renewing their faith and devotion. The event's historical and religious significance continues to inspire millions, shaping their lives and communities."
    },
    "alternate_names": [],
    "category": "Islam",
    "created_at": "2025-01-07 18:57:56 UTC",
    "end_date": "09-06-25",
    "last_updated": "2025-01-07 18:57:52 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "ʻĪd al-'Aḍḥá",
    "start_date": "06-06-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Eid al-Adha commemorates Abraham's willingness to sacrifice his son Ishmael (or Isaac, depending on the tradition) as an act of obedience to God.  This story is central to Islam, highlighting faith and devotion. The event marks the culmination of the Hajj pilgrimage.",
      "significance": "It's a major religious festival in Islam, symbolizing sacrifice, devotion, and communal solidarity.  The holiday reinforces the importance of family bonds and sharing with the less fortunate.",
      "observance_details": "Celebrations begin with early morning prayers.  Families perform the sacrifice of an animal (usually a sheep, goat, cow, or camel), sharing the meat with family, friends, and the needy.  Prayers and festive meals are central to the observance.",
      "modern_celebration": "Modern celebrations often include family gatherings, feasts, exchanging gifts, and visiting relatives. Many Muslims attend Eid prayers in mosques or designated open spaces, followed by communal celebrations.  The distribution of sacrificial meat to the poor remains a vital aspect.",
      "impact_and_legacy": "Eid al-Adha fosters strong community bonds through shared experiences and charitable giving.  The emphasis on sacrifice and compassion leaves a lasting impact, promoting values of generosity, empathy, and spiritual devotion within Muslim communities worldwide."
    },
    "alternate_names": [
      "Eid ul-Adha",
      "Eid al-Adha",
      "Bakrid",
      "Greater Eid"
    ],
    "category": "Islam",
    "created_at": "2025-01-07 18:58:00 UTC",
    "end_date": "10-06-25",
    "last_updated": "2025-01-07 19:00:28 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Saka New Year",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Saka New Year, also known as the Saka Era, is a solar lunisolar calendar used in various parts of South and Southeast Asia.  Its origins trace back to the Kushan Empire, around the 1st century CE, with its starting point being a significant historical event of that era. The exact date and reason for its origin remain debated among scholars.",
      "significance": "The Saka New Year holds great cultural and religious significance for many communities. It marks the beginning of a new year, signifying renewal, hope, and fresh starts. It's often associated with harvest festivals and celebrations linked to agriculture and prosperity.",
      "observance_details": "Traditional observances vary regionally but often involve prayers, rituals honoring ancestors, family gatherings, feasts, and the preparation of special dishes.  Cleaning and decorating homes are common preparations, symbolic of the renewal of the year.  Specific rituals may depend on local customs and religious beliefs.",
      "modern_celebration": "In modern times, the Saka New Year is still widely celebrated, often incorporating modern elements alongside traditional practices.  Public holidays and festivals are common, and families may engage in social gatherings and gift-giving.  The event is often promoted through media and tourism, keeping its significance alive in contemporary society.",
      "impact_and_legacy": "The Saka New Year's enduring legacy is its persistence as a calendar system and cultural landmark across regions.  It demonstrates the continuity of cultural practices and traditions over centuries, highlighting the shared historical connections between communities.  Its continued observance ensures the preservation of cultural identity and heritage."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-07 18:58:04 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:58:00 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Āshūrā",
    "start_date": "05-07-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Āshūrā commemorates the martyrdom of Imam Hussein, the grandson of Prophet Muhammad, and his companions at the Battle of Karbala in 680 CE.  It marks a pivotal moment in Islamic history, signifying the struggle against injustice and oppression. The event holds deep significance for Shia Muslims, particularly.",
      "significance": "Āshūrā is a day of mourning and remembrance for Shia Muslims, highlighting themes of sacrifice, loyalty, and the fight for justice.  It underscores the importance of standing up against tyranny and upholding religious principles.  The event fosters community solidarity and strengthens religious identity.",
      "observance_details": "Traditional observances include mourning processions, recitation of elegies (Noha), self-flagellation (matam), and the preparation and distribution of food to the poor.  Many abstain from celebratory activities and focus on reflection and prayer.  The day emphasizes piety and remembrance.",
      "modern_celebration": "Modern celebrations often involve large-scale processions with emotional displays of grief,  the use of multimedia to depict the events of Karbala, and community gatherings for religious sermons and mourning rituals.  Global connectivity has facilitated the sharing of Āshūrā observances across borders.",
      "impact_and_legacy": "Āshūrā has profoundly impacted Shia Islamic identity and practice, shaping its theological and ritual traditions.  Its emphasis on social justice and resistance against oppression continues to inspire activists and social movements. The event serves as a constant reminder of the importance of moral courage and the fight against injustice."
    },
    "alternate_names": [
      "Ashura",
      "Yawm Ashura",
      "Day of Ashura"
    ],
    "category": "Islam",
    "created_at": "2025-01-07 18:58:07 UTC",
    "end_date": "06-07-25",
    "last_updated": "2025-01-07 19:00:46 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Navaratri",
    "start_date": "12-10-24",
    "additional_details": null,
    "alternate_names": [
      "Navratri",
      "Durga Puja",
      "Dussehra"
    ],
    "category": "Hinduism",
    "created_at": "2025-01-07 18:58:08 UTC",
    "end_date": "12-10-24",
    "last_updated": "2025-01-07 19:00:51 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ],
    "additional_information": {
      "historical_background": "Navaratri, meaning 'nine nights', is a Hindu festival celebrating the victory of good over evil.  Its origins are deeply rooted in ancient scriptures and myths, varying regionally with different goddesses celebrated.  The festival's core theme revolves around the divine feminine power (Shakti).",
      "significance": "Navaratri holds immense cultural and social significance, fostering spiritual growth and community bonding.  It's a time for self-reflection, prayer, and devotion, with the nine nights dedicated to different aspects of the divine mother.  The festival strengthens family ties and promotes cultural heritage.",
      "observance_details": "Traditionally, Navaratri involves fasting, prayer, and the worship of a chosen form of the Goddess Durga.  Nine different forms of the Goddess are revered over the nine nights, accompanied by devotional songs and storytelling.  Elaborate rituals, including Kanya Puja (worship of young girls), are common.",
      "modern_celebration": "Modern celebrations blend traditional practices with contemporary elements.  Dandiya Raas and Garba, vibrant folk dances, are popular forms of celebration.  Navaratri is also marked by vibrant decorations, community gatherings, and festive meals.  Many incorporate elements of family and social events.",
      "impact_and_legacy": "Navaratri continues to shape social fabric by promoting unity and religious harmony.  Its emphasis on feminine power and the victory of good inspires individuals to strive for moral strength.  The festival's vibrant cultural expressions ensure its enduring legacy across generations."
    }
  },
  {
    "name": "Hola Mohalla",
    "start_date": "01-01-25",
    "additional_details": null,
    "alternate_names": [],
    "category": "Sikhism",
    "created_at": "2025-01-07 18:58:08 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:58:08 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Theravāda New Year",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Theravada New Year, also known as Sinhala and Tamil New Year, is rooted in ancient South Asian agricultural cycles and the lunar calendar.  It's celebrated by Theravada Buddhists in Sri Lanka, parts of Southeast Asia, and among Sri Lankan diaspora communities.  Its origins trace back to pre-Buddhist traditions, later integrated into Buddhist practices.",
      "significance": "The New Year signifies renewal, hope, and a time for reflection and family bonding. It's a deeply ingrained cultural festival, combining religious observances with secular celebrations, reflecting the interplay between Buddhist and pre-Buddhist traditions in the region.  The occasion fosters communal harmony and strengthens social ties.",
      "observance_details": "Traditional observances involve rituals such as preparing milk rice (kiribath), lighting oil lamps, engaging in religious ceremonies at temples, and visiting family and friends.  Specific times for these activities are determined by astrological calculations to ensure auspicious beginnings.  Families traditionally clean and decorate their homes.",
      "modern_celebration": "Modern celebrations blend traditional practices with contemporary elements. While religious ceremonies remain central, the festivities now often incorporate music, dance, games, and community gatherings.  Commercial activities also play a significant role, with markets buzzing with activity and people exchanging gifts.",
      "impact_and_legacy": "The New Year reinforces cultural identity and strengthens community bonds among Theravada Buddhists.  It plays a crucial role in preserving traditional values and customs, transmitting them across generations.  Its enduring popularity reflects its deep integration into the social fabric of its observance communities."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-07 18:58:12 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:58:08 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Christmas",
    "start_date": "24-12-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Christmas celebrates the birth of Jesus Christ, a central figure in Christianity.  Its origins blend religious traditions with pre-existing winter solstice festivals.  The exact date of Jesus's birth is unknown, with December 25th becoming widely accepted in the 4th century.",
      "significance": "Christmas is a major religious holiday for Christians worldwide, signifying hope and renewal.  It also holds significant cultural importance, fostering family togetherness and community spirit. The exchange of gifts is a central element, symbolizing generosity and love.",
      "observance_details": "Traditional observances often include church services, special meals, the decorating of Christmas trees and homes, and the singing of carols.  Gift-giving plays a prominent role, along with the sharing of stories and traditions related to the nativity.  Many families attend midnight mass on Christmas Eve.",
      "modern_celebration": "Modern celebrations are diverse, blending religious and secular traditions.  Many people focus on family gatherings, exchanging gifts, enjoying festive meals, and participating in various holiday events.  Commercial aspects, such as shopping and media portrayals, are significant components of modern Christmas.",
      "impact_and_legacy": "Christmas has a profound and lasting impact on global culture, influencing art, music, literature, and social customs.  Its emphasis on compassion and generosity inspires charitable giving and community service worldwide. The holiday generates significant economic activity and is a key part of the winter season in many countries."
    },
    "alternate_names": [
      "Christmas Day",
      "Christmas Eve",
      "Nativity of Jesus",
      "Nativity of the Lord"
    ],
    "category": "Christianity",
    "created_at": "2025-01-07 18:58:16 UTC",
    "end_date": "24-12-24",
    "last_updated": "2025-01-07 18:58:12 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Festival of Higan-e",
    "start_date": "20-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Higan-e (彼岸会) is a Buddhist festival observed in Japan during the autumnal equinox.  Its origins trace back to ancient Chinese practices of ancestor veneration, later incorporated into Japanese Buddhist traditions. The festival's focus shifted from purely ancestor worship to a broader contemplation of the ephemeral nature of life.",
      "significance": "Higan-e holds deep spiritual significance, marking a time for remembering deceased relatives and reflecting on the cycle of life and death.  It fosters a sense of community and shared remembrance, reinforcing family ties and Buddhist ideals of compassion and enlightenment. The equinox itself is seen as a liminal period, bridging the realms of the living and the dead.",
      "observance_details": "Traditionally, Higan-e involves visiting family graves to clean and offer flowers and food.  Special Buddhist services are held in temples, and families may prepare special meals.  Seven-day periods before and after the equinox are considered important.",
      "modern_celebration": "While traditional practices persist, modern celebrations often involve simpler offerings and temple visits. Families may gather for meals and remembrance, and some incorporate elements of secular autumnal festivities.  The emphasis remains on reflection and honoring ancestors.",
      "impact_and_legacy": "Higan-e continues to shape Japanese culture through its emphasis on familial bonds and spiritual contemplation.  It underscores the importance of remembering the past and fostering a respectful relationship with nature. Its enduring presence reflects the deep intertwining of Buddhist beliefs and cultural practices in Japan."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-07 18:58:19 UTC",
    "end_date": "20-03-25",
    "last_updated": "2025-01-07 18:58:16 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Pentecost",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Pentecost, described in the Book of Acts, commemorates the descent of the Holy Spirit upon the Apostles fifty days after Jesus' resurrection.  This event is considered the birth of the Christian Church, marking the beginning of its global mission and expansion.",
      "significance": "Pentecost is a pivotal event in Christian theology, signifying the fulfillment of God's promise and the empowerment of the Church to spread the Gospel.  It's also a culturally significant holiday for many Christian denominations, often associated with themes of renewal, spiritual gifts, and unity.",
      "observance_details": "Traditionally, Pentecost is observed with special church services, readings from the Book of Acts, and prayers for the Church's mission.  Many congregations incorporate symbolic elements like the blowing of trumpets, representing the sound of the Spirit's arrival, and the use of fire or light, representing the Holy Spirit.",
      "modern_celebration": "Modern celebrations include special church services, often with music and sermons focused on the Holy Spirit's work.  Some churches hold outdoor services or picnics, reflecting a sense of community and celebration.  Charismatic churches may emphasize spiritual gifts and speaking in tongues.",
      "impact_and_legacy": "Pentecost has profoundly impacted the development and spread of Christianity, shaping its doctrines and practices for centuries. Its emphasis on unity and mission continues to inspire social action and evangelism within various Christian communities around the world."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-07 18:58:23 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:58:19 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "National Indigenous Peoples Day",
    "start_date": "21-06-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "National Indigenous Peoples Day in Canada originated from the 1996 proclamation by then-Governor General Roméo LeBlanc, replacing the previous 'National Aboriginal Day'.  This shift reflected a growing understanding and respect for the diversity of Indigenous cultures. It builds upon the legacy of earlier Indigenous celebrations and commemorations.",
      "significance": "The day holds immense cultural and social significance as it celebrates the heritage, resilience, and diverse cultures of First Nations, Inuit, and Métis peoples. It's a time for honouring their contributions to Canada and fostering reconciliation.  It's a vital opportunity for education and understanding.",
      "observance_details": "Traditionally, Indigenous communities marked the summer solstice with gatherings, ceremonies, and celebrations unique to their specific cultures.  These often involved storytelling, dancing, singing, and sharing traditional foods.  The focus was on community, spirituality, and the renewal of the earth.",
      "modern_celebration": "Today, National Indigenous Peoples Day is celebrated across Canada with various events including powwows, festivals, community gatherings, educational initiatives, and artistic performances.  Many Canadians participate in events organized by Indigenous communities or participate in educational activities to learn more about Indigenous cultures.  It is increasingly being integrated into school curricula.",
      "impact_and_legacy": "National Indigenous Peoples Day fosters greater awareness and appreciation for Indigenous cultures and histories among Canadians.  It promotes reconciliation by highlighting Indigenous perspectives and contributions.  The day continues to evolve, reflecting the ongoing efforts towards truth and reconciliation."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-07 18:58:27 UTC",
    "end_date": "21-06-25",
    "last_updated": "2025-01-07 18:58:23 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "St. Patrick's Day",
    "start_date": "17-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "St. Patrick's Day originates from the death of Saint Patrick, the foremost patron saint of Ireland, believed to have occurred on March 17th.  Initially a religious holiday, it commemorated his life and missionary work in converting the Irish to Christianity.  Over time, it evolved from a solely religious observance to a more secular celebration.",
      "significance": "St. Patrick's Day holds immense cultural and social significance for the Irish diaspora worldwide. It's a celebration of Irish heritage, identity, and pride, fostering a strong sense of community among people of Irish descent. The holiday also promotes Irish culture, traditions, and history to a global audience.",
      "observance_details": "Traditional observances involved religious services, parades, and community gatherings.  People wore green, a color associated with Ireland and springtime, and enjoyed traditional Irish food and music.  The wearing of shamrocks, a three-leaf clover, was also a prominent tradition.",
      "modern_celebration": "Modern celebrations are often large-scale events featuring parades, festivals, and concerts.  The consumption of green beer and other alcoholic beverages is widespread, along with wearing green clothing and attending Irish-themed parties.  Many cities and towns worldwide host St. Patrick's Day events, attracting large crowds.",
      "impact_and_legacy": "St. Patrick's Day has significantly impacted global perceptions of Irish culture.  It has helped preserve and promote Irish traditions internationally, creating a sense of global Irish community. The holiday's evolution reflects the changing dynamics of cultural preservation and celebration in a globalized world."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-07 18:58:31 UTC",
    "end_date": "17-03-25",
    "last_updated": "2025-01-07 18:58:27 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Ganesh Chaturthi",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Ganesh Chaturthi commemorates the birth of Lord Ganesha, the elephant-headed god of wisdom and prosperity.  Its origins are traced back to the 19th century, popularized by Bal Gangadhar Tilak as a means of promoting Indian nationalism.  The festival's roots, however, lie in ancient Hindu scriptures.",
      "significance": "Ganesh Chaturthi is a significant Hindu festival celebrated with immense devotion and fervor.  It symbolizes the triumph of good over evil and the removal of obstacles. The festival fosters a strong sense of community and shared religious experience.",
      "observance_details": "Traditionally, devotees install a clay idol of Ganesha in their homes or public pandals.  Daily prayers, aartis (devotional songs), and offerings are made throughout the festival.  The idol is immersed in water on the final day, Anant Chaturdashi, signifying the return of Ganesha to his abode.",
      "modern_celebration": "Modern celebrations involve elaborate public processions, grand pandals with themed decorations, and cultural programs.  Celebrities and politicians often participate, and the festival has become a major tourist attraction. Immersions are often accompanied by large-scale celebrations.",
      "impact_and_legacy": "Ganesh Chaturthi promotes social harmony and strengthens community bonds.  The festival's economic impact is significant due to increased spending and employment opportunities.  Its legacy continues to inspire artistic expression, devotion, and cultural pride."
    },
    "alternate_names": [
      "Vinayaka Chaturthi",
      "Ganeshotsav"
    ],
    "category": "Hinduism",
    "created_at": "2025-01-07 18:58:34 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 19:00:24 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Lucia",
    "start_date": "13-12-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Lucia, celebrated on December 13th, originates from the Roman festival of Saturnalia and the veneration of Saint Lucy, a Sicilian martyr.  Her association with light stems from legends depicting her bringing food to persecuted Christians, often at night, guided by a lamp.",
      "significance": "Lucia is a significant cultural event in Scandinavia and parts of Europe, marking the darkest time of the year and celebrating the return of light. It symbolizes hope, purity, and the triumph of light over darkness, holding both religious and secular meaning.",
      "observance_details": "Traditionally, the celebration involves a young girl, dressed as Saint Lucy in a white robe and a crown of candles, leading a procession.  She often carries saffron buns (lussekatter) and ginger snaps (pepparkakor).  Family gatherings and special foods are central to the day.",
      "modern_celebration": "Modern celebrations often involve variations of the traditional Lucia procession in schools, churches, and community events.  The baking and sharing of traditional foods remain important, along with the lighting of candles and festive gatherings.",
      "impact_and_legacy": "Lucia's enduring legacy lies in its ability to blend religious and secular traditions, offering a time of community and celebration amidst the winter darkness.  It promotes values of hope, light, and shared cultural heritage, continuing to resonate with diverse communities."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-07 18:58:38 UTC",
    "end_date": "13-12-24",
    "last_updated": "2025-01-07 18:58:34 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Nirvana Day",
    "start_date": "05-05-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Nirvana Day commemorates the Parinirvana of Gautama Buddha, his final passing and entrance into Nirvana.  Traditionally believed to have occurred in 483 BCE, it marks the end of his earthly life and the attainment of ultimate enlightenment.",
      "significance": "Nirvana Day is a highly significant event in Buddhism, representing the culmination of Buddha's teachings and the path to liberation from suffering.  It emphasizes the importance of achieving enlightenment and escaping the cycle of rebirth.",
      "observance_details": "Traditionally, Nirvana Day is observed with meditation, chanting of Buddhist sutras, and visits to temples.  Monks and lay followers often engage in special ceremonies and prayers reflecting on Buddha's life and teachings.",
      "modern_celebration": "Modern celebrations often include public lectures, meditation retreats, and community gatherings focused on Buddhist principles.  Many Buddhists participate in acts of charity and selfless service in remembrance of the Buddha's compassion.",
      "impact_and_legacy": "Nirvana Day continues to inspire millions of Buddhists worldwide, reinforcing their commitment to spiritual practice.  It serves as a potent reminder of the potential for human enlightenment and the pursuit of inner peace."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-07 18:58:41 UTC",
    "end_date": "05-05-25",
    "last_updated": "2025-01-07 18:58:38 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Martyrdom of Guru Arjan Dev Ji",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Guru Arjan Dev Ji, the fifth Sikh Guru, compiled the Adi Granth, the Sikh scripture.  His commitment to Sikhism and refusal to compromise with Mughal Emperor Jahangir led to his persecution.",
      "significance": "His martyrdom is a pivotal moment in Sikh history, symbolizing unwavering faith and sacrifice. It solidified the Adi Granth's central role and strengthened the Sikh community's resolve.",
      "observance_details": "The martyrdom is commemorated annually on the day of his passing.  Sikh devotees visit Gurdwaras, recite Gurbani (Sikh scripture), and participate in Akhand Paths (continuous recitation of the Adi Granth).",
      "modern_celebration": "Large gatherings take place at Harmandir Sahib (Golden Temple) and other Gurdwaras worldwide.  Kirtan (devotional singing) and Katha (religious discourse) are central to the commemorations.",
      "impact_and_legacy": "Guru Arjan Dev Ji's sacrifice inspired countless Sikhs and strengthened their commitment to their faith. His martyrdom cemented the Adi Granth's authority and laid the foundation for future Sikh Gurus."
    },
    "alternate_names": [],
    "category": "Sikhism",
    "created_at": "2025-01-07 18:58:44 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:58:41 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Festival of Ksitigarbha",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "The Festival of Ksitigarbha, also known as the Ullambana Festival, originated in East Asia, stemming from Buddhist scriptures detailing Ksitigarbha's vow to save beings in the Naraka (hell realms).  Its roots lie in ancient filial piety traditions and evolved over centuries incorporating various regional customs.",
      "significance": "The festival is deeply significant for expressing filial piety, honoring ancestors, and seeking blessings for them.  It emphasizes the interconnectedness of living and deceased relatives and the power of compassionate action to alleviate suffering in the afterlife.",
      "observance_details": "Traditionally, families perform rituals including offering food, chanting sutras dedicated to Ksitigarbha, and making merit through charitable acts.  Monasteries often hold large-scale ceremonies, including chanting and offerings, to benefit deceased beings.",
      "modern_celebration": "Modern celebrations often blend traditional practices with contemporary expressions of piety.  Families may visit temples, participate in group chanting, donate to charity, or engage in vegetarian diets during the festival period.  Online platforms also facilitate participation and information sharing.",
      "impact_and_legacy": "The festival continues to reinforce family values and the importance of ancestor veneration across East Asian societies.  Its emphasis on compassion and liberation has left a lasting impact on Buddhist teachings and ethics, shaping social attitudes toward death and the afterlife."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-07 18:58:48 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:58:44 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "All Saints Day",
    "start_date": "01-11-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "All Saints' Day, also known as All Hallows' Day, originated in the early medieval church, possibly as early as the 7th century. It was initially a day to honor all Christian martyrs and later expanded to include all saints, known and unknown. The date, November 1st, was likely chosen to be close to the end of the harvest season.",
      "significance": "All Saints' Day holds significant religious importance for Christians, serving as a time to remember and celebrate the lives of all those who have entered into eternal life.  It is a day of reflection on faith and the communion of saints. The holiday is also deeply interwoven with various cultural traditions and practices, varying across different regions.",
      "observance_details": "Traditionally, All Saints' Day involves attending special masses or church services, praying for the departed, and visiting cemeteries to honor deceased loved ones.  Many cultures incorporate special foods, candles, and prayers as part of the remembrance. Some regions hold processions and parades to commemorate the saints.",
      "modern_celebration": "Modern celebrations vary greatly depending on location and cultural background. Many still attend religious services, visit cemeteries, and light candles.  Some communities hold festivals, parades, or special events honoring saints, while others incorporate the holiday into family gatherings and memorials. Halloween celebrations often precede All Saints' Day in many places.",
      "impact_and_legacy": "All Saints' Day continues to shape cultural calendars and religious practices across the globe.  Its emphasis on community remembrance, reflection on faith, and honoring the deceased has left a lasting impact on society. The tradition of commemorating saints and the departed strengthens community bonds and reinforces spiritual beliefs."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-07 18:58:52 UTC",
    "end_date": "01-11-24",
    "last_updated": "2025-01-07 18:58:48 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Birth Date of Guru Nanak Dev Ji",
    "start_date": "15-11-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Guru Nanak Dev Ji, the founder of Sikhism, was born on Kartik Poornima in 1469 CE (though the exact date is debated).  His birth marked the beginning of the Sikh faith and a transformative period in Indian religious history. His teachings emphasized monotheism, selfless service, and equality.",
      "significance": "Guru Nanak's birth is celebrated as a pivotal moment in Sikh history, commemorating the advent of a new spiritual path. It signifies the beginning of a faith emphasizing universal brotherhood and social justice, impacting millions of lives across centuries. The day holds immense spiritual significance for Sikhs worldwide.",
      "observance_details": "Traditionally, the day is observed with prayers, hymns (kirtan), and the reading of Guru Granth Sahib.  Langar (community kitchen) is a central feature, providing free meals to all.  Families gather for prayers and share special meals.",
      "modern_celebration": "Modern celebrations include large-scale gatherings at Gurdwaras (Sikh temples) with akhand paths (continuous recitation of scriptures).  Processions, cultural programs, and community service initiatives are common.  Many Sikhs visit holy sites and participate in religious discourse.",
      "impact_and_legacy": "Guru Nanak's teachings continue to inspire social reform and interfaith harmony.  His emphasis on equality and justice has had a profound influence on Sikh identity and the broader Indian social landscape.  His legacy continues to shape the values and principles of millions."
    },
    "alternate_names": [],
    "category": "Sikhism",
    "created_at": "2025-01-07 18:58:56 UTC",
    "end_date": "15-11-24",
    "last_updated": "2025-01-07 18:58:52 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Victoria Day",
    "start_date": "19-05-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Victoria Day is a Canadian federal holiday observed annually on the Monday before May 25th, celebrating the birthday of Queen Victoria.  It originated as a way to honor the monarch who reigned for over six decades and oversaw significant growth in Canada during that period.",
      "significance": "The holiday holds cultural significance as a symbol of Canadian heritage and ties to British monarchy, albeit with evolving interpretations. It's a time for reflection on Canadian history and identity, and serves as a long weekend to escape the daily routine.",
      "observance_details": "Traditionally, Victoria Day involved parades, community gatherings, and formal events celebrating the Queen.  Many families would enjoy picnics or backyard barbecues and hoist the Union Jack flag.",
      "modern_celebration": "Modern celebrations maintain elements of community gatherings and family time, often involving picnics, barbecues, and outdoor activities. Many Canadians use the long weekend for travel and relaxation, while some still participate in local parades or commemorative events.",
      "impact_and_legacy": "Victoria Day contributes to the collective identity of Canadians by fostering a sense of community and national unity.  The holiday continues to provide a long weekend break from work and study, contributing to Canadians' leisure and well-being."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-07 18:58:59 UTC",
    "end_date": "19-05-25",
    "last_updated": "2025-01-07 18:58:56 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Magha Puja",
    "start_date": "12-02-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Magha Puja commemorates the gathering of 1,250 arahants (enlightened beings) with the Buddha at Veluvanarama monastery in Rajagaha during the full moon of Magha.  This event is considered highly significant as it involved the spontaneous assembly of all the arahants without prior planning.  It is one of the eight important Buddhist holidays.",
      "significance": "Magha Puja symbolizes the unity and harmony within the Sangha (Buddhist community). It emphasizes the importance of moral conduct, meditation, and wisdom.  The event serves as a reminder of the Buddha's teachings and the path to enlightenment.",
      "observance_details": "Traditional observance includes attending sermons and meditation sessions at Buddhist temples.  Monks and lay followers engage in chanting and prayers, reflecting on the Buddha's teachings.  Many participate in merit-making activities such as offering alms and food to monks.",
      "modern_celebration": "Modern celebrations often involve large-scale gatherings at temples, featuring chanting, sermons, and meditation retreats.  Many incorporate educational programs to teach about the significance of Magha Puja and the Buddha's teachings.  Celebrations are also observed via online platforms, making it accessible to a wider audience.",
      "impact_and_legacy": "Magha Puja reinforces the principles of Buddhist ethics and practice, fostering community and spiritual growth.  The event promotes social harmony and understanding among Buddhists worldwide.  Its enduring legacy lies in its ability to inspire individuals to strive for enlightenment and contribute positively to society."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-07 18:59:03 UTC",
    "end_date": "12-02-25",
    "last_updated": "2025-01-07 18:58:59 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Thanksgiving",
    "start_date": "01-10-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Thanksgiving's origins trace back to the 1621 harvest feast shared by the Pilgrims and Wampanoag Native Americans at Plymouth, Massachusetts.  However, the modern celebration evolved over centuries, diverging significantly from the historical event.  The holiday's official establishment as a national holiday occurred much later, in 1863.",
      "significance": "Thanksgiving is a significant cultural holiday in the United States and Canada, emphasizing gratitude, family, and the harvest.  It's a time for reflection and appreciation for blessings, both big and small.  The holiday often serves as a centerpiece of the fall season and a time for family reunions.",
      "observance_details": "Traditionally, Thanksgiving involves a large feast centered around a roasted turkey, along with other dishes like stuffing, mashed potatoes, and pumpkin pie.  Families gather for this meal, often engaging in conversations and activities together.  Giving thanks is a central theme.",
      "modern_celebration": "Modern Thanksgiving celebrations often include parades, football games, and community events, in addition to family gatherings.  Many people travel to be with loved ones for the holiday, making it a significant travel period.  The focus remains on expressing gratitude and enjoying time with family and friends.",
      "impact_and_legacy": "Thanksgiving's legacy includes its role in shaping American national identity and fostering a sense of community and togetherness.  It has evolved into a powerful symbol of gratitude and family.  However, the holiday's historical context and its complex relationship with Native American history are subjects of increasing discussion and critical reflection."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-07 18:59:07 UTC",
    "end_date": "01-10-24",
    "last_updated": "2025-01-07 18:59:03 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Hanuman Jayanti",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Hanuman Jayanti commemorates the birth of Lord Hanuman, a prominent figure in the Hindu epic Ramayana.  The exact date is debated, but it's widely celebrated on the full moon day (Purnima) in the Hindu month of Chaitra (March-April).  The festival's origins trace back to ancient Hindu traditions and storytelling.",
      "significance": "Hanuman is revered for his unwavering devotion to Lord Rama, embodying strength, courage, and selfless service.  The festival reinforces these values and inspires devotees to emulate his qualities. Hanuman Jayanti is a significant religious occasion emphasizing faith, dedication, and the triumph of good over evil.",
      "observance_details": "Traditional observances include fasting, reciting Hanuman Chalisa (a devotional hymn), visiting temples dedicated to Hanuman, and performing special pujas (worship rituals).  People offer prayers, fruits, and flowers.  Many devotees also participate in processions and community gatherings.",
      "modern_celebration": "Modern celebrations incorporate a wider range of activities, including large-scale processions, community feasts, and cultural programs.  Many organizations organize devotional songs, discourses, and storytelling sessions. The use of social media and online platforms has broadened the reach of the festival globally.",
      "impact_and_legacy": "Hanuman Jayanti promotes communal harmony and strengthens religious bonds.  The festival's emphasis on devotion and selfless service continues to inspire individuals across various communities. Hanuman's legacy of unwavering faith and strength remains a source of inspiration for generations."
    },
    "alternate_names": [],
    "category": "Hinduism",
    "created_at": "2025-01-07 18:59:11 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:59:07 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "National Flag of Canada Day",
    "start_date": "01-02-25",
    "additional_details": null,
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-07 18:59:11 UTC",
    "end_date": "01-02-25",
    "last_updated": "2025-01-07 18:59:11 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "National Day for Remembrance and Action on Violence Against Women",
    "start_date": "06-12-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "The National Day for Remembrance and Action on Violence Against Women in Canada was established in 1991 to commemorate the 14 women murdered at l'École Polytechnique de Montréal in 1989.  This tragic event highlighted the pervasive issue of gender-based violence and the need for societal change.",
      "significance": "The day holds deep significance as a moment of remembrance for victims of violence and a call to action against gender inequality. It serves as a powerful reminder of the ongoing struggle for women's safety and equality in Canada and globally.",
      "observance_details": "Traditionally, the day is observed through vigils, memorial services, and educational events focusing on violence against women.  Many communities hold candlelight vigils to honour the victims and raise awareness.",
      "modern_celebration": "Modern celebrations include online awareness campaigns, educational workshops, and public demonstrations aiming to spread awareness and demand policy changes.  Many organizations dedicate the day to fundraising and advocating for survivors.",
      "impact_and_legacy": "The day has significantly raised public awareness of gender-based violence in Canada.  It has contributed to increased support for survivors, influencing policy changes and improvements in services aimed at prevention and intervention."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-07 18:59:15 UTC",
    "end_date": "06-12-24",
    "last_updated": "2025-01-07 18:59:11 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Ash Wednesday",
    "start_date": "05-03-25",
    "additional_details": null,
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-07 18:59:15 UTC",
    "end_date": "05-03-25",
    "last_updated": "2025-01-07 18:59:15 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Indigenous Veterans Day",
    "start_date": "01-11-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Indigenous Veterans Day lacks a single, universally recognized origin date.  However, its roots lie in the increasing acknowledgment of the significant contributions of Indigenous peoples to the military service of their respective nations.  The movement gained momentum through grassroots efforts and the advocacy of Indigenous communities and veterans' organizations.",
      "significance": "This day holds immense cultural and social significance by honoring the courage and sacrifices made by Indigenous veterans who often faced discrimination and prejudice alongside the challenges of war.  It provides a platform to acknowledge their service and recognize their unique cultural perspectives within the broader context of military history. It serves as a crucial step towards reconciliation and healing.",
      "observance_details": "Traditional observances vary across Indigenous communities.  Many involve ceremonies, storytelling, and honoring of veterans through traditional practices.  Some communities hold parades or gatherings to remember those who served.",
      "modern_celebration": "Modern celebrations include community events, powwows, ceremonies, and memorial services recognizing Indigenous veterans' contributions.  Many organizations and institutions participate in public awareness campaigns and educational programs.  Social media plays a role in disseminating information and promoting awareness.",
      "impact_and_legacy": "Indigenous Veterans Day continues to raise awareness of the historical injustices faced by Indigenous veterans and promotes the recognition of their service.  It fosters a greater understanding of the diverse contributions to military service and strengthens the relationship between Indigenous communities and the broader society. The day encourages continued efforts towards reconciliation and improved support for Indigenous veterans."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-07 18:59:19 UTC",
    "end_date": "01-11-24",
    "last_updated": "2025-01-07 18:59:15 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Vikram New Year",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Vikram Samvat, the Vikram New Year, is a lunisolar Hindu calendar era that originated in 57 BCE in Ujjain, India.  It's named after King Vikramaditya, a legendary ruler.  The calendar is still widely used in some parts of India for religious and social events.",
      "significance": "Vikram Samvat holds great religious significance for Hindus, marking the beginning of a new year according to their traditional calendar.  It's associated with new beginnings, prosperity, and the triumph of good over evil. It's a time for spiritual reflection and renewal.",
      "observance_details": "Traditionally, the new year is celebrated with prayers, rituals, and offerings at temples. Families gather for feasts, exchange gifts, and perform special pujas.  The day is considered auspicious for starting new ventures.",
      "modern_celebration": "Modern celebrations involve temple visits, community gatherings, and family feasts.  People decorate their homes, exchange greetings, and participate in cultural events.  It's a time for social bonding and expressing joy.",
      "impact_and_legacy": "Vikram Samvat continues to be an important part of Hindu culture, shaping their socio-religious life.  Its enduring use highlights the resilience of traditional calendars and their continued relevance in modern society. The calendar’s longevity demonstrates the strength of cultural traditions."
    },
    "alternate_names": [],
    "category": "Hinduism",
    "created_at": "2025-01-07 18:59:22 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:59:19 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Midsummer",
    "start_date": "21-06-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Midsummer, or the summer solstice, has ancient roots in various pagan cultures, celebrating the sun's peak power and the height of summer.  Many traditions trace back to pre-Christian festivals honoring deities associated with fertility and the sun.  Over time, these celebrations blended with Christian traditions, though some pagan aspects remain.",
      "significance": "Midsummer holds deep cultural significance as a time of renewal, celebration, and community bonding.  It marks a pivotal point in the agricultural year and symbolizes abundance and prosperity.  The long daylight hours have often been associated with magic and mystical powers.",
      "observance_details": "Traditional Midsummer celebrations often involve bonfires, symbolizing the sun's power and warding off evil spirits.  Maypoles, dancing, and feasting are common, along with the gathering of herbs and flowers believed to possess special properties.  Some traditions include rituals to ensure a good harvest.",
      "modern_celebration": "Modern Midsummer celebrations often incorporate elements of the traditional observances, such as bonfires and festivities.  Many people use the time for outdoor gatherings, family reunions, and music festivals.  While some still retain strong pagan connections, many celebrate it as a secular holiday celebrating the longest day of the year.",
      "impact_and_legacy": "Midsummer's legacy is evident in various cultural traditions and celebrations worldwide.  Its influence is visible in literature, music, and art, shaping our understanding of summer and the natural world.  The celebration's enduring popularity suggests a continuing need to mark this pivotal time of year."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-07 18:59:26 UTC",
    "end_date": "21-06-25",
    "last_updated": "2025-01-07 18:59:22 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Ascension",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Ascension Day commemorates the ascension of Jesus Christ into Heaven, forty days after his resurrection.  The event is described in the Gospels and is a pivotal moment in Christian theology, signifying Christ's triumph over death and his return to God the Father.  Early Christians celebrated this event with various forms of worship and processions.",
      "significance": "Ascension Day is a significant Christian holiday marking the completion of Christ's earthly ministry and the beginning of his reign in Heaven. It affirms the hope of resurrection and eternal life for believers. The ascension underscores the promise of the Holy Spirit's coming, empowering the disciples to spread the Gospel.",
      "observance_details": "Traditionally, Ascension Day was observed with church services, often involving processions and the reading of special liturgical texts.  Prayers of thanksgiving and celebration were central to the observances, reflecting the joy and hope associated with Christ's ascension.  In some cultures, special meals and community gatherings accompanied religious services.",
      "modern_celebration": "Modern celebrations often involve special church services and sermons focusing on the themes of Christ's ascension and the gift of the Holy Spirit.  Many churches incorporate hymns and prayers reflective of the event's spiritual significance. While large-scale processions are less common, some communities maintain traditional observances.",
      "impact_and_legacy": "Ascension Day has shaped Christian theology, art, and culture for centuries.  The event's depiction in religious art and literature has had a lasting impact on visual representations of Christ's final act on Earth. The theological significance continues to be a central aspect of Christian faith and practice, inspiring hope and reaffirming belief in the resurrection."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-07 18:59:30 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:59:26 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Pavarana Day",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Pavarana marks the end of the three-month Vassa retreat observed by Buddhist monks and nuns.  Originating in ancient India, it signifies the conclusion of a period of intensive spiritual practice and study during the rainy season.  This period of seclusion provided a time for reflection and deepening one's Buddhist practice.",
      "significance": "Pavarana is a highly significant event in the Buddhist calendar, symbolizing the culmination of spiritual discipline and the re-entry of monks and nuns into society. It reinforces the importance of community and shared practice within the Buddhist tradition.  The formal process of confession and mutual reconciliation underscores the values of humility and forgiveness.",
      "observance_details": "Traditionally, Pavarana involves a formal ceremony where monks and nuns publicly confess any wrongdoings committed during the Vassa.  Senior monks address the assembly, and younger monks seek forgiveness. This process of reconciliation fosters community harmony and strengthens the Sangha.",
      "modern_celebration": "Modern celebrations often include special sermons, lectures, and meditation sessions focused on themes of reflection, self-improvement, and community engagement.  Lay Buddhists participate by attending these events and reflecting on their own practice during the past three months.  Many also offer alms and donations to support the monasteries.",
      "impact_and_legacy": "Pavarana continues to reinforce the core Buddhist principles of self-reflection, ethical conduct, and community harmony.  Its emphasis on confession and reconciliation fosters social cohesion and personal growth.  The lasting legacy is a strengthening of the Buddhist Sangha and a renewed commitment to spiritual practice."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-07 18:59:34 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:59:30 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Sir John A. Macdonald Day",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Sir John A. Macdonald Day commemorates the birth of Sir John A. Macdonald, Canada's first Prime Minister.  Established to honor his role in Confederation, the date has been observed in various forms since his death in 1891.  The specific date of observance varies across provinces and territories.",
      "significance": "The day holds significance as a recognition of Canada's founding and the legacy of its first Prime Minister.  However, this legacy is complex and continues to be debated, sparking discussions around Canada's history and national identity.  Macdonald's contributions are viewed differently depending on the perspective of various communities.",
      "observance_details": "Traditionally, Sir John A. Macdonald Day involved formal ceremonies, speeches, and historical reenactments focusing on his life and contributions to Confederation.  These events often featured parades and public gatherings celebrating Canadian history.  Many communities also hosted educational programs and historical displays.",
      "modern_celebration": "Modern celebrations often involve educational programs and discussions aimed at a more nuanced understanding of Macdonald's legacy, balancing achievements with critiques of his policies toward Indigenous peoples.  There is a growing emphasis on reflecting upon the complexities of Canada's past and fostering open dialogue.  Some provinces have ceased official celebrations or shifted focus.",
      "impact_and_legacy": "The impact of Sir John A. Macdonald's legacy continues to be felt in Canada's political and social landscape.  His role in Confederation remains a cornerstone of Canadian history, but critical examination of his policies concerning Indigenous peoples is essential for understanding Canada's national identity. His leadership is simultaneously celebrated and condemned, highlighting ongoing debates about Canada's historical narrative."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-07 18:59:38 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:59:34 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Navaratri",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Navaratri, meaning 'nine nights', is a Hindu festival celebrating the victory of good over evil.  Its origins are deeply rooted in ancient scriptures and myths, varying regionally with different deities celebrated during the nine nights.  The festival's core theme revolves around the divine feminine energy, Shakti.",
      "significance": "Navaratri holds immense cultural and religious significance, representing the triumph of dharma over adharma.  It is a time for spiritual reflection, self-purification, and seeking divine blessings. The festival unites communities and strengthens social bonds through shared celebrations.",
      "observance_details": "Traditionally, Navaratri involves fasting, prayer, and the worship of a specific Devi (goddess) each night.  Devotional songs (bhajans) and storytelling are common practices.  Many devotees perform elaborate pujas (ritualistic worship) at home or temples.",
      "modern_celebration": "Modern celebrations often incorporate vibrant cultural performances like Garba and Dandiya Raas dances, especially in Gujarat and Western India.  Pandals (temporary structures) are erected for community gatherings and festivities.  The festival is also celebrated globally by Hindu communities with adapted traditions.",
      "impact_and_legacy": "Navaratri's enduring impact lies in its reinforcement of spiritual values and community cohesion.  It's a significant cultural event promoting harmony and religious tolerance. The festival's legacy continues through its evolving celebrations and its persistent message of hope and victory of good."
    },
    "alternate_names": [
      "Navratri",
      "Durga Puja",
      "Dussehra"
    ],
    "category": "Hinduism",
    "created_at": "2025-01-07 18:59:42 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 19:00:58 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Martyrdom of Guru Tegh Bahadur Ji",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "In 1675, Mughal Emperor Aurangzeb's policy of forced conversions targeted Kashmiri Pandits. Guru Tegh Bahadur Ji, the ninth Sikh Guru, offered himself as a sacrifice to protect them, challenging Aurangzeb's religious persecution.  His execution in Delhi followed his refusal to convert to Islam.",
      "significance": "The martyrdom is a profound symbol of religious tolerance and sacrifice for the sake of others.  It solidified the Sikh identity and strengthened the faith's commitment to defending religious freedom. Guru Tegh Bahadur Ji's sacrifice is a powerful testament to courage and unwavering principles.",
      "observance_details": "The martyrdom is solemnly observed by Sikhs through Akhand Paths (continuous recitation of the Guru Granth Sahib), Kirtan (devotional singing), and Katha (religious discourse).  Special prayers and commemorative services are held in Gurdwaras (Sikh temples) worldwide.  The day is marked with deep reflection and remembrance.",
      "modern_celebration": "Modern celebrations involve large gatherings at Gurdwaras, featuring religious ceremonies and community meals (Langar).  Many Sikhs participate in processions and organize educational programs to highlight Guru Tegh Bahadur Ji's life and teachings.  The event is widely commemorated through media and online platforms.",
      "impact_and_legacy": "Guru Tegh Bahadur Ji's sacrifice inspired countless individuals and significantly strengthened the Sikh community's resolve. His martyrdom cemented the principles of religious freedom and tolerance as core tenets of Sikhism.  His legacy continues to inspire advocates for human rights and religious pluralism globally."
    },
    "alternate_names": [],
    "category": "Sikhism",
    "created_at": "2025-01-07 18:59:46 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:59:42 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "start_date": "25-12-24",
    "name": "Christmas",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Christmas celebrates the birth of Jesus Christ, a central figure in Christianity.  Its origins blend Christian traditions with pagan winter solstice celebrations, resulting in the holiday's unique blend of religious and secular elements.  The exact date of Jesus' birth is unknown, and December 25th was likely chosen to coincide with existing winter festivals.",
      "significance": "Christmas is a major religious holiday for Christians worldwide, signifying the incarnation of God and the promise of salvation.  Culturally, it's a time for family gatherings, gift-giving, and reflection, fostering feelings of goodwill and community spirit.  Its symbolism of hope, peace, and renewal resonates across diverse cultures.",
      "observance_details": "Traditional observances include church services, the telling of the Nativity story, caroling, and decorating homes with Christmas trees and lights.  Families often share special meals and exchange gifts.  The giving of gifts symbolizes the gifts given to Jesus by the Magi.",
      "modern_celebration": "Modern Christmas celebrations incorporate many secular traditions alongside religious practices.  Gift-giving has become a major focus, often involving commercial aspects.  Celebrations frequently include festive gatherings, decorating, watching Christmas movies, and enjoying special meals.  Travel and social events also play a significant role.",
      "impact_and_legacy": "Christmas has profoundly impacted Western culture, shaping traditions, art, music, and literature.  Its emphasis on generosity and compassion has influenced charitable giving and community engagement.  Its enduring global appeal reflects its capacity to transcend religious boundaries and foster a sense of shared celebration."
    },
    "alternate_names": [
      "Christmas Day",
      "Christmas Eve",
      "Nativity of Jesus",
      "Nativity of the Lord"
    ],
    "category": "Christianity",
    "created_at": "2025-01-07 18:59:50 UTC",
    "end_date": "25-12-24",
    "last_updated": "2025-01-07 19:00:51 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Saint-Jean-Baptiste Day",
    "start_date": "24-06-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Saint-Jean-Baptiste Day, celebrated on June 24th, commemorates the birth of John the Baptist.  Its celebration in Quebec dates back to the French regime, evolving from religious observances to a broader expression of Québécois identity.  Over time, the holiday became deeply intertwined with the development of a distinct Francophone culture in North America.",
      "significance": "The day is a powerful symbol of Québécois culture and national pride.  It represents a celebration of French language and heritage, fostering a sense of community and collective identity amongst Francophones. Saint-Jean-Baptiste Day serves as a vital reminder of Québécois history and its enduring spirit.",
      "observance_details": "Traditional celebrations often include religious masses followed by community gatherings.  Feasts, music, and dancing were central to earlier celebrations, emphasizing the communal aspect of the event.  Parades and public displays of Québécois pride are also integral aspects of the holiday's historical observance.",
      "modern_celebration": "Modern celebrations are vibrant and diverse, featuring large-scale festivals across Quebec.  Concerts, fireworks displays, and family-oriented activities fill public spaces.  These modern celebrations are more secular, encompassing a wide range of people and expressions of Québécois identity.",
      "impact_and_legacy": "Saint-Jean-Baptiste Day has profoundly shaped Québécois identity, providing a focal point for cultural expression and national unity.  It continues to promote and preserve the French language and culture, serving as a powerful symbol of resilience and cultural pride.  The holiday's enduring legacy is its ability to continually adapt while remaining a symbol of Québécois heritage."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-07 18:59:54 UTC",
    "end_date": "24-06-25",
    "last_updated": "2025-01-07 18:59:50 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Laylat al Baraat",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Laylat al-Baraat, or the Night of Forgiveness, is believed to have originated in Islamic tradition, with roots possibly tracing back to early interpretations of the Quran and Hadith.  Its exact origins are debated amongst Islamic scholars, with various interpretations of its significance and historical basis existing. The night is associated with divine judgment and the potential for forgiveness of sins.",
      "significance": "Culturally, it's a night of intense prayer and reflection, focusing on seeking forgiveness from Allah.  Socially, it reinforces the importance of repentance and self-improvement within the Muslim community. The night holds a strong spiritual significance for many Muslims, emphasizing the importance of seeking forgiveness and renewal.",
      "observance_details": "Traditional observance involves intense prayer, recitation of the Quran, seeking forgiveness, and performing acts of charity. Many Muslims spend the night in prayer, seeking blessings and atonement for past sins.  Special prayers and supplications (duas) are offered throughout the night.",
      "modern_celebration": "In modern times, many Muslims continue the traditional practices, often incorporating communal prayers and gatherings.  The night is often marked by increased religious devotion and reflection, with many individuals spending time in personal prayer and introspection.  Some mosques hold special prayer services or gatherings.",
      "impact_and_legacy": "Laylat al-Baraat fosters a strong sense of spiritual renewal and promotes introspection within the Muslim community.  Its focus on forgiveness and repentance reinforces ethical values and encourages personal growth.  The enduring legacy of the night lies in its sustained impact on individual spirituality and communal piety."
    },
    "alternate_names": [],
    "category": "Islam",
    "created_at": "2025-01-07 18:59:58 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:59:54 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Bodhi Day",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Bodhi Day commemorates the day Siddhartha Gautama, the historical Buddha, attained enlightenment under the Bodhi tree in Bodh Gaya, India.  This event, believed to have occurred around the full moon in December, marks a pivotal moment in Buddhist history, signifying the beginning of the Buddha's teachings.",
      "significance": "Bodhi Day is a significant holiday for Buddhists worldwide, representing the culmination of the Buddha's spiritual journey and the beginning of the dissemination of Buddhist principles. It serves as a time for reflection, meditation, and renewed commitment to the path of enlightenment.",
      "observance_details": "Traditionally, Bodhi Day is observed through meditation, chanting sutras, and attending special ceremonies at temples.  Monks may engage in extended periods of meditation, and lay practitioners often participate in group chanting and study of Buddhist teachings.",
      "modern_celebration": "Modern celebrations often include meditation retreats, lectures on Buddhist philosophy, and special services at temples.  Many Buddhists visit temples, participate in group practices, and dedicate the day to personal spiritual reflection and growth.",
      "impact_and_legacy": "Bodhi Day's enduring legacy lies in its continued inspiration for Buddhists to strive for enlightenment. It reinforces the core tenets of Buddhism and encourages mindful living. The day fosters community and shared spiritual practice among followers worldwide."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-07 19:00:01 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 18:59:58 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Theophany",
    "start_date": "06-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Theophany, also known as Epiphany, commemorates the baptism of Jesus Christ by John the Baptist.  Its origins trace back to early Christian celebrations marking Jesus' manifestation as the Son of God.  The event's theological significance solidified its place in the liturgical calendar.",
      "significance": "Theophany signifies the revelation of the Holy Trinity – God the Father, Son, and Holy Spirit – through the baptism of Jesus.  It's a pivotal event in Christian theology, marking the beginning of Jesus' public ministry and his identity as the Messiah.  The feast holds deep spiritual meaning for believers worldwide.",
      "observance_details": "Traditionally, Theophany involves church services featuring the blessing of water, symbolizing the purification and sanctification brought about by Jesus' baptism.  Many churches conduct processions and immersions into natural bodies of water.  The water blessed on this day is considered holy and often kept for blessings throughout the year.",
      "modern_celebration": "Modern celebrations vary across denominations but frequently include special church services with hymns and readings related to the baptism of Jesus.  The blessing of water remains a central element, often incorporating the distribution of blessed water to congregants.  Some communities continue the tradition of processions and symbolic immersions.",
      "impact_and_legacy": "Theophany has profoundly impacted Christian art, literature, and theology, shaping artistic depictions of the baptism and theological understandings of the Trinity.  Its enduring legacy continues to inspire devotion and faith.  The tradition of blessing water has contributed to the cultural significance of water in many societies."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-07 19:00:05 UTC",
    "end_date": "06-01-25",
    "last_updated": "2025-01-07 19:00:01 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Palm Sunday",
    "start_date": "13-04-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Palm Sunday commemorates Jesus' triumphal entry into Jerusalem, as described in the Gospels.  The event, occurring a week before Passover, marks the beginning of Holy Week. Its origins trace back to the early Christian church's liturgical practices.",
      "significance": "Palm Sunday is a significant event in the Christian liturgical year, symbolizing Jesus's kingship and the fulfillment of prophecy.  It bridges the joyful anticipation of the triumphal entry with the solemn events of Holy Week, emphasizing both joy and suffering.",
      "observance_details": "Traditionally, Palm Sunday involves processions with palms or olive branches, symbolizing victory and peace.  Congregations often read the Gospel accounts of the entry into Jerusalem, and special hymns are sung.",
      "modern_celebration": "Modern celebrations often include processions, the blessing and distribution of palms, and special church services. Many churches incorporate music, readings, and reflections on the meaning of Jesus's arrival in Jerusalem.",
      "impact_and_legacy": "Palm Sunday's lasting legacy lies in its role in shaping Christian understanding of Jesus's identity and mission.  The symbolism of the palm branch continues to resonate as a powerful symbol of victory and faith, impacting Christian art and devotional practices."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-07 19:00:08 UTC",
    "end_date": "13-04-25",
    "last_updated": "2025-01-07 19:00:05 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Le Réveillon de Noël",
    "start_date": "24-12-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Le Réveillon de Noël, or Christmas Eve supper, has roots in the medieval period, evolving from simple feasts to more elaborate celebrations.  Its origins are linked to the religious observance of Christmas and the breaking of the Christmas fast.  The tradition solidified over centuries, becoming a cornerstone of French Christmas celebrations.",
      "significance": "It holds immense cultural and social significance in France, representing a time for family unity, reflection, and shared joy.  The meal itself is symbolic, often featuring traditional dishes passed down through generations.  It marks the transition from the anticipation of Christmas to the joyous celebration of the holiday itself.",
      "observance_details": "Traditionally, the Réveillon begins late on Christmas Eve and extends into the early hours of Christmas Day.  Families gather for a lavish feast featuring dishes like oysters, foie gras, and bûche de Noël (Yule log).  The meal is often accompanied by storytelling, carols, and gift-giving.",
      "modern_celebration": "Modern celebrations retain many traditional elements but show some adaptation.  While the emphasis on family remains strong,  some modern variations include more diverse menus reflecting changing culinary trends and cultural influences.  The late-night aspect might be adjusted depending on family preferences.",
      "impact_and_legacy": "The Réveillon has profoundly impacted French culture, shaping Christmas traditions and culinary practices. Its emphasis on family and togetherness continues to resonate deeply within French society. The tradition's persistence ensures the continued transmission of cultural heritage across generations."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-07 19:00:12 UTC",
    "end_date": "24-12-24",
    "last_updated": "2025-01-07 19:00:08 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Commonwealth Day",
    "start_date": "09-03-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Commonwealth Day's origins trace back to Empire Day in 1902, celebrating the British Empire.  It evolved into Commonwealth Day in 1977, reflecting a shift towards a voluntary association of independent nations.  The day's focus shifted from imperial power to shared values and cooperation.",
      "significance": "Commonwealth Day fosters a sense of global community among its member nations, celebrating shared history, culture, and values. It promotes international cooperation on issues of common concern such as trade, environmental protection, and human rights.  The event underscores the importance of multilateralism and the strength found in unity.",
      "observance_details": "Traditionally, Commonwealth Day involves church services, flag-raising ceremonies, and speeches highlighting the Commonwealth's achievements and challenges.  Many schools and communities hold events focused on education and cultural exchange, emphasizing the diversity within the Commonwealth.  National leaders and dignitaries often participate in commemorative events.",
      "modern_celebration": "Modern celebrations include a variety of online and offline events, utilizing social media to increase global participation.  Educational programs focusing on Commonwealth history and contemporary issues are widely promoted, and events often emphasize youth engagement and their perspectives.  The Commonwealth Secretariat plays a crucial role in coordinating global celebrations and campaigns.",
      "impact_and_legacy": "Commonwealth Day has helped to build international understanding and cooperation among diverse nations. It has fostered a sense of collective identity and common purpose, particularly in addressing global challenges. Its legacy is a network of collaborative efforts toward peace, prosperity, and sustainable development within the Commonwealth nations."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-07 19:00:16 UTC",
    "end_date": "09-03-25",
    "last_updated": "2025-01-07 19:00:12 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Laylat al-Mi'rāj",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Laylat al-Mi'raj (Night of the Ascension) commemorates the Prophet Muhammad's miraculous night journey from Mecca to Jerusalem and then to the heavens.  This event, described in Islamic tradition, is believed to have occurred during the 10th year of the Prophet's prophethood. It holds immense spiritual significance within Islam.",
      "significance": "The Mi'raj signifies a pivotal moment in Islamic history, reinforcing the Prophet's role as God's messenger.  It underscores the importance of prayer and devotion, as well as the divine nature of Islam's core tenets. The journey symbolizes the spiritual ascent and the closeness of God to humanity.",
      "observance_details": "Traditionally, Laylat al-Mi'raj is observed through special prayers, recitation of the Quran, particularly Surah Al-Isra, and reflection on the Prophet's journey.  Many Muslims spend the night in prayer and engage in acts of worship and charity.  Some communities hold special gatherings and lectures.",
      "modern_celebration": "In modern times, the event is often marked with sermons, lectures, and religious gatherings in mosques and community centers.  Many Muslims use this night for introspection, spiritual renewal, and increased prayer.  Media and online platforms also play a significant role in disseminating information and promoting the significance of the event.",
      "impact_and_legacy": "Laylat al-Mi'raj reinforces the strength of faith and the importance of spiritual connection for Muslims globally.  Its legacy lies in its continuous inspiration of devotion and reflection, contributing to the spiritual enrichment of Muslim communities.  The event inspires acts of charity and a strengthened commitment to Islamic teachings."
    },
    "alternate_names": [],
    "category": "Islam",
    "created_at": "2025-01-07 19:00:20 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 19:00:16 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Asalha Puja",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Asalha Puja commemorates the first sermon given by the Buddha after his enlightenment at Sarnath, India.  This sermon, known as the Dhammacakkappavattana Sutta, marked the beginning of the spread of Buddhism. The event is believed to have occurred during the full moon of Asalha (July/August).",
      "significance": "Asalha Puja is one of the most important events in the Buddhist calendar, signifying the dissemination of the Buddha's teachings and the establishment of the Sangha (Buddhist monastic order). It's a time for reflection, reaffirmation of Buddhist principles, and strengthening the community bond.",
      "observance_details": "Traditionally, Asalha Puja is observed with chanting, meditation, and sermons based on the Dhammacakkappavattana Sutta.  Monks often give special lectures, and devotees offer flowers, candles, and incense at temples.  Many observe eight precepts for ethical self-reflection.",
      "modern_celebration": "Modern celebrations often involve large gatherings at temples, featuring chanting, sermons, and meditation sessions.  Many Buddhists visit temples for merit-making and participate in community activities.  The event is also marked by religious processions and candlelit vigils.",
      "impact_and_legacy": "Asalha Puja reinforces Buddhist values and promotes ethical conduct among followers. It strengthens the connection between Buddhist communities globally, fostering a shared identity and faith.  The continued observance ensures the enduring legacy of the Buddha's teachings and their relevance in contemporary society."
    },
    "alternate_names": [],
    "category": "Buddhism",
    "created_at": "2025-01-07 19:00:24 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 19:00:20 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "4shanbe Souri",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Chaharshanbe Suri, or Wednesday Night, is an ancient Zoroastrian tradition dating back centuries, possibly pre-Islamic Persia. It's linked to the celebration of the arrival of spring and the renewal of nature, signifying the triumph of light over darkness.",
      "significance": "The event symbolizes the purification of the past year and welcoming of the new.  It's a communal celebration that reinforces social bonds and promotes a sense of shared identity within the community.  The symbolic burning of unwanted things represents cleansing and renewal.",
      "observance_details": "Traditionally, people jump over bonfires, symbolizing the purification of the body and spirit. They also make noise with firecrackers and drums, believed to ward off evil spirits.  The sharing of food and sweets is a crucial element of the celebration.",
      "modern_celebration": "While bonfires remain central, modern celebrations often incorporate fireworks and various forms of public gatherings.  Social media plays a significant role, with people sharing photos and videos of their celebrations.  Increased safety regulations have also modified some traditional aspects.",
      "impact_and_legacy": "Chaharshanbe Suri remains a vibrant and unifying cultural tradition in Iran and amongst Iranian diaspora communities. Its resilience through historical changes underscores its importance as a symbol of Iranian identity and cultural continuity. It has inspired similar celebrations in other regions influenced by Persian culture."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-07 19:00:28 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 19:00:24 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Persons Day",
    "start_date": "21-02-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Persons Day, while not a globally recognized holiday with a singular, established origin, conceptually stems from various historical traditions celebrating individuals and their contributions.  Roots can be traced to ancient festivals honoring patron saints or community leaders, gradually evolving into broader appreciations of human value.",
      "significance": "Persons Day, in its various forms, highlights the inherent worth and dignity of every human being. It underscores the importance of individual contributions to society, fostering respect, empathy, and recognition of diverse perspectives.",
      "observance_details": "Traditional observances varied widely depending on the specific context.  Some involved community gatherings, speeches praising individuals, or acts of charity in the name of specific benefactors or saints. Others focused on personal reflection and gratitude for one's relationships.",
      "modern_celebration": "Modern celebrations might include acts of kindness, volunteering, or expressing gratitude towards significant people in one's life. Some organizations might host events celebrating personal achievements or community service.  Social media often plays a role, sharing messages of appreciation and recognition.",
      "impact_and_legacy": "Persons Day, despite lacking a singular, widely accepted date, has a lasting impact by promoting human connection and compassion.  Its emphasis on celebrating individuals fosters stronger communities and a greater sense of shared humanity. The underlying principles continue to inform various social initiatives and ethical frameworks."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-07 19:00:31 UTC",
    "end_date": "21-02-25",
    "last_updated": "2025-01-07 19:00:28 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Pride Weekend",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Pride events originated in the aftermath of the Stonewall Riots of 1969, a pivotal moment of resistance against police raids on LGBTQ+ bars.  The first Pride marches commemorated this uprising and began advocating for LGBTQ+ rights.  These early events laid the groundwork for the widespread celebrations we see today.",
      "significance": "Pride Weekend holds immense cultural significance as a demonstration of LGBTQ+ pride, visibility, and solidarity. It serves as a powerful reminder of the ongoing fight for equality and serves as a celebration of LGBTQ+ identity and achievements.  The event fosters community and encourages allyship.",
      "observance_details": "Traditionally, Pride Weekend features parades, marches, and rallies advocating for LGBTQ+ rights and social justice.  Community gatherings and festivals are central, celebrating LGBTQ+ culture through performances, art, and music.  Pride events initially focused on raising awareness and demanding legal protections.",
      "modern_celebration": "Modern Pride celebrations are vibrant and diverse, encompassing parades, festivals, concerts, and workshops.  Many Pride events incorporate elements of political activism, continuing the fight for equality, and celebrating the progress made.  The celebrations often feature inclusivity across various identities within the LGBTQ+ community.",
      "impact_and_legacy": "Pride Weekend has significantly impacted society by increasing LGBTQ+ visibility and fostering acceptance. It has contributed to significant legislative changes and advancements in LGBTQ+ rights.  The event's legacy lies in its ongoing ability to build community, promote activism, and celebrate the rich diversity of the LGBTQ+ experience."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-07 19:00:35 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 19:00:31 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Advent",
    "start_date": "01-12-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Advent, meaning 'arrival' in Latin, originated in the 4th century as a period of spiritual preparation for the celebration of Christmas.  Early observances focused on penitence and prayer, mirroring Lenten practices. It gradually evolved into a season of anticipation for Christ's birth.",
      "significance": "Advent holds significant religious meaning for Christians, representing a time of reflection and hope.  Culturally, it marks the beginning of the Christmas season, influencing social activities and commercial practices worldwide. It provides a spiritual counterpoint to the secular commercialism often associated with Christmas.",
      "observance_details": "Traditionally, Advent involved a period of fasting and increased prayer.  Special liturgical services were held, focusing on prophecies of Christ's coming.  The use of Advent calendars and wreaths, each symbolizing the approaching Christmas, became popular practices.",
      "modern_celebration": "Modern Advent celebrations include lighting Advent wreaths with candles, each representing a week leading up to Christmas.  Many families use Advent calendars, opening a small gift or image each day.  Church services emphasize themes of hope, peace, joy, and love, reflecting the prophecies of Christ's arrival.",
      "impact_and_legacy": "Advent's emphasis on reflection and spiritual preparation has had a lasting impact on Christian spirituality.  Its influence on the Christmas season is evident globally, shaping cultural expressions and creating a unique anticipation for the holiday. The Advent wreath and calendar remain powerful symbols of hope and the coming of Christ."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-07 19:00:39 UTC",
    "end_date": "24-12-24",
    "last_updated": "2025-01-07 19:00:35 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Good Friday",
    "start_date": "18-04-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Good Friday commemorates the crucifixion of Jesus Christ, as described in the New Testament.  It falls on the Friday before Easter Sunday and is considered the holiest day of the year for Christians. Its origins are rooted in early Christian traditions.",
      "significance": "Good Friday holds profound religious significance as it marks the ultimate sacrifice of Jesus Christ for humanity's salvation.  It is a day of mourning, reflection, and prayer for Christians worldwide, embodying themes of suffering, redemption, and hope.",
      "observance_details": "Traditionally, Good Friday is observed through church services, often including readings from the Gospels detailing the crucifixion.  Many Christians participate in fasting, prayer, and acts of penance.  The day is typically marked by solemnity and a spirit of quiet reflection.",
      "modern_celebration": "Modern celebrations often involve church services focusing on the crucifixion and resurrection.  Many churches hold special Good Friday processions or Stations of the Cross.  Observances can range from quiet personal reflection to large community gatherings.",
      "impact_and_legacy": "Good Friday's enduring impact lies in its shaping of Christian theology and the moral and ethical framework of numerous societies.  Its themes of sacrifice, redemption, and forgiveness continue to resonate with believers and non-believers alike, influencing art, literature, and culture."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-07 19:00:43 UTC",
    "end_date": "18-04-25",
    "last_updated": "2025-01-07 19:00:39 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Labour Day",
    "start_date": "01-09-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Labour Day originated in the late 19th century from the labour movement's fight for workers' rights and better working conditions.  Inspired by events like the Haymarket affair, it became a day to commemorate those struggles and advocate for continued progress.  The first official Labour Day was celebrated in Canada in 1894, with the US following shortly after.",
      "significance": "Labour Day holds immense cultural and social significance as a public holiday honoring the contributions of workers.  It serves as an annual reminder of the ongoing importance of workers' rights, fair wages, and safe working environments. It represents a collective acknowledgement of the labour force's role in societal prosperity.",
      "observance_details": "Traditionally, Labour Day involved parades showcasing unions and workers' organizations.  Speeches highlighting labour issues and achievements were common. Family picnics and gatherings were also typical celebrations.",
      "modern_celebration": "Modern celebrations often still include parades and family gatherings, but they are often more informal and less centrally organized than in the past.  Many enjoy a long weekend of leisure activities, while unions may still organize smaller events focusing on advocacy.",
      "impact_and_legacy": "Labour Day has had a significant impact on workers' rights, leading to improved safety standards, reasonable working hours, and fair wages. Its legacy is the ongoing advocacy for better labour conditions and the continued fight for social and economic justice for all workers."
    },
    "alternate_names": [],
    "category": "Additional Observances",
    "created_at": "2025-01-07 19:00:46 UTC",
    "end_date": "01-09-25",
    "last_updated": "2025-01-07 19:00:43 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Remembrance Day",
    "start_date": "11-11-24",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Remembrance Day originated in the aftermath of World War I, initially known as Armistice Day, commemorating the armistice signed on November 11, 1918.  Its purpose was to honor the millions who died in the conflict and to ensure such a devastating war never happened again. The name evolved to Remembrance Day to encompass all those who have served and died in subsequent conflicts.",
      "significance": "Remembrance Day holds immense cultural and social significance as a time for national reflection and remembrance of military personnel who gave their lives in service. It serves as a powerful symbol of unity, peace, and gratitude for the sacrifices made for the country's freedom and security. The day promotes empathy and understanding for the impacts of war and conflict.",
      "observance_details": "Traditionally, Remembrance Day is observed with a two-minute silence at 11:00 am on November 11th, the time the armistice was signed.  People wear red poppies, a symbol of remembrance, and attend services at war memorials or cenotaphs.  Many participate in parades and wreath-laying ceremonies.",
      "modern_celebration": "Modern celebrations include similar commemorative events, but also incorporate broader educational initiatives to teach younger generations about the significance of the day and the cost of war.  Social media plays a key role in spreading awareness and personal reflections.  Many schools and communities host educational events alongside Remembrance Day observances.",
      "impact_and_legacy": "Remembrance Day has profoundly impacted society by fostering collective memory and promoting peace. It has created a lasting legacy of remembering the sacrifices of service members and promoting understanding of the consequences of war.  The enduring tradition of the poppy and the two-minute silence are powerful reminders of the value of peace and the need to avoid future conflicts."
    },
    "alternate_names": [],
    "category": "National Commemorative Days",
    "created_at": "2025-01-07 19:00:51 UTC",
    "end_date": "11-11-24",
    "last_updated": "2025-01-07 19:00:46 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Epiphany",
    "start_date": "06-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Epiphany, also known as Three Kings Day, celebrates the visit of the Magi to the infant Jesus.  Its origins trace back to early Christian traditions commemorating the manifestation of Christ to the Gentiles.  The specific date was likely chosen to coincide with existing pagan festivals marking the winter solstice and the beginning of a new year.",
      "significance": "Epiphany holds significant religious importance as it marks the revelation of Jesus Christ as the Son of God to the world.  Culturally, it symbolizes the universality of God's message and the unity of all people in faith.  It's a time of reflection, celebration, and sharing.",
      "observance_details": "Traditional observances include attending special church services, processions reenacting the journey of the Magi, and the blessing of water.  Many cultures feature festive meals and gift-giving, often reflecting the gifts brought by the Wise Men.",
      "modern_celebration": "Modern celebrations vary across cultures, but often include festive meals with family and friends, gift-giving, particularly to children, and the singing of carols.  Some communities maintain the tradition of the Epiphany procession and the blessing of homes.",
      "impact_and_legacy": "Epiphany continues to impact society through its emphasis on faith, generosity, and the universality of Christ's message.  Its legacy is evident in the many artistic representations of the Magi and the ongoing traditions of gift-giving and celebration around the world."
    },
    "alternate_names": [],
    "category": "Christianity",
    "created_at": "2025-01-07 19:00:58 UTC",
    "end_date": "06-01-25",
    "last_updated": "2025-01-07 19:00:54 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Lohri",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Lohri is an ancient Punjabi harvest festival, its origins possibly linked to the winter solstice and the celebration of the sun's return.  Some believe it's connected to the mythological tale of Dulla Bhatti, a folk hero who helped the poor and oppressed.  Over time, it has absorbed various traditions and evolved into a vibrant festival.",
      "significance": "Lohri marks the end of the winter solstice and the beginning of longer days, symbolizing hope and prosperity.  It is a significant celebration of harvest, signifying the bounty of the land and the abundance of crops.  The festival also plays a role in strengthening community bonds through shared festivities.",
      "observance_details": "Traditionally, Lohri is celebrated with a bonfire, signifying the burning away of the old and welcoming the new. People gather around the bonfire, sing folk songs, and share food like popcorn, peanuts, and gur (jaggery). Offerings are also made to the bonfire.",
      "modern_celebration": "Modern celebrations often incorporate elaborate feasts, music, and dance.  Families and communities gather for large gatherings, often featuring DJ music and contemporary dance alongside traditional songs.  Lohri is now widely celebrated both in Punjab and by Punjabi diaspora communities worldwide.",
      "impact_and_legacy": "Lohri's vibrant celebration fosters a strong sense of community and cultural identity amongst Punjabis. Its enduring legacy lies in its ability to adapt to changing times while retaining its core values of hope, prosperity, and communal harmony.  The festival continues to play a vital role in preserving Punjabi heritage and traditions."
    },
    "alternate_names": [],
    "category": "Sikhism",
    "created_at": "2025-01-07 19:01:02 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 19:00:58 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "start_date": "30-09-25",
    "name": "National Day for Truth and Reconciliation",
    "additional_details": null,
    "additional_information": {
      "historical_background": "The National Day for Truth and Reconciliation in Canada was established in 2021 to honor the victims of the residential school system.  It stems from the Truth and Reconciliation Commission's (TRC) Calls to Action, specifically Call to Action #80, which recommended a statutory holiday.",
      "significance": "This day is significant for acknowledging the devastating legacy of the residential schools and the ongoing impacts on Indigenous communities.  It serves as a time for reflection, education, and reconciliation between Indigenous and non-Indigenous peoples.",
      "observance_details": "Traditionally, the day involves attending ceremonies and events to honor survivors and those who perished.  Many engage in education and reflection on the history and lasting effects of the residential school system.  Moments of silence and prayer are also common.",
      "modern_celebration": "Modern celebrations often include participation in educational events, attending community gatherings, and engaging in personal reflection.  Many organizations host events and educational programming throughout the day, focusing on truth, reconciliation, and Indigenous voices.",
      "impact_and_legacy": "The day's impact includes raising public awareness about the history and harms of residential schools.  It fosters conversations about reconciliation and works to create a more inclusive and equitable future for Indigenous peoples in Canada.   The legacy of the day is intended to promote healing and lasting change."
    },
    "alternate_names": [
      "Orange Shirt Day"
    ],
    "category": "Additional Observances",
    "created_at": "2025-01-07 19:01:06 UTC",
    "end_date": "30-09-25",
    "last_updated": "2025-01-07 19:01:06 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  },
  {
    "name": "Arbaeen",
    "start_date": "01-01-25",
    "additional_details": null,
    "additional_information": {
      "historical_background": "Arbaeen marks the 40th day after Ashura, the day Imam Hussein, the grandson of Prophet Muhammad, was martyred in the Battle of Karbala in 680 CE.  It's a Shia Muslim commemoration of Hussein's sacrifice and a demonstration of loyalty to his cause. The pilgrimage to Karbala on Arbaeen is believed to have begun soon after the event.",
      "significance": "Arbaeen is a significant Shia Muslim event demonstrating solidarity and mourning for Imam Hussein's martyrdom. It underscores the principles of justice, fighting oppression, and devotion to religious leadership. The pilgrimage is a powerful expression of faith and communal identity.",
      "observance_details": "Traditionally, Arbaeen involves mourning rituals, recitations of elegies (Nohas), and processions expressing grief and sorrow.  Many Shia Muslims undertake a pilgrimage to Karbala, Iraq, the site of Imam Hussein's martyrdom, to pay their respects.  These pilgrims often walk long distances to reach Karbala.",
      "modern_celebration": "Modern Arbaeen celebrations include large-scale processions and gatherings in Karbala and other Shia communities worldwide.  Millions of pilgrims participate in the walk to Karbala, representing a global expression of Shia identity and faith.  The event is aided by significant logistical efforts to support the pilgrims.",
      "impact_and_legacy": "Arbaeen fosters a sense of global Shia unity and strengthens communal bonds.  It highlights the importance of social justice and resistance to tyranny. The event's massive scale and global reach demonstrate the enduring impact of Imam Hussein's legacy and the strength of Shia faith."
    },
    "alternate_names": [],
    "category": "Islam",
    "created_at": "2025-01-07 19:01:10 UTC",
    "end_date": "01-01-25",
    "last_updated": "2025-01-07 19:01:06 UTC",
    "source_urls": [
      "https://registrar.yorku.ca/enrol/dates/religious-accommodation-resource-2024-2025"
    ]
  }
]